{
  "visual_script": "\n--- SCENE 1 ---\n\n\n(/scene_frame_chunk_start/)\n\n[1.3.cA] (Frame)\n[CAM: Medium shot, high angle looking down, static, 50mm]\n[POS: CHAR_MEI screen left foreground elevated, CHAR_LIN screen right background street level]\n[LIGHT: Soft morning key from east, filtered through wooden screens, gentle fill on balcony]\n[PROMPT: Medium shot from [LOC_MEI_BEDROOM_PATIO] overlooking [LOC_PRESSED_DIRT_ROAD]. Morning light filters from the east, casting soft shadows through carved wooden screens. [CHAR_MEI] (screen-left, facing right) kneels on silk cushions, her morning robe whispering against the wooden balcony railing. Below on the street, [CHAR_LIN] (screen-right, distant) emerges from his corner shop, his figure small but distinct as he arranges wooden buckets with gentle precision. The elevated perspective emphasizes the physical and social distance between them. Merchants' carts move along the pressed dirt road, their voices carrying upward. The ornate mother-of-pearl inlay of the balcony railing catches the morning light. AXIS OF ACTION established between Mei's elevated position and Lin's street-level activities.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[1.5.cA] (Frame)\n[CAM: Extreme close-up, eye-level angle, static, 135mm macro lens]\n[POS: CHAR_MEI center foreground, wooden screen pattern background]\n[LIGHT: Natural key from east window, soft fill through carved patterns, delicate shadow play across face]\n[PROMPT: Close-up of [CHAR_MEI] (screen-left as established) pressed against the carved wooden screen on [LOC_MEI_BEDROOM_PATIO]. Same morning light from the east illuminates her face through the intricate patterns, creating delicate shadows across her features. Her breathing has quickened, visible in the subtle rise and fall of her silk robe. Her fingers grip the screen's wooden framework, knuckles slightly white with tension. Her eyes are fixed downward toward the street, pupils dilated with anticipation. The mother-of-pearl inlay blurs in the shallow depth of field behind her. Her expression shows a mixture of longing and determination as she watches Lin disappear back into his shop. The soft morning light quality remains consistent, emphasizing the intimate moment of decision.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[1.6.cA] (Frame)\n[CAM: Extreme close-up, eye level, static, 100mm macro]\n[POS: CHAR_MEI center foreground, eyes and upper face filling frame]\n[LIGHT: Soft natural key from east, carved screen creating dappled shadows, gentle fill maintaining detail in shadow areas]\n[PROMPT: Extreme close-up of [CHAR_MEI]'s eyes and upper face. The same soft morning light from the east creates a gentle key light across her features. Her dark eyes reflect unwavering resolve, pupils focused with laser-like intensity. Fine details visible: the slight tremor of her eyelashes, the determined set of her brow, the way morning light catches the moisture gathering at the corners of her eyes - not tears of sadness, but of anticipation. The carved wooden screen pattern creates subtle shadows across her skin. Her breathing is controlled but intense, nostrils slightly flared. The extreme close-up isolates her from the world around her, emphasizing this pivotal moment of internal transformation. The lighting remains consistent with previous frames, maintaining the established morning atmosphere.]\n\n(/scene_frame_chunk_end/)\n\n\n## Scene 1:\nOrnate wooden balcony overlooking the village street\n\nThe morning light filtered through carved wooden screens, casting delicate shadows across the silk cushions where [CHAR_MEI] knelt on her private balcony. Below, the [LOC_PRESSED_DIRT_ROAD] stirred to life as merchants wheeled their carts toward market, their voices carrying upward like distant music. The [LOC_LU_XIAN_BROTHEL] commanded the finest view in the pleasure quarter, its elevated position a testament to [CHAR_MADAME_CHOU]'s shrewd business sense, yet Mei felt the height more as prison than privilege.\n\nHer fingers traced the intricate mother-of-pearl inlay of the balcony's railing, each swirl and curve as familiar as her own reflection. Twenty years of mornings had passed this way, watching the world below while remaining forever apart from it. The silk of her morning robe whispered against her skin as she shifted, the sound as practiced and controlled as everything else in her carefully orchestrated existence.\n\n(/scene_frame_chunk_start/)\n[1.3.cA] (Medium Shot)\nThen, as if summoned by her thoughts, [CHAR_LIN] emerged from the small shop at the corner. Even from this distance, she could see the gentle precision in his movements as he arranged wooden buckets outside his door, each one destined to hold the day's fresh blooms. His hands moved with unhurried care, the same tenderness she imagined he showed his flowers in their private moments of growth.\n(/scene_frame_chunk_end/)\n\nMei's breath caught as he paused, lifting his face toward the morning sun. There was something in that simple gesture—a communion with light and warmth that spoke of a man who found joy in life's quiet offerings. How different his world seemed from hers, where every gesture carried calculation, every smile a price.\n\n(/scene_frame_chunk_start/)\n[1.5.cA] (Close-up)\nShe pressed closer to the screen, her heart beating faster as she watched him disappear back into his shop. Today, she decided, watching the last traces of him fade from view.\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[1.6.cA] (Extreme Close-up)\nToday everything would change.\n(/scene_frame_chunk_end/)\n\n\n--- SCENE 2 ---\n\n\n(/scene_frame_chunk_start/)\n\n[2.2.cA] (Frame)\n[CAM: Medium shot, eye level, static, 50mm]\n[POS: CHAR_MADAME_CHOU screen right, seated behind table]\n[LIGHT: Soft natural key from east window, diffused by morning fog and incense smoke, gentle fill from silk-draped ambient light]\n[PROMPT: Medium shot of [CHAR_MADAME_CHOU] seated behind a low lacquered table in her private receiving chamber within [LOC_LU_XIAN_BROTHEL]. Morning fog diffuses soft eastern light through silk-draped windows, creating a gentle, hazy atmosphere. [CHAR_MADAME_CHOU] (screen-right, facing left) sits with practiced authority, her weathered fingers sorting through multiple scrolls spread across the dark wood surface. She wears traditional robes befitting her station as the brothel's proprietress. Her expression carries decades of experience in delicate negotiations. Incense smoke curls from bronze holders positioned around the chamber, adding to the foggy morning ambiance. Rich silk tapestries line the walls, muffling outside sounds. The key light from the east window illuminates her profile, highlighting the mixture of business acumen and maternal concern in her features as she announces the morning's offers. AXIS OF ACTION established with [CHAR_MADAME_CHOU] on screen-right.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[2.4.cA] (Frame)\n[CAM: Close-up, eye-level angle, static hold, 85mm lens]\n[POS: CHAR_MADAME_CHOU screen right center, maintaining established eyeline]\n[LIGHT: Soft eastern key light through fog, gentle fill from ambient morning glow, atmospheric incense haze]\n[PROMPT: Close-up of [CHAR_MADAME_CHOU] maintaining her screen-right position from the previous frame. The soft morning light continues to filter through the foggy atmosphere of [LOC_LU_XIAN_BROTHEL], casting gentle shadows across her weathered features. Her expression reveals a complex mixture of maternal affection and business pragmatism as she speaks about Min Zhu's demanding terms. The camera captures the subtle shift in her demeanor when she mentions wanting what ensures Mei's comfort - her eyes soften momentarily, revealing the deeper emotional connection beneath her professional exterior. The same eastern key light illuminates her face, emphasizing the lines of experience around her eyes. Incense smoke continues to drift in the background, maintaining the intimate, enclosed atmosphere of the private chamber. Her lips curve into an ambiguous expression that could be interpreted as either protective concern or calculating assessment. The 180-degree rule is maintained with the camera staying on the same side of the axis established in the previous frame.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[2.6.cA] (Frame)\n[CAM: Medium two-shot, eye-level angle, static, 50mm]\n[POS: CHAR_MEI screen left foreground kneeling, CHAR_MADAME_CHOU screen right background standing]\n[LIGHT: Soft diffused morning light from east window, atmospheric haze, incense smoke creating depth]\n[PROMPT: Two-shot revealing both characters in the receiving chamber of [LOC_LU_XIAN_BROTHEL]. [CHAR_MEI] (screen-left, facing right) kneels before the low lacquered table in traditional posture, her hands folded in her lap with white knuckles betraying her inner tension. [CHAR_MADAME_CHOU] (screen-right, facing left) maintains her authoritative position behind the scattered scrolls. The morning fog continues to diffuse the eastern light, creating a soft, hazy atmosphere throughout the silk-draped chamber. The spatial relationship established in previous frames is maintained - both characters positioned on opposite sides of the axis of action. Incense smoke drifts between them, symbolically representing the tension in their conversation. [CHAR_MEI]'s carefully composed expression contrasts with the rebellion stirring beneath her calm exterior as she quietly questions the arrangement. [CHAR_MADAME_CHOU]'s eyes sharpen in response, her maternal facade giving way to cold business reality. The foggy morning light emphasizes the power dynamic between the two women in this pivotal negotiation scene.]\n\n(/scene_frame_chunk_end/)\n\n\n## Scene 2:\nMadame Chou's private receiving chamber\n\nThe receiving chamber's silk tapestries muffled the morning bustle from the street below as [CHAR_MEI] knelt before the low lacquered table where [CHAR_MADAME_CHOU] conducted her most delicate negotiations. Incense curled from bronze holders, its sandalwood scent unable to mask the tension that had settled between them like morning fog.\n\n(/scene_frame_chunk_start/)\n[2.2.cA] (Medium Shot)\n\"Two offers have arrived this morning,\" [CHAR_MADAME_CHOU] announced, her weathered fingers sorting through scrolls with practiced efficiency. Her voice carried the authority of decades spent transforming desperate girls into refined courtesans, yet Mei detected something softer beneath—perhaps pride, perhaps regret. \"General Zhoa has increased his proposal. Five hundred taels of silver, plus a monthly stipend.\"\n(/scene_frame_chunk_end/)\n\nMei's hands remained folded in her lap, though her knuckles had gone white. \"And the merchant?\"\n\n\"Ah, [CHAR_MIN_ZHU].\" Madame Chou's lips curved into something that might have been a smile. \"He offers six hundred, but his terms are... more demanding. (/scene_frame_chunk_start/)\n[2.4.cA] (Close-Up)\nHe wishes exclusivity, complete ownership of your contract.\" She paused, studying Mei's carefully composed expression. \"You have been like a daughter to me, child. I want what ensures your comfort.\"\n(/scene_frame_chunk_end/)\n\nThe word 'daughter' hung in the perfumed air like a blade. Daughters were not sold to the highest bidder, yet here they sat, discussing Mei's future as if she were rare porcelain to be appraised and acquired. Through the chamber's window, she could glimpse the corner where [CHAR_LIN]'s flower shop stood, its simple wooden sign a stark contrast to the gilded luxury surrounding her.\n\n(/scene_frame_chunk_start/)\n[2.6.cA] (Two-Shot)\n\"What if neither man suits me?\" Mei asked quietly, her voice steady despite the rebellion stirring in her chest.\n\nMadame Chou's eyes sharpened. \"Suitability is a luxury we cannot afford, my dear.\"\n(/scene_frame_chunk_end/)\n\n\n--- SCENE 3 ---\n\n\n(/scene_frame_chunk_start/)\n\n[3.1.cA] (Frame)\n[CAM: Wide shot, eye level, static, 24mm wide angle lens]\n[POS: CHAR_MEI screen left foreground, CHAR_MIN_ZHU screen right background seated]\n[LIGHT: Soft morning key from east, natural fill, long shadow play across courtyard stones]\n[PROMPT: Wide establishing shot of the main courtyard within [LOC_LU_XIAN_BROTHEL] from the north entrance perspective. Bright soft morning light streams from the east, casting long shadows across polished stone floors. [CHAR_MEI] (screen-left, facing right) glides gracefully across the courtyard space, her silk slippers silent on the stones, completing an elegant dance movement. [CHAR_MIN_ZHU] (screen-right, facing left) sits cross-legged on [PROP_BAMBOO_MATS] beside the [PROP_MAHOGANY_TABLE], his wealthy merchant's robes rich in texture. The [PROP_WOODEN_GO_BOARD] sits waiting on the low table between their positions. His calculating gaze follows her every movement with merchant-like appraisal. The courtyard's ornate red pillars frame the scene, with carved wooden galleries visible in the background. Paper lanterns hang motionless in the still morning air. AXIS OF ACTION established between the two characters across the courtyard space.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[3.2.cA] (Frame)\n[CAM: Medium two-shot, eye level, static hold, 50mm]\n[POS: CHAR_MEI screen left foreground, CHAR_MIN_ZHU screen right background seated]\n[LIGHT: Soft natural key from east, gentle fill on faces, warm morning atmosphere]\n[PROMPT: Medium shot maintaining the bright soft morning light from the east established in the previous frame. [CHAR_MEI] (screen-left, facing right) stands poised after completing her dance, her fan snapping closed with practiced precision. [CHAR_MIN_ZHU] (screen-right, facing left) remains seated on his cushions, his merchant's robes unchanged, now gesturing toward the [PROP_WOODEN_GO_BOARD] on the [PROP_MAHOGANY_TABLE]. His eyes hold the same appraising intensity as before. The morning light continues to cast soft shadows across the polished stones of [LOC_LU_XIAN_BROTHEL]. His lips move as he speaks the word \"Exquisite,\" his gesture drawing attention to the waiting game board. The 180-degree rule maintained - camera stays on the same side of the axis established between the characters. The ornate courtyard setting remains consistent with carved pillars framing the background.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[3.3.cA] (Frame)\n[CAM: Close-up, eye level, static, 85mm]\n[POS: CHAR_MEI screen left facing right]\n[LIGHT: Soft natural key from east, gentle fill, warm morning atmosphere]\n[PROMPT: Close-up reaction shot of [CHAR_MEI] (screen-left, facing right as established) in the [LOC_LU_XIAN_BROTHEL] courtyard. The same bright soft morning light from the east illuminates her face, casting gentle shadows that accentuate her graceful features. Her head inclines in a respectful bow, maintaining the elegant poise from the previous frame. Despite her outward composure, there's a subtle tension visible in her eyes - her pulse quickening as she processes his words about the Go game. The morning light catches the silk of her garments, unchanged from the previous shots. Her expression shows practiced courtesy masking inner calculation. The polished stone floor remains visible in the lower portion of the frame, maintaining visual continuity with the established courtyard setting. Building emotional intensity after the medium shot while preserving the spatial relationship and lighting established in the opening frames.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[3.4.cA] (Frame)\n[CAM: Medium close-up, eye level, static, 85mm]\n[POS: CHAR_MIN_ZHU screen right facing screen left]\n[LIGHT: Soft morning key from east, gentle fill, warm golden hour atmosphere]\n[PROMPT: Medium close-up of [CHAR_MIN_ZHU] (screen-right, facing left as established) in the [LOC_LU_XIAN_BROTHEL] courtyard. The bright soft morning light from the east continues to illuminate the scene, casting the same gentle shadows across his merchant's robes. His laugh reveals no warmth as his fingers drum rhythmically against his knee. His gaze shifts between the empty [PROP_WOODEN_GO_BOARD] and back toward [CHAR_MEI]'s position off-screen. The calculating intensity in his eyes has sharpened, revealing his true nature as someone who lives for high-stakes games. His breathing has shifted subtly, showing excitement when discussing risk and sacrifice. The morning light catches the rich texture of his robes, emphasizing his wealth. The polished stones of the courtyard floor remain visible, maintaining the established setting. His expression reveals a man who finds his truest pleasure in moments when fortune balances precariously, the thrill of the wager more intoxicating than material wealth.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[3.5.cA] (Frame)\n[CAM: Close-up, eye-level, static hold, 85mm]\n[POS: CHAR_MEI screen-left facing right, CHAR_MIN_ZHU off-screen right]\n[LIGHT: Soft morning key from east, gentle fill maintaining established shadows, warm natural atmosphere]\n[PROMPT: Close-up reaction shot of [CHAR_MEI] (screen-left, facing right as established) in the [LOC_LU_XIAN_BROTHEL] courtyard. The same bright soft morning light from the east continues to illuminate her face with gentle, consistent shadows. Her expression shows keen observation as she studies [CHAR_MIN_ZHU] off-screen, her eyes tracking his movements and mannerisms. There's a subtle shift in her demeanor - not attraction, but the sharp recognition of someone identifying a crucial weakness. Her breathing remains controlled, but her eyes show the calculating mind of a strategist at work. The morning light catches the silk of her unchanged garments, maintaining visual continuity. Her gaze focuses intently on his position off-screen, particularly noting how his breathing shifts when he discusses stakes and risk. A slight narrowing of her eyes suggests she's cataloging his tells, recognizing his addiction to games of chance. The polished stone floor of the courtyard remains visible, preserving the established setting and spatial relationships.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[3.6.cA] (Frame)\n[CAM: Extreme close-up, eye-level angle, static, 135mm macro lens]\n[POS: CHAR_MEI center frame, eyes and upper face filling frame]\n[LIGHT: Soft natural key from east, gentle fill light, subtle eye catchlights]\n[PROMPT: Extreme close-up of [CHAR_MEI]'s eyes and upper face in the [LOC_LU_XIAN_BROTHEL] courtyard. The bright soft morning light from the east creates subtle highlights in her eyes, maintaining the established lighting. A spark of realization flickers across her gaze as understanding dawns. Her eyes show the moment of strategic breakthrough - the instant when she recognizes that [CHAR_MIN_ZHU]'s gambling addiction could become her advantage. There's a subtle but unmistakable shift in her expression, from cautious observation to quiet confidence. The morning light catches the delicate features of her face, emphasizing the intelligence behind her eyes. Her breathing remains steady, but there's an almost imperceptible change in the set of her mouth - not quite a smile, but the shadow of one. This intimate framing captures the internal transformation as she shifts from defensive positioning to offensive strategy. The soft focus background maintains the courtyard setting while drawing complete attention to this crucial moment of recognition and tactical planning.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[3.7.cA] (Frame)\n[CAM: Medium two-shot, eye level, static, 50mm]\n[POS: CHAR_MEI screen left foreground, CHAR_MIN_ZHU screen right foreground, PROP_WOODEN_GO_BOARD center between characters]\n[LIGHT: Soft morning key from east, gentle fill maintaining even exposure on both faces, warm golden hour quality]\n[PROMPT: Two shot returning to the established spatial relationship in the [LOC_LU_XIAN_BROTHEL] courtyard. The bright soft morning light from the east continues to illuminate both characters consistently. [CHAR_MEI] (screen-left, facing right) and [CHAR_MIN_ZHU] (screen-right, facing left) maintain their positions across the [PROP_WOODEN_GO_BOARD] on the [PROP_MAHOGANY_TABLE]. Their eyes meet across the board as she speaks, the axis of action preserved from the opening frame. [CHAR_MEI] now carries herself with subtle but newfound confidence, her strategic realization from the previous frame informing her posture. [CHAR_MIN_ZHU] leans slightly forward, intrigued by her response. The morning light catches both their faces, emphasizing the moment of mutual assessment. The polished stones of the courtyard floor and the ornate pillars frame the scene, maintaining visual continuity. The empty Go board between them serves as both literal game surface and metaphorical battlefield where their psychological contest will unfold.]\n\n(/scene_frame_chunk_end/)\n\n\n## Scene 3:\nThe main courtyard where courtesans practice their arts\n\n(/scene_frame_chunk_start/)\n[3.1.cA] (Wide Shot)\nThe courtyard's polished stones reflected the late morning sun as [CHAR_MEI] glided across the space, her silk slippers silent against the ground. She had been summoned to perform for [CHAR_MIN_ZHU], who sat cross-legged on embroidered cushions, his merchant's robes speaking of wealth accumulated through shrewd calculation. His eyes followed her movements with the same intensity she had seen him apply to bolts of silk in the marketplace—appraising quality, estimating worth.\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[3.2.cA] (Medium Shot)\n\"Exquisite,\" he murmured as she completed a traditional dance, her fan snapping closed with practiced precision. \"Your reputation precedes you, but seeing such artistry firsthand...\" He gestured toward the low table beside him, where a Go board sat waiting. \"Do you play?\"\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[3.3.cA] (Close-Up)\nMei inclined her head gracefully, though her pulse quickened. \"I have been instructed in the game, honored sir.\"\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[3.4.cA] (Medium Close-Up)\n\"Instructed.\" Min Zhu's laugh held no warmth. \"I prefer opponents who understand that Go, like business, rewards those willing to sacrifice for greater gain.\" His fingers drummed against his knee as he studied the empty board. \"Everything has a price, beautiful one. The question is whether one possesses the courage to pay it.\"\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[3.5.cA] (Close-Up)\nAs he spoke, Mei noticed how his gaze lingered on the game pieces, the way his breathing shifted when discussing stakes and risk. Here was a man who lived for the thrill of the wager, who found his truest pleasure not in silk or gold but in the moment when fortune balanced on a knife's edge.\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[3.6.cA] (Extreme Close-Up)\nSomething stirred within her—not attraction, but recognition. If Min Zhu was ruled by his appetite for games of chance, perhaps that weakness could become her strength.\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[3.7.cA] (Two Shot)\n\"I find courage often reveals itself in unexpected moments,\" she replied softly, her eyes meeting his across the board.\n(/scene_frame_chunk_end/)\n\n\n--- SCENE 4 ---\n\n\n(/scene_frame_chunk_start/)\n\n[4.2.cA] (Frame)\n[CAM: Close-up, slight high angle, static, 85mm]\n[POS: CHAR_MEI center foreground at writing desk, facing screen right toward window]\n[LIGHT: Natural key from latticed window screen right, harsh overhead fill, high contrast chiaroscuro with geometric shadow patterns]\n[PROMPT: Close-up of [CHAR_MEI] positioned at her writing desk in [LOC_LU_XIAN_BROTHEL_DIR_E], facing the latticed window (screen-right). Afternoon light streams harshly through the geometric patterns, casting sharp shadows across her face. Rain creates wet reflections on the window surface. Her brush hovers over rice paper, but her attention is drawn outside. The harsh overhead lighting creates high contrast on her features, emphasizing the longing in her expression as she watches something beyond the frame. Her silk robes catch the filtered light, creating a play of light and shadow. The rain atmosphere adds a melancholic quality to the scene, with water droplets visible on the window glass distorting the view outside.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[4.4.cA] (Frame)\n[CAM: Medium shot, high angle looking down, static, 50mm]\n[POS: CHAR_LIN center frame ground level, CHAR_MEI implied camera position elevated]\n[LIGHT: Harsh overhead sunlight, minimal fill, rain creating wet reflections and light scatter]\n[PROMPT: Medium shot from [CHAR_MEI]'s window perspective in [LOC_LU_XIAN_BROTHEL_DIR_E], showing [CHAR_LIN] (center frame) in his flower garden below. The harsh afternoon lighting creates minimal shadows directly beneath him as he rises from tending to flowers, brushing soil from his knees. Rain continues to fall, creating wet reflections on the ground and plant leaves. [CHAR_LIN] moves with deliberate care, disappearing briefly into his shop before emerging with a small ceramic pot. He kneels again among the flower beds, his movements choreographed by compassion. The overhead sun position creates stark lighting conditions, emphasizing the contrast between his gentle actions and the harsh environment. Rain droplets catch the light as they fall around him.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[4.5.cA] (Frame)\n[CAM: Close-up, slight high angle, static, 85mm]\n[POS: CHAR_MEI center foreground at writing desk]\n[LIGHT: Harsh natural key from screen-right window, dramatic chiaroscuro with strong shadows, atmospheric rain reflections]\n[PROMPT: Close-up of [CHAR_MEI] back at her writing desk in [LOC_LU_XIAN_BROTHEL_DIR_E], her trembling brush now touching the rice paper. The harsh afternoon light from the window (screen-right) illuminates her profile, creating strong contrast between light and shadow. Rain continues to streak down the latticed window behind her, the wet reflections adding atmosphere to the scene. Her expression shows deep emotion as Chinese characters flow across the paper like tears. The overhead lighting creates dramatic shadows under her features, emphasizing the gravity of her decision. Her silk robes remain consistent with the previous frames, catching the filtered light. The writing implements and paper are clearly visible, showing her moment of decisive action.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[4.6.cA] (Frame)\n[CAM: Extreme close-up, eye-level angle, static, 135mm macro lens]\n[POS: CHAR_MEI center frame filling entire composition]\n[LIGHT: Harsh natural key from overhead sun through latticed window, minimal fill, rain reflections for atmospheric depth]\n[PROMPT: Extreme close-up of [CHAR_MEI]'s face in [LOC_LU_XIAN_BROTHEL_DIR_E], the harsh afternoon light creating dramatic contrast across her features. Rain continues outside, visible as soft blur in the background through the latticed window. The overhead sun position creates minimal shadows, but the intensity of light emphasizes every emotion crossing her face. Her eyes reflect both determination and vulnerability as she contemplates her desperate gamble. The wet reflections from the rain add a layer of atmospheric depth, while the harsh light quality makes this moment feel pivotal and raw. Her expression captures the weight of choosing to risk everything not just for freedom, but for the chance to be cherished without price.]\n\n(/scene_frame_chunk_end/)\n\n\n## Scene 4:\nMei's private chambers, overlooking the flower shop\n\nThe afternoon light slanted through the latticed windows of [CHAR_MEI]'s chambers as she positioned herself at her writing desk, brush poised over rice paper. Yet her eyes drifted inevitably to the window, where [CHAR_LIN] knelt among his flower beds like a devotee at prayer. His movements held a reverence she had never witnessed in the [LOC_LU_XIAN_BROTHEL_DIR_E], where every gesture served calculation or performance.\n\n(/scene_frame_chunk_start/)\n[4.2.cA] (Close-up)\nShe watched him cradle a wilting chrysanthemum, his calloused fingers gentle as he examined its browning petals. There was no audience for this tenderness, no profit to be gained from such careful attention to a single struggling bloom. Yet he tended it with the same devotion she imagined lovers showed in poems—patient, hopeful, asking nothing in return.\n(/scene_frame_chunk_end/)\n\n\"What would it feel like,\" she whispered to the empty room, \"to be touched with such care?\"\n\n(/scene_frame_chunk_start/)\n[4.4.cA] (Medium shot)\n[CHAR_LIN] rose, brushing soil from his knees, and disappeared into his shop. Moments later he emerged with a small ceramic pot, kneeling again to transplant the chrysanthemum with movements so deliberate they seemed choreographed by compassion itself. The contrast struck her like a physical blow—here was a man who chose gentleness when no one was watching, while she had been trained to perform tenderness for the highest bidder.\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[4.5.cA] (Close-up)\nHer brush trembled as she began to write, the characters flowing across paper like tears. If [CHAR_MIN_ZHU] truly lived for the thrill of the wager, perhaps she could risk everything on a single, desperate gamble.\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[4.6.cA] (Extreme close-up)\nNot for gold or freedom alone, but for the chance to know what it meant to be cherished like those flowers—simply, completely, without price.\n(/scene_frame_chunk_end/)\n\n\n--- SCENE 5 ---\n\n\n(/scene_frame_chunk_start/)\n\n[5.1.cA] (Frame)\n[CAM: Medium shot, eye level, static, 50mm]\n[POS: CHAR_MEI screen center foreground]\n[LIGHT: Hard natural key from latticed windows, high contrast shadows, minimal fill]\n[PROMPT: Medium shot of [CHAR_MEI] seated at a low wooden writing desk in her private chambers within [LOC_LU_XIAN_BROTHEL]. Late afternoon light streams harshly through latticed windows, creating high contrast shadows. [CHAR_MEI] (screen-center, facing slightly left) wears elegant silk robes, her posture formal yet tense. Before her lies pristine [PROP_RICE_PAPER], its white surface gleaming under the overhead key light. Her delicate hand hovers over the [PROP_INKSTONE], holding a [PROP_BRUSH] that trembles slightly. The harsh late afternoon lighting casts minimal shadows directly beneath objects. Through the window behind her, the sounds of courtesans practicing drift up from the courtyard below. Her writing alcove is intimate yet exposed, with carved wooden details catching the severe light. The rice paper appears almost luminous against the dark wood of her desk.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[5.2.cA] (Frame)\n[CAM: Close-up, eye-level, static hold with subtle push-in during footsteps, 85mm]\n[POS: CHAR_MEI screen center, PROP_BRUSH foreground right, PROP_RICE_PAPER foreground center]\n[LIGHT: Harsh overhead key light, minimal fill creating high contrast, dramatic shadows emphasizing facial tension]\n[PROMPT: Close-up of [CHAR_MEI] maintaining her screen-center position from the previous frame. The harsh late afternoon lighting continues to create high contrast on her face as she pauses in her writing. Her [PROP_BRUSH] hovers frozen above the [PROP_RICE_PAPER], which now shows elegant characters flowing across its surface. Her eyes dart toward the door of her chamber within [LOC_LU_XIAN_BROTHEL] as footsteps echo in the corridor beyond. Fear flickers across her features - the familiar rhythm of Madame Chou's evening rounds. The severe overhead lighting emphasizes the tension in her jaw and the slight tremor in her hand. Her breathing becomes shallow, visible in the rise and fall of her silk robes. The footsteps continue past her door without stopping. Relief washes over her face as her hand steadies, resolve crystallizing in her expression. The same harsh light that moments ago revealed her fear now illuminates her determination.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[5.3.cA] (Frame)\n[CAM: Extreme close-up, overhead angle, static, 100mm macro]\n[POS: CHAR_MEI hands center frame, PROP_LETTER cradled in palms]\n[LIGHT: Harsh overhead key light, minimal fill, severe directional shadows beneath hands]\n[PROMPT: Extreme close-up of [CHAR_MEI]'s hands as they hold the completed [PROP_LETTER]. The harsh late afternoon lighting creates dramatic shadows beneath her delicate fingers. The [PROP_LETTER] appears fragile and precious in her grasp, the rice paper almost translucent under the severe overhead light. Her hands cradle it with the tenderness one might hold a butterfly - delicate, beautiful, and capable of flight. The elegant calligraphy is visible through the thin paper, each character precise yet carrying emotional weight. [CHAR_MEI]'s fingertips show slight tremors from the magnitude of what she has written. The harsh lighting emphasizes the texture of the paper and the careful way she protects this vessel of her hopes and desperation. Minimal shadows fall directly beneath her hands, maintaining the scene's established lighting consistency. The letter represents everything - her gamble, her freedom, her future.]\n\n(/scene_frame_chunk_end/)\n\n\n## Scene 5:\nMei's private chambers, writing alcove near the window\n\n(/scene_frame_chunk_start/)\n[5.1.cA] (Medium Shot)\n\nThe rice paper lay before [CHAR_MEI] like uncharted territory, its pristine surface reflecting the late afternoon light that streamed through her chamber windows. Her brush hovered above the inkstone, trembling with the weight of words she had never been permitted to speak. Below in the courtyard, she could hear the other courtesans practicing their evening performances, their voices weaving together in practiced harmony while she prepared to shatter every rule that had governed her existence.\n\n(/scene_frame_chunk_end/)\n\n\"Honored [CHAR_LIN],\" she began, her characters flowing with the same precision [CHAR_MADAME_CHOU] had drilled into her since childhood. Each stroke carried the elegance expected of Lu Xian's most prized courtesan, yet beneath the formal beauty lay something raw and desperate. \"Though we have never spoken, I have watched you tend your flowers with a devotion that speaks of a gentle heart.\"\n\n(/scene_frame_chunk_start/)\n[5.2.cA] (Close-up)\n\nShe paused, her breath catching as footsteps echoed in the corridor beyond her door. The familiar rhythm of Madame Chou's evening rounds sent ice through her veins, but the footsteps continued past without stopping. Mei's hand steadied as she continued writing, her resolve crystallizing with each character.\n\n(/scene_frame_chunk_end/)\n\n\"Tonight I gamble everything on a game of Go with the merchant [CHAR_MIN_ZHU]. If fortune favors me, I will purchase my freedom and come to you not as property seeking a master, but as a woman hoping to learn what it means to be cherished as you cherish your chrysanthemums.\" Her brush paused again, this time not from fear but from the magnitude of what she was confessing. \"Please read this only at evening's end, when the outcome is decided.\"\n\n(/scene_frame_chunk_start/)\n[5.3.cA] (Extreme Close-up)\n\nThe letter felt like a butterfly in her hands—fragile, beautiful, and capable of flight.\n\n(/scene_frame_chunk_end/)\n\n\n--- SCENE 6 ---\n\n\n(/scene_frame_chunk_start/)\n\n[6.4.cA] (Frame)\n[CAM: Medium shot, high angle looking down stairs, static, 50mm]\n[POS: CHAR_MEI screen left foreground on stairs, Ping screen right background at table]\n[LIGHT: Warm practical key from hanging lanterns, cool blue fill from windows, intimate chiaroscuro]\n[PROMPT: Medium shot establishing the servants' quarters within [LOC_LU_XIAN_BROTHEL_DIR_S] from the north perspective. Evening lighting with dim, warm practical light from hanging lanterns creates intimate shadows on rough-hewn walls. [CHAR_MEI] (screen-left, facing right) descends narrow wooden stairs in elegant robes, her figure contrasting against the utilitarian space. A young servant girl named Ping (screen-right, facing left) looks up from chopping vegetables at a worn wooden table, her knife paused mid-stroke. The honest smell of cooking rice and steamed vegetables fills the air. Cool blue evening light filters through small windows, mixing with warm amber lantern glow. AXIS OF ACTION established between [CHAR_MEI] and Ping across the working kitchen space.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[6.7.cA] (Frame)\n[CAM: Close-up, eye-level, static hold, 85mm portrait lens]\n[POS: CHAR_MEI screen left center foreground]\n[LIGHT: Warm amber key from lanterns camera right, soft fill from ambient evening light, cool blue rim light from exterior]\n[PROMPT: Close-up of [CHAR_MEI] (screen-left as established) in [LOC_LU_XIAN_BROTHEL_DIR_S], maintaining the dim evening lighting from the previous frame. Her elegant fingers tremble slightly as she watches Ping tuck the letter into her sleeve and hurry toward the back entrance. Warm lantern light illuminates [CHAR_MEI]'s face, revealing a mixture of hope and trepidation. The first tremor of irrevocable change crosses her features as shadows dance across her porcelain skin. Same cool blue evening ambiance with amber practical lighting creates emotional depth.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[6.8.cA] (Frame)\n[CAM: Medium close-up, eye level, static hold, 85mm portrait lens]\n[POS: CHAR_MEI screen left center, angled toward background stairs]\n[LIGHT: Warm practical lantern key from above, cool ambient fill from right, soft rim light on silhouette]\n[PROMPT: Medium close-up of [CHAR_MEI] (screen-left, maintaining spatial relationship) in [LOC_LU_XIAN_BROTHEL_DIR_S]. Evening lighting continues with same dim, warm lantern glow and cool blue ambient light. [CHAR_MEI] turns slightly toward the stairs leading back to the upper chambers, her expression shifting from vulnerable hope to steeled determination. The weight of what comes next—facing her patron across a Go board—settles across her features. Rough servant quarter walls frame her delicate silhouette, emphasizing the contrast between her refined beauty and the honest working space around her.]\n\n(/scene_frame_chunk_end/)\n\n\n## Scene 6:\nThe servants' quarters and kitchen area\n\nThe servants' quarters hummed with evening preparations as [CHAR_MEI] descended the narrow wooden stairs that led away from the opulent chambers above. The contrast struck her immediately—rough-hewn walls instead of silk tapestries, the honest smell of cooking rice and steamed vegetables replacing the cloying perfume that saturated the upper floors of the [LOC_LU_XIAN_BROTHEL_DIR_S]. Here, in this world of callused hands and practical concerns, she felt both more exposed and more authentic than she had in years.\n\nA young servant girl looked up from chopping vegetables, her eyes widening at Mei's unexpected appearance. Few courtesans ventured into these working spaces, and certainly not Lu Xian's most valuable jewel. The girl's knife paused mid-stroke as Mei approached, the folded letter trembling slightly in her elegant fingers.\n\n\"Little sister,\" Mei said softly, using the familiar address that immediately bridged the gulf between their stations. \"I need your help with something that must remain between us.\"\n\n(/scene_frame_chunk_start/)\n[6.4.cA] (Medium Shot)\nThe servant girl set down her knife, wiping her hands on her apron. Her name was Ping, Mei remembered—one of the kitchen girls who sometimes brought tea to the upper chambers. There had been moments over the years when their eyes had met, brief exchanges of understanding between two young women trapped in different levels of the same cage.\n(/scene_frame_chunk_end/)\n\n\"What do you need, Elder Sister?\" Ping asked, her voice barely above a whisper.\n\nMei extended the letter, its rice paper catching the lamplight like captured moonbeams. \"Take this to the florist on the corner—[CHAR_LIN]. But you must wait until full darkness falls before delivering it. Tell him it must not be read until evening's end, when the last customer has departed and the streets grow quiet.\"\n\nPing accepted the letter with reverent care, as if she understood its weight without knowing its contents. \"And if anyone asks where I've gone?\"\n\n\"Tell them you're fetching herbs for tomorrow's cooking.\" Mei's hand found Ping's shoulder, a gesture of gratitude that spoke volumes. \"This kindness will not be forgotten.\"\n\n(/scene_frame_chunk_start/)\n[6.7.cA] (Close-up)\nAs Ping tucked the letter into her sleeve and hurried toward the back entrance, Mei felt the first tremor of irrevocable change. The die was cast, her heart laid bare in ink and desperation.\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[6.8.cA] (Medium Close-up)\nNow came the harder part—facing [CHAR_MIN_ZHU] across a Go board with everything she had ever dreamed of hanging in the balance.\n(/scene_frame_chunk_end/)\n\n\n--- SCENE 7 ---\n\n\n(/scene_frame_chunk_start/)\n\n[7.1.cA] (Frame)\n[CAM: Wide shot, eye level, static, 35mm]\n[POS: CHAR_MEI screen left foreground, CHAR_MIN_ZHU screen right foreground, PROP_WOODEN_GO_BOARD center between characters]\n[LIGHT: Warm lamplight key from above, soft fill from silk screens, intimate golden atmosphere with layered shadows]\n[PROMPT: Wide establishing shot of [CHAR_MEI]'s private chambers from the north entrance. Soft, warm lamplight creates intimate shadows throughout the room. The [PROP_MAHOGANY_TABLE] gleams in the center, positioned diagonally to camera. [CHAR_MEI] (screen-left, facing right) kneels gracefully on [PROP_BAMBOO_MATS] beside the table, her silk robes pooling elegantly around her. [CHAR_MIN_ZHU] (screen-right, facing left) settles his considerable bulk onto cushions opposite her, his merchant's robes rustling. The [PROP_WOODEN_GO_BOARD] sits precisely between them like a battlefield, black and white stones arranged at the ready. Silk screens positioned strategically in the background create layered shadows. [PROP_TEA_CUP] and ceremonial tea service arranged with precision nearby. The atmosphere is serene yet charged with tension. AXIS OF ACTION established between the two players across the Go board.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[7.2.cA] (Frame)\n[CAM: Medium shot, eye level, static, 50mm]\n[POS: CHAR_MIN_ZHU screen right, PROP_MAHOGANY_TABLE center foreground, PROP_WOODEN_GO_BOARD center]\n[LIGHT: Warm practical lamplight key from screen left, soft fill from silk screens, atmospheric shadows in background]\n[PROMPT: Medium shot maintaining the warm lamplight established in the previous frame. [CHAR_MIN_ZHU] (screen-right, facing left as established) surveys the prepared space with obvious pleasure, his eyes moving appreciatively around the room. His merchant's robes catch the soft light as he shifts position on his cushions. The [PROP_MAHOGANY_TABLE] and [PROP_WOODEN_GO_BOARD] remain prominently in frame between him and the camera. His expression shows satisfaction and anticipation. The 180-degree rule maintained - camera stays on same side of the Go board axis. Shadows from silk screens create depth in the background. His considerable bulk dominates the frame, emphasizing his physical presence and power in this negotiation.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[7.3.cA] (Frame)\n[CAM: Close-up, eye-level angle, static, 85mm]\n[POS: CHAR_MEI screen left facing right]\n[LIGHT: Warm key light from lamplight, soft fill maintaining gentle shadows on facial features]\n[PROMPT: Close-up of [CHAR_MEI] (screen-left, facing right as established). Reaction shot showing her practiced composure under the same warm lamplight. Her silk robes catch the soft illumination, and her expression carries the honeyed modulation of years spent pleasing difficult men. Yet beneath the surface serenity, there's a hint of steel in her eyes - a subtle tension in her jaw, a slight tightening around her eyes that suggests the gravity of this moment. Her voice carries both practiced charm and underlying determination. The lighting remains consistent with previous frames, casting gentle shadows that emphasize the delicate features of her face while hinting at the strength beneath her courtesan's mask.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[7.4.cA] (Frame)\n[CAM: Medium shot, slight low angle, static, 50mm]\n[POS: CHAR_MIN_ZHU screen right foreground, PROP_WOODEN_GO_BOARD center between character and camera]\n[LIGHT: Warm lamplight key from screen left, soft fill maintaining chiaroscuro mood, golden practical lighting]\n[PROMPT: Medium shot returning to [CHAR_MIN_ZHU] (screen-right, facing left) as his laughter rumbles through the chamber. The same warm lamplight illuminates his satisfied expression as he leans forward slightly toward the [PROP_WOODEN_GO_BOARD]. His fingers caress the white stones with proprietary satisfaction, the gesture both sensual and threatening. His merchant's robes shift as he moves, and his considerable bulk seems to expand with confidence and anticipated victory. The Go board remains between him and camera, emphasizing the battlefield nature of their negotiation. His expression shows cruel pleasure as he delivers his insulting terms, eyes glinting with malicious satisfaction in the soft light. The 180-degree rule maintained throughout.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[7.5.cA] (Frame)\n[CAM: Extreme close-up, eye-level, static hold, 100mm macro]\n[POS: CHAR_MEI screen left facing right, isolated in frame]\n[LIGHT: Warm key from overhead lamp, soft fill from screen right, gentle rim lighting on hair]\n[PROMPT: Close-up reaction shot of [CHAR_MEI] (screen-left, facing right as established). The insult strikes like a physical blow, but her expression remains serene as mountain lakes under the consistent warm lamplight. Only the slightest flicker in her eyes betrays the impact of his cruel words. Her face maintains perfect composure - the mask of a courtesan trained to endure any humiliation with grace. Yet there's something deeper in her gaze now, a quiet desperation mixed with hope as she thinks of her letter to [CHAR_LIN]. The soft lighting emphasizes both her vulnerability and her incredible strength. Her lips remain curved in a practiced smile even as her eyes reveal the steel beneath her silk exterior.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[7.6.cA] (Frame)\n[CAM: Extreme close-up, overhead angle, static, 100mm macro]\n[POS: CHAR_MEI fingers center foreground, PROP_WOODEN_GO_BOARD fills frame background]\n[LIGHT: Warm key light from above left, soft fill to eliminate harsh shadows, intimate lamplight glow]\n[PROMPT: Extreme close-up of [CHAR_MEI]'s steady fingers as they place the first black stone on the [PROP_WOODEN_GO_BOARD]. The same warm lamplight catches the smooth surface of the stone and illuminates her delicate hand. Her fingers show no tremor despite the gravity of the moment - years of training in perfect control evident in every movement. The wood grain of the [PROP_WOODEN_GO_BOARD] is visible in sharp detail, emphasizing the precision and ritual of the game's beginning. This intimate shot captures the moment where words end and the true battle begins. The lighting remains soft and warm, but the extreme close-up creates intensity and focus on this pivotal action that will determine her fate.]\n\n(/scene_frame_chunk_end/)\n\n\n## Scene 7:\nMei's private chambers, the main room with mahogany table\n\n(/scene_frame_chunk_start/)\n[7.1.cA] (Wide Shot)\nThe mahogany table gleamed under the soft lamplight as [CHAR_MEI] knelt across from [CHAR_MIN_ZHU], the Go board between them like a battlefield mapped in black and white stones. Her chambers had been transformed for this moment—silk screens positioned to create intimate shadows, tea service arranged with ceremonial precision, every detail calculated to suggest leisure rather than the life-altering contest that was about to unfold.\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[7.2.cA] (Medium Shot)\n\"You surprise me,\" [CHAR_MIN_ZHU] said, settling his considerable bulk onto the cushions with obvious pleasure. His merchant's robes rustled as he surveyed the prepared space, his eyes lingering on the way lamplight played across Mei's silk-clad form. \"Most courtesans prefer simpler entertainments.\"\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[7.3.cA] (Close-Up)\n\"I find Go reveals character more clearly than wine or song,\" Mei replied, her voice carrying the practiced modulation of years spent pleasing difficult men. Yet beneath the honeyed tones lay steel—tonight, she would need every weapon in her considerable arsenal. \"Shall we discuss the terms?\"\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[7.4.cA] (Medium Shot)\nMin Zhu's laugh rumbled through the chamber like distant thunder. \"Eager to lose your savings, beautiful one? Very well—your proposal intrigues me. If you win, I match your payment and you purchase your freedom from [CHAR_MADAME_CHOU]. But when you lose...\" His fingers caressed the white stones with proprietary satisfaction. \"You accept my contract at half the agreed price. A bargain for damaged goods.\"\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[7.5.cA] (Close-Up)\nThe insult struck like a physical blow, but Mei's expression remained serene as mountain lakes. She had expected cruelty—men like Min Zhu wielded it as naturally as breathing. What mattered now was the game, and the desperate hope that her letter had found its way to [CHAR_LIN]'s gentle hands.\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[7.6.cA] (Extreme Close-Up)\n\"Then let us begin,\" she said, placing the first black stone with steady fingers.\n(/scene_frame_chunk_end/)\n\n\n--- SCENE 8 ---\n\n\n(/scene_frame_chunk_start/)\n\n[8.1.cA] (Frame)\n[CAM: Medium shot, eye level, static, 50mm]\n[POS: CHAR_MEI screen left foreground, CHAR_MIN_ZHU screen right foreground]\n[LIGHT: Warm lantern key light from above, soft fill from window reflections, atmospheric rain shadows]\n[PROMPT: Medium shot of [LOC_LU_XIAN_BROTHEL] private chamber interior from the north entrance. Rain patters against wooden shutters, creating wet reflections on the polished [PROP_MAHOGANY_TABLE]. Warm lantern light flickers across the scene, casting dancing shadows on carved wooden walls. [CHAR_MEI] (screen-left, facing right) kneels on [PROP_BAMBOO_MATS] in her elegant blue silk robes, studying the [PROP_WOODEN_GO_BOARD] with growing concern. [CHAR_MIN_ZHU] (screen-right, facing left) sits opposite her, his white stones dominating the center of the board while her black stones cluster desperately at the edges. The constellation of fallen stones tells a story of strategic defeat. Raindrops streak down window panes, adding atmosphere to the tense moment. AXIS OF ACTION established between the two players across the game board.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[8.2.cA] (Frame)\n[CAM: Close-up, slight high angle looking down, static hold, 85mm portrait lens]\n[POS: CHAR_MEI center foreground, leaning forward toward camera]\n[LIGHT: Warm lantern key light from above left, soft fill from rain reflections, intimate golden atmosphere with wet surface highlights]\n[PROMPT: Close-up of [CHAR_MEI] maintaining the warm lantern light and rain atmosphere from the previous frame. She leans forward gracefully, her [PROP_HAIR_RIBBON] slipping free with practiced accident. Dark hair cascades over her shoulder, releasing jasmine scent as she pours tea into the [PROP_TEA_CUP]. Her silk-clad form moves with calculated sensuality within [LOC_LU_XIAN_BROTHEL]'s intimate chamber. Rain continues to create wet reflections on surfaces around her. Her breath warms the air as she uses her body's proximity as a weapon in this game of seduction and strategy. The camera captures her desperate elegance as she employs the oldest tricks of the pleasure quarter, her trembling fingers betraying her inner turmoil despite her outward composure.]\n\n(/scene_frame_chunk_end/)\n\n\n## Scene 8:\nMei's private chambers, the main room with mahogany table\n\n(/scene_frame_chunk_start/)\n[8.1.cA] (Medium Shot)\nThe Go board had become a constellation of conflict, black and white stones scattered across its surface like fallen stars. [CHAR_MEI] studied the pattern with growing dread—[CHAR_MIN_ZHU]'s territorial advantage was undeniable, his stones forming an iron grip around the center while hers struggled for life along the edges.\n(/scene_frame_chunk_end/)\n\nThe merchant's breathing had grown heavier as the game progressed, not from exertion but from the intoxicating scent of victory.\n\n\"You play with passion, but passion without discipline leads to ruin,\" Min Zhu murmured, placing another white stone with deliberate precision. His eyes glittered in the lamplight as he watched her face for signs of surrender.\n\nMei's fingers trembled as she reached for the tea service, her training taking over where strategy had failed. Rising gracefully, she moved behind his cushion, the silk of her robes whispering promises as old as the pleasure quarter itself. \"Perhaps you would enjoy some refreshment while you consider your next move?\"\n\n(/scene_frame_chunk_start/)\n[8.2.cA] (Close-up)\nShe leaned forward to pour, letting her hair ribbon slip free with practiced accident. The dark cascade fell across her shoulder, releasing the jasmine scent that had been her signature since girlhood. Her breath warmed his ear as she filled his cup, her silk-clad breast brushing against his shoulder with calculated innocence.\n(/scene_frame_chunk_end/)\n\n\"Clever girl,\" Min Zhu's voice roughened with appreciation, though his hand remained steady on the stones. \"But I've played this game longer than you've drawn breath.\"\n\nAs Mei returned to her seat, she caught her reflection in the polished mahogany—a beautiful woman reduced to using her body as currency, just as [CHAR_MADAME_CHOU] had trained her. The image made her stomach turn, yet [CHAR_LIN]'s gentle face floated in her memory like a prayer.\n\n\n--- SCENE 9 ---\n\n\n(/scene_frame_chunk_start/)\n\n[9.2.cA] (Frame)\n[CAM: Medium shot, eye level, static, 50mm]\n[POS: CHAR_LIN center in doorway, servant girl screen left foreground, LOC_LU_XIAN_BROTHEL_DIR_W screen right background]\n[LIGHT: Chiaroscuro, warm key from PROP_LANTERN inside shop, cool moonlight fill, red lantern practicals in background]\n[PROMPT: Medium shot of [CHAR_LIN] standing in his flower shop doorway, viewed from the north. Evening lighting with cool blue ambient tones. The [PROP_LANTERN] in his shop casts warm golden light on his weathered face as he faces screen-right toward his door. A nervous servant girl (screen-left) approaches from the shadows, her eyes darting toward the glowing windows of [LOC_LU_XIAN_BROTHEL_DIR_W] visible in the background. She extends a folded letter toward [CHAR_LIN] with trembling hands. The contrast between the warm lamplight and cool moonlight creates dramatic chiaroscuro. Soil still clings to [CHAR_LIN]'s fingernails from his day's work. The brothel's red lanterns create distant warm spots of light against the predominantly cool evening palette.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[9.4.cA] (Frame)\n[CAM: Extreme close-up, overhead angle tilting down, static, 100mm macro]\n[POS: CHAR_LIN hands center foreground, PROP_LANTERN screen left background]\n[LIGHT: Warm key from lantern screen left, soft fill on paper, golden rim light on fingertips]\n[PROMPT: Close-up of [CHAR_LIN]'s weathered hands unfolding rice paper with reverent care, maintaining the evening lighting established in the previous frame. The [PROP_LANTERN]'s warm golden glow illuminates the elegant brushwork on the letter, each character seeming to shimmer in the flickering light. [CHAR_LIN] (still screen-right as established) holds the delicate paper like he would handle fragile seedlings. His eyes widen with wonder as he recognizes the refined calligraphy. The warm lamplight contrasts with the cool blue ambient evening light, creating intimate atmosphere. Soil beneath his fingernails emphasizes his humble station against the letter's obvious refinement. The paper trembles slightly in his gentle grasp.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[9.7.cA] (Frame)\n[CAM: Wide establishing shot, eye level, static, 35mm wide angle lens]\n[POS: CHAR_LIN screen right foreground in shop window, LOC_LU_XIAN_BROTHEL screen left dominating frame]\n[LIGHT: Practical lighting from lanterns, warm golden spill from brothel windows, cool blue moonlight on road, chiaroscuro contrast between intimate shop glow and grand brothel illumination]\n[PROMPT: Wide establishing shot maintaining evening lighting from north perspective. [CHAR_LIN] (screen-right) stands silhouetted in his modest shop window, the [PROP_LANTERN] creating a warm pool of light around him. The magnificent [LOC_LU_XIAN_BROTHEL] dominates the left side of frame, blazing with countless red paper lanterns and warm golden light spilling from multiple windows across its three-story structure. The contrast is stark - his simple flower shop versus the opulent pleasure house. Cool blue moonlight bathes the pressed dirt road between them. The brothel's curved rooflines and ornate pillars are dramatically lit against the night sky. [CHAR_LIN] appears small and humble against the brothel's imposing grandeur, yet the letter in his hands connects these two worlds.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[9.8.cA] (Frame)\n[CAM: Medium close-up, slight low angle, static, 85mm]\n[POS: CHAR_LIN center screen-right]\n[LIGHT: Key from screen left lantern, warm golden fill on face, cool blue ambient background]\n[PROMPT: Medium close-up of [CHAR_LIN] (screen-right as established) pressing the letter against his chest with both hands, his heart visibly pounding beneath his simple work clothes. The [PROP_LANTERN]'s warm golden light illuminates his face from the left, showing wonder and unfamiliar urgency in his expression. Evening lighting remains consistent with cool blue ambient tones. His weathered features are softened by the lamplight, revealing vulnerability beneath his humble exterior. The letter crinkles slightly against his chest as his breathing quickens. Soil-stained fingertips contrast with the delicate rice paper. His eyes reflect the flickering flame, showing a man transformed by unexpected hope and connection to someone beyond his simple world.]\n\n(/scene_frame_chunk_end/)\n\n\n## Scene 9:\nLin's flower shop, viewed through Mei's chamber window\n\nThe small flame of [CHAR_LIN]'s oil lamp flickered against the darkness as he closed his shop for the evening, his weathered hands moving with the same careful attention he showed his flowers. The day's work had left soil beneath his fingernails and the sweet ache of honest labor in his shoulders—sensations as familiar and comforting as the scent of jasmine that drifted from his night-blooming cereus.\n\n(/scene_frame_chunk_start/)\n[9.2.cA] (Medium Shot)\nA soft knock at his door interrupted the peaceful ritual of closing. The servant girl who stood in his doorway seemed nervous, her eyes darting toward the [LOC_LU_XIAN_BROTHEL_DIR_W]'s glowing windows before pressing a folded letter into his hands.\n(/scene_frame_chunk_end/)\n\n\"From someone who watches your flowers grow,\" she whispered before disappearing into the shadows.\n\n(/scene_frame_chunk_start/)\n[9.4.cA] (Close-up Shot)\n[CHAR_LIN] unfolded the rice paper with the same reverence he showed fragile seedlings, his eyes widening as he recognized the elegant brushwork. The characters seemed to shimmer in the lamplight, each stroke speaking of refinement beyond his simple world.\n(/scene_frame_chunk_end/)\n\nAs he read [CHAR_MEI]'s words, his breath caught—someone had been watching him, seeing beauty in his quiet devotion to growing things.\n\n\"She compares herself to my chrysanthemums,\" he murmured to the empty shop, his voice thick with wonder. The letter trembled in his hands as the full meaning struck him—this woman, trapped in her gilded cage, had risked everything on a gamble for freedom, and somehow his simple care for flowers had given her hope.\n\n(/scene_frame_chunk_start/)\n[9.7.cA] (Wide Shot)\nThrough his window, the [LOC_LU_XIAN_BROTHEL] blazed with light, and somewhere within those walls, his unknown correspondent was fighting for her life.\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[9.8.cA] (Medium Close-up Shot)\n[CHAR_LIN] pressed the letter to his chest, his heart pounding with unfamiliar urgency.\n(/scene_frame_chunk_end/)\n\n\n--- SCENE 10 ---\n\n\n(/scene_frame_chunk_start/)\n\n[10.1.cA] (Frame)\n[CAM: Extreme close-up, overhead angle looking down, static, 100mm macro]\n[POS: CHAR_MEI fingers screen left edge foreground, PROP_WOODEN_GO_BOARD center, PROP_SILK_POUCH screen right]\n[LIGHT: Soft ambient from rain-diffused windows, key light reflecting off polished wood surface, humid atmospheric haze]\n[PROMPT: Extreme close-up of the [PROP_WOODEN_GO_BOARD] on the [PROP_MAHOGANY_TABLE]. Rain-wet atmosphere creates a humid, oppressive mood with soft reflective lighting on the polished wood surface. The final white Go stone clicks into place with finality. [CHAR_MEI]'s delicate fingers (screen-left edge of frame) release the black stone she just played. The board shows a constellation of defeat - white stones systematically strangling scattered black territories. A silk pouch containing her life savings sits beside the board, suddenly worthless. Rain patters against windows off-screen, creating wet reflective ambiance throughout the chamber.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[10.2.cA] (Frame)\n[CAM: Medium shot, eye level, static, 50mm]\n[POS: CHAR_MEI screen left foreground, CHAR_MIN_ZHU screen right background against cushions]\n[LIGHT: Rain-diffused natural light, key from window, wet reflective highlights on mahogany table surface]\n[PROMPT: Medium shot maintaining the rain-wet atmospheric lighting from the previous frame. [CHAR_MIN_ZHU] (screen-right, facing left) leans back against silk cushions on [PROP_BAMBOO_MATS], his voice thick with satisfaction. [CHAR_MEI] (screen-left, facing right) sits composed across the [PROP_MAHOGANY_TABLE], her training holding her posture intact despite inner devastation. His fingers drum against the polished mahogany surface like a predatory cat. Rain continues creating wet reflective lighting that gleams off the table's surface. The 180-degree rule established - camera remains on north side of their axis of action.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[10.3.cA] (Frame)\n[CAM: Wide shot, eye level, static, 35mm]\n[POS: CHAR_MEI center frame]\n[LIGHT: Rain-wet reflective lighting, key from west window, melancholy atmosphere with surface reflections]\n[PROMPT: Wide shot of [CHAR_MEI] in her private chambers within [LOC_LU_XIAN_BROTHEL], camera now facing west toward the window. Rain-wet reflective lighting continues the established atmospheric mood. [CHAR_MEI] (center frame) maintains her folded hands and composed posture despite her crumbling world. Through the rain-streaked chamber window, glimpses of darkened buildings across the street are visible in the wet night. The opulent chamber surrounds her with rich fabrics and carved wooden details, but the rain creates melancholy reflections on every surface. Her silk robes remain unchanged from previous frames, maintaining visual continuity.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[10.4.cA] (Frame)\n[CAM: Medium shot, eye level, static, 50mm]\n[POS: CHAR_MEI screen left facing right, PROP_MAHOGANY_TABLE center]\n[LIGHT: Soft natural key from north windows, wet reflective highlights on table surface, atmospheric rain diffusion]\n[PROMPT: Medium shot returning to north direction, maintaining the rain-wet atmospheric lighting established throughout the scene. [CHAR_MEI] (screen-left, facing right) speaks with quiet dignity, her voice steady despite internal devastation. The [PROP_MAHOGANY_TABLE] gleams with wet reflective lighting between the characters. Her silk robes and composed posture remain consistent with previous frames. Rain continues pattering against windows, creating the oppressive humid atmosphere that permeates the chamber. The camera maintains the 180-degree rule established in frame 10.2.cA, staying on the same side of the character axis.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[10.5.cA] (Frame)\n[CAM: Close-up, slight low angle, static, 85mm]\n[POS: CHAR_MIN_ZHU screen right facing left]\n[LIGHT: Rain-wet reflective key lighting, atmospheric fill from humid chamber, predatory eye gleam highlights]\n[PROMPT: Close-up reaction shot of [CHAR_MIN_ZHU] (screen-right, facing left as established). His cruel laugh rumbles through the rain-soaked chamber atmosphere. Rain-wet reflective lighting gleams in his predatory eyes as they glitter with malicious amusement. The humid, oppressive atmosphere continues from previous frames, with rain creating soft wet reflections on his features. His expression reveals the calculating merchant who considers Mei \"exquisite\" property to be owned. The 180-degree rule maintained - he remains screen-right as established in the character positioning from frame 10.2.cA.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[10.6.cA] (Frame)\n[CAM: Extreme close-up, eye level, static hold, 135mm telephoto]\n[POS: CHAR_MEI screen left facing right, isolated in frame]\n[LIGHT: Soft atmospheric key from above, rain-diffused fill, wet surface reflections as practicals]\n[PROMPT: Intimate close-up of [CHAR_MEI] (screen-left, facing right) as the word \"owning\" hangs in the perfumed air like a blade. Rain-wet atmospheric lighting continues, creating soft reflective highlights on her face. Her last hope dies as quietly as a snuffed candle - the moment captured in her subtle expression shift from composed dignity to quiet devastation. The humid, rain-soaked atmosphere permeates the frame, with wet reflections gleaming on her skin. Her positioning maintains the established 180-degree rule from previous frames. The oppressive mood reaches its climax as her world completely crumbles.]\n\n(/scene_frame_chunk_end/)\n\n\n## Scene 10:\nMei's private chambers, the main room with mahogany table\n\n(/scene_frame_chunk_start/)\n[10.1.cA] (Close-up)\nThe final stone clicked against the board with the finality of a closing tomb. [CHAR_MEI] stared at the constellation of defeat spread before her, [CHAR_MIN_ZHU]'s white stones having systematically strangled her black territories until nothing remained but scattered fragments of a dream. Her savings—years of carefully hoarded coins from dancing and hosting—lay beside the board in their silk pouch, suddenly worthless as autumn leaves.\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[10.2.cA] (Medium shot)\n\"A valiant effort,\" [CHAR_MIN_ZHU] said, his voice thick with satisfaction as he leaned back against his cushions. \"But you see now why I am called the shrewdest merchant in three provinces. Your little seductions were charming, but a man doesn't accumulate wealth by thinking with anything but his mind.\" His fingers drummed against the mahogany table like a cat toying with captured prey.\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[10.3.cA] (Wide shot)\nMei's hands remained folded in her lap, her training holding her composure intact even as her world crumbled. Through her chamber window, she could glimpse [CHAR_LIN]'s darkened flower shop, and she wondered if he had read her letter yet, if he understood that her desperate gamble had failed before it truly began.\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[10.4.cA] (Medium shot)\n\"The terms were clear,\" she said quietly, her voice steady despite the ashes in her throat. \"Half price for damaged goods.\"\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[10.5.cA] (Close-up)\n[CHAR_MIN_ZHU]'s laugh rumbled through the chamber. \"Oh, my dear, you misunderstand. After tonight's... entertainment... I consider you far from damaged. In fact, I believe I'll pay [CHAR_MADAME_CHOU] the full amount.\" His eyes glittered with cruel amusement. \"After all, what is money compared to owning something truly exquisite?\"\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[10.6.cA] (Close-up)\nThe word 'owning' hung in the perfumed air like a blade, and Mei felt the last of her hope die as quietly as a snuffed candle.\n(/scene_frame_chunk_end/)\n\n\n--- SCENE 11 ---\n\n\n(/scene_frame_chunk_start/)\n\n[11.2.cA] (Frame)\n[CAM: Medium shot, eye level, static, 50mm]\n[POS: CHAR_LIN center foreground]\n[LIGHT: Moody evening mix, cool moonlight key from above, warm amber fill from brothel windows, wet surface reflections]\n[PROMPT: Medium shot of [CHAR_LIN] standing on the rain-slicked [LOC_PRESSED_DIRT_ROAD_DIR_W], viewed from the north. Evening lighting creates dim, moody atmosphere with wet reflections gleaming on the packed earth surface. Rain continues to fall, creating a misty haze in the cool air. [CHAR_LIN] (center frame) clutches a crumpled letter in his calloused hands, his simple work clothes darkened by moisture. Behind him, his modest flower shop sits in shadow. Across the narrow street, warm golden light spills from the ornate windows of the towering [LOC_LU_XIAN_BROTHEL], its three-story structure looming with carved wooden galleries and red pillars barely visible through the rain. The contrast between the humble flower shop and opulent brothel establishes the gulf between their worlds. Moon's pale light filters through rain clouds, mixing cool blue tones with warm amber glow from the brothel windows. [CHAR_LIN]'s face shows nervous anticipation as he stares up at the pleasure house, his breath visible in the cool night air.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[11.3.cA] (Frame)\n[CAM: Wide establishing shot, slight high angle from north perspective, static, 35mm]\n[POS: CHAR_LIN screen left foreground near flower shop, CHAR_MEI screen right mid-ground descending brothel stairs]\n[LIGHT: Cool blue moonlight key from above, warm amber fill from brothel windows, atmospheric rain haze diffusion]\n[PROMPT: Wide establishing shot of the narrow [LOC_PRESSED_DIRT_ROAD_DIR_W] from the north perspective, maintaining the evening rain atmosphere and dim lighting established previously. The wet dirt road gleams with reflections from the [LOC_LU_XIAN_BROTHEL]'s warm window light. [CHAR_MEI] emerges from a discrete side entrance of the brothel (screen-right), her silk robes flowing like liquid shadow as she descends wooden stairs. Her elegant movement contrasts with the rough environment. [CHAR_LIN] (screen-left) remains positioned near his flower shop, still clutching the letter, now turning his attention toward the approaching figure. The spatial relationship establishes the axis of action between them across the narrow street. Rain continues to create atmospheric haze, with cool blue moonlight mixing with warm amber brothel lighting. [CHAR_MEI]'s porcelain-pale face is barely visible in the dim light, but her graceful descent down the stairs shows the trained precision of her movements. The towering brothel structure frames the right side with its ornate architecture and glowing windows.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[11.4.cA] (Frame)\n[CAM: Medium two-shot, eye level, static, 50mm]\n[POS: CHAR_MEI screen right foreground, CHAR_LIN screen left background]\n[LIGHT: Cool blue moonlight key from above, warm amber rim light from brothel windows behind, atmospheric rain diffusion]\n[PROMPT: Medium two-shot maintaining the evening rain atmosphere and dim lighting continuity. [CHAR_MEI] (screen-right) has reached the bottom of the stairs, pausing on the wet [LOC_PRESSED_DIRT_ROAD_DIR_W]. Her silk robes cling slightly from the moisture, and her breath creates visible vapor in the cool night air. [CHAR_LIN] (screen-left) stands across the narrow distance, the crumpled letter still in his hands. Both characters face each other, maintaining the established spatial relationship and axis of action. The rain creates a misty curtain between them, with cool blue moonlight illuminating [CHAR_MEI]'s porcelain-pale face while warm amber light from the brothel windows behind her creates a subtle rim light on her silhouette. [CHAR_LIN]'s weathered features show protective instinct as he observes her vulnerability beneath her trained composure. The wet dirt road reflects the mixed lighting, creating an intimate pocket of space despite the gulf between their social worlds. Both characters' expressions convey the wonder and uncertainty of this clandestine meeting.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[11.7.cA] (Frame)\n[CAM: Extreme close-up, slightly high angle looking down, static, 100mm macro lens]\n[POS: CHAR_LIN's hands screen left, CHAR_MEI's hands screen right center, intertwined in foreground]\n[LIGHT: Mixed practical lighting, cool blue moonlight key from above, warm amber fill from brothel windows, rim lighting on skin texture]\n[PROMPT: Intimate close-up of intertwined hands on the rain-dampened [LOC_PRESSED_DIRT_ROAD_DIR_W], maintaining the established evening lighting and atmospheric continuity. [CHAR_LIN]'s dirt-stained, calloused fingers gently hold [CHAR_MEI]'s silk-soft palms, creating a powerful visual contrast between their worlds. The camera captures this tender moment from slightly above, showing the texture difference between his honest working hands and her pampered skin. Cool blue moonlight mixes with warm amber glow from the nearby brothel windows, creating subtle rim lighting on their joined hands. Rain droplets glisten on their skin, and [CHAR_LIN]'s thumbs trace gentle circles across her knuckles in a gesture of comfort. The background shows the wet dirt surface of the road, with soft focus maintaining attention on this intimate connection. The lighting emphasizes the vulnerability and trust in this moment - two people from vastly different social stations finding common ground through simple human touch. Their hands represent the bridge across the gulf that separates their worlds, filmed with the same reverence [CHAR_LIN] shows when tending his most delicate flowers.]\n\n(/scene_frame_chunk_end/)\n\n\n## Scene 11:\nThe narrow street between Lin's flower shop and the Lu Xian Brothel\n\nThe [LOC_PRESSED_DIRT_ROAD_DIR_W] lay empty under the moon's pale gaze, the usual evening bustle of the pleasure quarter having retreated behind closed doors and silk curtains. [CHAR_LIN] stood outside his flower shop, [CHAR_MEI]'s letter clutched in his calloused hands, his heart hammering against his ribs like a caged bird. The [LOC_LU_XIAN_BROTHEL] towered before him, its ornate windows glowing with warm light that seemed both inviting and forbidding.\n\nHe had read her words three times, each reading deepening his understanding of the desperate courage it had taken to write them. A woman who watched him tend his flowers with the same longing he felt when gazing at distant stars—unreachable, beautiful, impossibly far from his simple world. (/scene_frame_chunk_start/)\n[11.2.cA] (Medium Shot) Yet she had reached across that gulf with nothing but ink and hope, trusting a stranger with her dreams of freedom. (/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[11.3.cA] (Wide Shot) The sound of footsteps on wooden stairs drew his attention upward. A figure emerged from a side entrance—not the grand front doors where wealthy patrons arrived in sedan chairs, but a servants' passage that led directly to the street. [CHAR_MEI] moved like liquid shadow, her silk robes whispering against stone as she descended, and even in the moonlight he could see the elegant precision that marked every gesture. (/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[11.4.cA] (Medium Shot) She paused at the bottom of the stairs, her breath visible in the cool night air, and for a moment they simply looked at each other across the narrow distance that separated their worlds. Her face was pale as porcelain, beautiful in the way of things too perfect to touch, yet her eyes held a vulnerability that made his chest tighten with protective instinct. (/scene_frame_chunk_end/)\n\n\"You came,\" she whispered, her voice carrying the same wonder he felt at seeing his flowers bloom after the long winter darkness.\n\n\"Your letter...\" [CHAR_LIN] stepped closer, the rice paper rustling in his trembling hands. \"You spoke of gambling everything. Did you—?\"\n\n\"I lost.\" The words fell between them like stones into still water. \"I lost everything, and now I belong to [CHAR_MIN_ZHU] completely.\" Her composure cracked slightly, revealing the devastation beneath her trained serenity. \"I should not have written to you. Should not have dragged you into this ruin.\"\n\n(/scene_frame_chunk_start/)\n[11.7.cA] (Close-up) But [CHAR_LIN] was already moving, crossing the few steps that separated them with the same unhurried purpose he brought to tending wounded plants. When he reached her, he did something that made her breath catch—he took her hands in his, dirt-stained fingers intertwining with silk-soft palms. (/scene_frame_chunk_end/)\n\n\"In my shop,\" he said quietly, \"I have seen flowers that seemed beyond saving. Roots torn, petals withered, everything that made them beautiful seemingly destroyed.\" His thumbs traced gentle circles across her knuckles. \"But with patience, with care, with someone willing to tend them without counting the cost—they bloom again, more beautiful than before.\"\n\n[CHAR_MEI] stared at their joined hands, at the contrast between his honest calluses and her pampered skin, and felt something shift in her chest like ice breaking in spring.\n\n\n--- SCENE 12 ---\n\n\n(/scene_frame_chunk_start/)\n\n[12.1.cA] (Frame)\n[CAM: Medium shot, eye level, static, 50mm]\n[POS: CHAR_MEI screen left facing right, CHAR_LIN screen right facing left, joined hands center frame]\n[LIGHT: Soft overcast key from above, eastern rim light through clouds, wet ground reflections as fill]\n[PROMPT: Medium shot establishing the narrow [LOC_PRESSED_DIRT_ROAD] between buildings in morning rain. Soft eastern light filters through overcast sky, creating gentle wet reflections on the packed earth. [CHAR_MEI] (screen-left, facing right) stands close to [CHAR_LIN] (screen-right, facing left), their hands intertwined between them. Rain dampens her silk robes and his simple merchant clothes. The axis of action runs between their joined hands at center frame. Morning mist rises from the wet ground as [CHAR_LIN]'s calloused fingers trace her delicate wrists with tender reverence. The warm light catches droplets on their skin, creating an intimate atmosphere despite the dreary weather. Both characters lean slightly toward each other, suggesting the fragile hope and connection described in the text.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[12.2.cA] (Frame)\n[CAM: Close-up, eye level, static, 85mm]\n[POS: CHAR_MEI screen left foreground]\n[LIGHT: Soft natural key from east, diffused by overcast, rain creates subtle rim lighting on face]\n[PROMPT: Close-up of [CHAR_MEI] (screen-left as established) in the continuing morning rain on [LOC_PRESSED_DIRT_ROAD]. Same soft eastern light illuminates her face, now etched with vulnerability and desperation. Her voice breaks like morning mist as she speaks of being \"sold, owned, bound by contracts.\" Raindrops cling to her eyelashes and trace down her cheeks, mingling with unshed tears. The wet reflections from the previous frame continue, maintaining the melancholic atmosphere. Her expression shows the weight of her circumstances - the practiced composure of a courtesan cracking to reveal the frightened woman beneath. The 180-degree rule maintained with camera staying on the same side of the established axis.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[12.3.cA] (Frame)\n[CAM: Medium shot, eye level, static, 50mm]\n[POS: CHAR_LIN screen right facing left, CHAR_MEI screen left, joined hands center frame]\n[LIGHT: Soft eastern morning light, diffused by rain clouds, wet reflections on packed earth]\n[PROMPT: Medium shot returning to both characters on [LOC_PRESSED_DIRT_ROAD], maintaining established positions. [CHAR_LIN] (screen-right, facing left) speaks with quiet determination despite trembling hands, his voice steady as he offers to \"write new contracts in soil and sunlight.\" [CHAR_MEI] (screen-left) listens with desperate hope. The morning rain continues, eastern light still soft and diffused, creating the same wet reflections on the packed earth. His merchant clothes are simple but clean, contrasting with her elegant silk robes. The camera maintains the same side of the axis established in the first frame. Both characters remain close, their joined hands still visible at center frame, representing the fragile connection between them as he offers an impossible dream of freedom.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[12.4.cA] (Frame)\n[CAM: Wide establishing shot, slight low angle to emphasize brothel's imposing scale, static hold, 24mm wide lens]\n[POS: CHAR_MEI foreground screen left, CHAR_LIN foreground screen right, CHAR_MIN_ZHU background center emerging from doorway]\n[LIGHT: Soft morning eastern light, wet stone reflections as fill, overcast diffusion creating vulnerable atmosphere]\n[PROMPT: Wide shot expanding to show [LOC_LU_XIAN_BROTHEL] looming behind the narrow [LOC_PRESSED_DIRT_ROAD]. [CHAR_MIN_ZHU] emerges from the servants' entrance (background center), his imposing bulk filling the doorway. Morning rain continues with soft eastern light creating wet reflections on stone walls and packed earth. [CHAR_MEI] and [CHAR_LIN] (foreground, maintaining screen-left and screen-right positions) appear small and vulnerable against the brothel's ornate architecture. His merchant robes rustle as he advances, moonlight - wait, correcting to morning light - catches the cruel satisfaction in his eyes. The three-story pleasure house with its carved galleries and red pillars dominates the background, emphasizing the power dynamic. Heavy footsteps echo against wet stone as he surveys his \"property\" with predatory focus.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[12.5.cA] (Frame)\n[CAM: Medium shot, eye level, static, 50mm]\n[POS: CHAR_LIN screen right foreground, CHAR_MEI screen left mid-ground, CHAR_MIN_ZHU center background]\n[LIGHT: Soft overcast morning light, eastern key light diffused by rain clouds, wet surfaces creating subtle reflections]\n[PROMPT: Medium shot on [LOC_PRESSED_DIRT_ROAD] as tension escalates in the continuing morning rain. [CHAR_LIN] (screen-right) steps protectively forward, placing his body between [CHAR_MEI] (screen-left) and the approaching [CHAR_MIN_ZHU] (background center). The florist's gentle nature contrasts with his unexpected steel as he defends her, though fear trembles through his frame. [CHAR_MEI] tries to pull free but [CHAR_LIN]'s fingers tighten protectively around hers. Same soft eastern light and wet reflections maintain the established atmosphere. [CHAR_MIN_ZHU]'s bulk advances closer, his merchant robes dark against the morning mist. The 180-degree rule preserved - camera remains on the same side of the axis. [CHAR_LIN]'s quiet courage shows in his posture despite being no match for the wealthy merchant's power and influence.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[12.6.cA] (Frame)\n[CAM: Close-up, eye-level, static, 85mm]\n[POS: CHAR_MEI screen left foreground]\n[LIGHT: Soft eastern morning light, natural fill from overcast sky, atmospheric rain reflections]\n[PROMPT: Close-up of [CHAR_MEI] (screen-left position maintained) on rain-wet [LOC_PRESSED_DIRT_ROAD]. The morning light catches the terrible realization in her eyes as she understands the danger she has brought to [CHAR_LIN]. Her expression shows the weight of dragging this gentle soul into her ruin. Rain continues to dampen her silk robes, and the soft eastern lighting creates the same atmospheric wet reflections established throughout the scene. Her face reveals the internal conflict - the trained courtesan's composure warring with genuine fear for [CHAR_LIN]'s safety. The threat hangs \"like incense smoke, heavy and choking\" as she feels his grip falter slightly, not from cowardice but from understanding what defying [CHAR_MIN_ZHU] would cost his quiet life among his beloved plants.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[12.7.cA] (Frame)\n[CAM: Medium shot, eye level, static, 50mm]\n[POS: CHAR_MEI screen left, CHAR_LIN screen right]\n[LIGHT: Soft natural key from east, diffused by overcast sky, wet ground reflections as fill]\n[PROMPT: Medium shot returning to both characters on [LOC_PRESSED_DIRT_ROAD], maintaining their established screen positions. [CHAR_MEI] (screen-left) straightens into the practiced grace of [CHAR_MADAME_CHOU]'s prized courtesan, her training reasserting itself as she whispers urgently to [CHAR_LIN] (screen-right). The morning rain and soft eastern light continue unchanged, creating the same wet reflections on the packed earth. Her silk robes, though dampened, flow with renewed elegance as she adopts the expected posture of submission. \"Go,\" she whispers with desperate urgency, \"This was folly. I belong to him now, as surely as your flowers belong to their soil.\" The camera maintains the same side of the established axis, showing her transformation from vulnerable woman back to resigned courtesan, sacrificing her own happiness to protect his safety.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[12.8.cA] (Frame)\n[CAM: Close-up, eye-level angle, static, 85mm]\n[POS: CHAR_LIN center foreground, CHAR_MEI implied screen right via hands, CHAR_MIN_ZHU off-camera]\n[LIGHT: Soft eastern morning key light, atmospheric rain diffusion, wet surface reflections as fill]\n[PROMPT: Close-up of [CHAR_LIN] (screen-right as established) on the rain-soaked [LOC_PRESSED_DIRT_ROAD]. His hands remain steady around [CHAR_MEI]'s despite the danger, morning light illuminating the quiet determination in his weathered face. The same soft eastern lighting and wet atmospheric reflections continue from previous frames. His voice carries soft but unshakeable conviction as he meets the unseen [CHAR_MIN_ZHU]'s glare without flinching. \"Some things cannot be owned,\" he declares, his gentle nature transformed into unexpected strength. Rain beads on his simple merchant clothes, but his expression shows no retreat. The florist who battles aphids and drought has found steel within himself, refusing to abandon the woman he cherishes. His calloused hands, accustomed to nurturing fragile seedlings, now protect something infinitely more precious with the same tender reverence.]\n\n(/scene_frame_chunk_end/)\n\n\n## Scene 12:\nThe narrow street between Lin's flower shop and the Lu Xian Brothel\n\n(/scene_frame_chunk_start/)\n[12.1.cA] (Medium Shot)\n\nThe warmth of [CHAR_LIN]'s hands around hers felt like sunlight after endless winter, and for a moment [CHAR_MEI] allowed herself to believe that tenderness could triumph over transaction, that a florist's gentle touch might somehow undo the chains forged by years of gilded captivity. His calloused fingers traced the delicate bones of her wrists with the same reverence she had watched him show his most fragile seedlings, and she understood that this was what she had yearned for—to be cherished not for her beauty or training, but simply for existing.\n\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[12.2.cA] (Close-up)\n\n\"You speak of damaged flowers,\" she whispered, her voice breaking like morning mist, \"but I am not merely withered. I am sold, owned, bound by contracts written in gold and sealed with my own desperation.\"\n\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[12.3.cA] (Medium Shot)\n\n\"Then we'll write new contracts,\" [CHAR_LIN] said, his voice steady despite the tremor in his hands. \"In soil and sunlight, in patience and—\"\n\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[12.4.cA] (Wide Shot)\n\nHeavy footsteps echoed against the stone walls of the [LOC_LU_XIAN_BROTHEL], and [CHAR_MEI]'s blood turned to ice as [CHAR_MIN_ZHU]'s bulk emerged from the servants' entrance. His merchant's robes rustled with each deliberate step, and moonlight caught the cruel satisfaction glittering in his eyes as he surveyed the scene before him—his newly purchased property standing hand-in-hand with a common tradesman.\n\n\"How touching,\" [CHAR_MIN_ZHU]'s voice carried the false warmth of honey poured over poison. \"My investment seeks comfort in the arms of a flower seller. Tell me, beautiful one, did you arrange this meeting before or after you lost everything to me?\"\n\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[12.5.cA] (Medium Shot)\n\n[CHAR_MEI] tried to pull her hands free from [CHAR_LIN]'s grasp, but the florist's fingers tightened protectively. She felt the tremor of fear run through him—he was no warrior, no wealthy patron with guards and influence, just a gentle man whose greatest battles were fought against aphids and drought. Yet he stepped slightly forward, placing his body between her and [CHAR_MIN_ZHU]'s advancing bulk.\n\n\"The lady sought only fresh air,\" [CHAR_LIN] said quietly, though his voice carried unexpected steel. \"Surely even your... arrangements... allow for such simple pleasures.\"\n\n[CHAR_MIN_ZHU]'s laugh rumbled through the narrow street like distant thunder. \"My arrangements allow for whatever I deem appropriate. And I find midnight meetings with strange men highly inappropriate for someone in her position.\" His eyes fixed on their joined hands with predatory focus. \"Release my property, flower seller, before I decide your shop requires... renovation.\"\n\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[12.6.cA] (Close-up)\n\nThe threat hung in the air like incense smoke, heavy and choking. [CHAR_MEI] felt [CHAR_LIN]'s grip falter slightly—not from cowardice, but from the terrible understanding of what defying [CHAR_MIN_ZHU] would cost. She had dragged this gentle soul into her ruin, endangered the quiet life he had built among his beloved plants.\n\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[12.7.cA] (Medium Shot)\n\n\"Go,\" she whispered urgently, her training reasserting itself as she straightened into the practiced grace expected of [CHAR_MADAME_CHOU]'s most prized courtesan. \"This was folly. I belong to him now, as surely as your flowers belong to their soil.\"\n\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[12.8.cA] (Close-up)\n\nBut [CHAR_LIN]'s hands remained steady around hers, his voice soft but unshakeable. \"Some things,\" he said, meeting [CHAR_MIN_ZHU]'s glare without flinching, \"cannot be owned.\"\n\n(/scene_frame_chunk_end/)\n\n\n--- SCENE 13 ---\n\n\n(/scene_frame_chunk_start/)\n\n[13.1.cA] (Frame)\n[CAM: Wide establishing shot, slight high angle, static, 24mm wide lens]\n[POS: CHAR_MEI screen left foreground, CHAR_LIN center-left, CHAR_MIN_ZHU center-right, CHAR_MADAME_CHOU screen right background at brothel entrance]\n[LIGHT: Golden hour chiaroscuro, key light from eastern sunrise breaking through storm clouds, dramatic westward shadows across dirt road, paper lanterns providing warm fill]\n[PROMPT: Wide establishing shot of [LOC_PRESSED_DIRT_ROAD] between [LOC_LU_XIAN_BROTHEL] and Lin's flower shop. Storm clouds overhead with sunrise lighting breaking through from the east, casting long golden shadows westward across the dirt road. [CHAR_MADAME_CHOU] emerges from the ornate entrance of [LOC_LU_XIAN_BROTHEL] (screen-right background), her silk robes catching the hazy morning light. [CHAR_MEI] (screen-left foreground) stands with [CHAR_LIN] (center-left), while [CHAR_MIN_ZHU] (center-right) faces them in confrontation. The merchant's bulk dominates the middle ground. Tense standoff atmosphere with golden sunrise light filtering through storm clouds, creating dramatic chiaroscuro lighting across the narrow street. Paper lanterns from the brothel sway in the storm wind. AXIS OF ACTION established between the confronting parties across the width of the road.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[13.2.cA] (Frame)\n[CAM: Medium shot, eye level, static, 50mm]\n[POS: CHAR_MADAME_CHOU screen right foreground, CHAR_MIN_ZHU screen left background]\n[LIGHT: Golden hour key from east, soft fill, warm highlights on silk and carved details]\n[PROMPT: Medium shot maintaining the golden sunrise lighting from the east. [CHAR_MADAME_CHOU] (screen-right) steps forward from [LOC_LU_XIAN_BROTHEL]'s entrance, her weathered face impassive yet commanding in the soft morning light. [CHAR_MIN_ZHU] (screen-left, facing right) shifts his considerable bulk with obvious irritation, his merchant robes rustling. The storm continues overhead but sunrise light creates warm highlights on both characters. Madame Chou's silk robes catch the golden light as she surveys the scene with decades of authority. The ornate red pillars and carved wooden galleries of the brothel frame the background. 180-degree rule maintained - camera stays on established side of the confrontation axis. Hazy morning atmosphere softens the tension while emphasizing the power dynamic between the small but authoritative Madame and the hulking merchant.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[13.3.cA] (Frame)\n[CAM: Close-up, slight low angle, slow push-in, 85mm]\n[POS: CHAR_MADAME_CHOU screen right facing left, LOC_LU_XIAN_BROTHEL galleries background soft focus]\n[LIGHT: Golden sunrise key from east, soft fill on weathered features, warm ethereal rim light contrasting stormy atmosphere]\n[PROMPT: Close-up of [CHAR_MADAME_CHOU] (screen-right, facing left as established) with the same golden sunrise lighting from the east creating soft shadows on her weathered features. Her small frame radiates authority despite her size, eyes holding decades of wisdom and unexpected weariness. The storm's hazy atmosphere continues, with warm morning light highlighting the maternal concern breaking through her business mask. Behind her, the ornate details of [LOC_LU_XIAN_BROTHEL]'s carved wooden galleries blur in soft focus. Her silk robes catch the golden light as she steps closer to the confrontation. The sunrise lighting emphasizes the profound moment of her decision to protect Mei, casting her in warm, almost ethereal light that contrasts with the stormy sky above. Building emotional intensity as the camera moves closer to capture her pivotal choice.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[13.4.cA] (Frame)\n[CAM: Medium shot, eye level, static, 50mm]\n[POS: CHAR_LIN center-left foreground, CHAR_MEI screen left foreground, merchant screen right background soft focus]\n[LIGHT: Golden hour key from east, warm fill on faces, dramatic contrast with storm clouds above]\n[PROMPT: Medium shot returning to [CHAR_LIN] (center-left, facing right) and [CHAR_MEI] (screen-left, facing right) on [LOC_PRESSED_DIRT_ROAD]. Same golden sunrise lighting from the east continues, casting long shadows westward across the packed dirt. Lin's grip tightens on Mei's hands as understanding dawns - his calloused fingers intertwined with hers. The storm clouds above create dramatic contrast with the warm morning light illuminating their faces. Lin's simple clothing and honest demeanor stand in stark contrast to the merchant's bulk visible in soft focus background (screen-right). The narrow street between buildings frames the intimate moment. Hazy morning atmosphere softens the scene while maintaining the established lighting continuity. Their body language shows the magnitude of his offer - every saved coin from his flower shop, his life's work offered for love. 180-degree rule maintained with characters in established positions.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[13.5.cA] (Frame)\n[CAM: Close-up, eye-level, static, 85mm portrait lens]\n[POS: CHAR_MEI screen-left facing right, foreground dominant]\n[LIGHT: Golden hour key from east, soft fill from hazy atmosphere, rim lighting creating halo effect]\n[PROMPT: Close-up of [CHAR_MEI] (screen-left, facing right as established) on [LOC_PRESSED_DIRT_ROAD]. The same golden sunrise lighting from the east illuminates her face with soft, warm highlights, creating a halo effect through the hazy morning atmosphere. Her expression shows wonder and terror breaking across her delicate features - eyes wide with disbelief at Lin's sacrifice. The storm continues overhead but the sunrise light catches tears beginning to form. Her voice breaks with emotion as she whispers about his flowers, his life's work. The packed dirt road beneath shows the wear of countless feet, symbolic of the crossroads moment. Soft focus background maintains the stormy morning setting while the intimate lighting emphasizes her emotional transformation. The golden light quality creates an almost ethereal glow around her face, highlighting this pivotal moment of realization about love freely offered versus transactions of desperation.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[13.6.cA] (Frame)\n[CAM: Extreme close-up, eye-level, static, 135mm macro lens]\n[POS: CHAR_LIN center-right foreground, CHAR_MEI center-left foreground]\n[LIGHT: Golden hour key from east, soft fill bounce, atmospheric haze diffusion]\n[PROMPT: Intimate close-up of [CHAR_LIN] and [CHAR_MEI] on [LOC_PRESSED_DIRT_ROAD]. Golden sunrise lighting from the east creates warm, soft illumination on both faces as Lin's calloused hands frame Mei's delicate features with infinite tenderness. The hazy morning atmosphere from the storm creates an ethereal quality around them. Lin (center-right, facing left) gazes into Mei's eyes (center-left, facing right) with profound love and certainty. His thumb traces her cheek as sunrise light catches the moisture of her tears. The narrow street setting fades into soft focus, isolating this moment of pure connection. Storm clouds overhead contrast with the warm golden light on their faces. His weathered hands speak of honest labor while her porcelain skin shows the contrast of their worlds. The lighting emphasizes the sincerity of his declaration - knowing her through small observations, finding lifetime foundation in courage and beauty rather than transaction.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[13.7.cA] (Frame)\n[CAM: Medium shot, slight low angle, static, 50mm]\n[POS: CHAR_MADAME_CHOU screen right center, facing screen left]\n[LIGHT: Golden hour key from east, warm highlights on face, soft fill from overcast sky, benedictory rim lighting]\n[PROMPT: Medium shot of [CHAR_MADAME_CHOU] (screen-right, facing left) at [LOC_LU_XIAN_BROTHEL]'s ornate entrance. The golden sunrise lighting from the east continues, casting warm highlights across her weathered features as she smiles - the first genuine expression in years. Her silk robes catch the morning light against the backdrop of carved wooden galleries and red pillars. The storm persists overhead but the hazy atmosphere softens around her maternal expression. Twenty years of watching Mei grow culminate in this moment of liberation. The brothel's opulent architecture frames her decision - paper lanterns swaying in storm wind, upturned eaves silhouetted against stormy sky. Her small frame radiates authority and unexpected tenderness as she declares Mei's freedom. The sunrise light creates an almost benedictory glow around her figure, emphasizing the profound gift she's giving. Long shadows stretch westward across the scene, marking this dawn as a new beginning.]\n\n(/scene_frame_chunk_end/)\n\n\n(/scene_frame_chunk_start/)\n\n[13.8.cA] (Frame)\n[CAM: Wide shot, eye level, static, 35mm]\n[POS: CHAR_MEI screen left foreground, CHAR_LIN center-left foreground, CHAR_MIN_ZHU screen right background retreating]\n[LIGHT: Golden hour key from east, long shadows stretching west, storm clouds breaking to allow filtered sunrise through hazy atmosphere]\n[PROMPT: Wide shot returning to full view of [LOC_PRESSED_DIRT_ROAD] between [LOC_LU_XIAN_BROTHEL] and Lin's flower shop. Golden sunrise lighting from the east continues with long shadows stretching westward across the packed dirt. [CHAR_MIN_ZHU] (screen-right background) retreats with furious protests fading into the storm, his bulk diminishing as he moves away from the confrontation. [CHAR_MEI] (screen-left) and [CHAR_LIN] (center-left) stand together in the foreground, her chains of gold and desperation finally shattered. The brothel's ornate architecture (screen-right) with its carved galleries and red pillars witnesses this transformation. Storm clouds overhead begin to break, allowing more sunrise light to filter through the hazy morning atmosphere. Paper lanterns sway in the wind as the possibility of love freely given replaces transaction and ownership. The narrow street that once trapped now opens toward freedom, with golden light illuminating their path forward.]\n\n(/scene_frame_chunk_end/)\n\n\n## Scene 13:\nThe narrow street between Lin's flower shop and the Lu Xian Brothel\n\n(/scene_frame_chunk_start/)\n[13.1.cA] (Wide Shot)\nThe standoff stretched between them like a taut silk thread ready to snap when footsteps echoed from the [LOC_LU_XIAN_BROTHEL]'s main entrance. [CHAR_MADAME_CHOU] emerged into the moonlight, her silk robes rustling with authority as she surveyed the scene with eyes that had witnessed decades of such dramas. Her weathered face remained impassive, yet [CHAR_MEI] caught something unexpected in her mentor's gaze—not anger, but a profound weariness.\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[13.2.cA] (Medium Shot)\n\"[CHAR_MIN_ZHU],\" Madame Chou's voice carried the weight of absolute command. \"I believe there has been a misunderstanding about the evening's transaction.\"\n\nThe merchant's bulk shifted with obvious irritation. \"No misunderstanding, honored Madame. The girl lost our wager fair and square. She belongs to me now, at whatever price I choose to pay.\"\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[13.3.cA] (Close-Up)\n\"Ah, but you forget one crucial detail.\" Madame Chou stepped closer, her small frame somehow dwarfing the merchant's considerable presence. \"The contract for [CHAR_MEI]'s services has never been finalized. No payment has changed hands, no papers signed. She remains, technically, a free agent.\"\n\n[CHAR_MIN_ZHU]'s face darkened like storm clouds. \"We had an agreement—\"\n\n\"We had a conversation about possibilities,\" Madame Chou corrected smoothly. \"Nothing more. And I find myself... reconsidering the wisdom of such an arrangement.\" Her eyes found [CHAR_MEI]'s face, and for a moment the mask of business calculation slipped, revealing something achingly maternal. \"Twenty years I have watched this child grow, taught her everything I know. Perhaps it is time she used those lessons to write her own story.\"\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[13.4.cA] (Medium Shot)\n[CHAR_LIN]'s grip on [CHAR_MEI]'s hands tightened as understanding dawned. \"I have savings,\" he said quietly, his voice steady despite the magnitude of what he was offering. \"Not much by merchant standards, but earned honestly. Every coin from flowers sold, every tael saved from simple living.\"\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[13.5.cA] (Close-Up)\n\"Your flowers,\" [CHAR_MEI] whispered, her voice breaking with wonder and terror. \"You would sacrifice your life's work for someone you barely know?\"\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[13.6.cA] (Intimate Close-Up)\n[CHAR_LIN] turned to face her fully, his calloused hands framing her face with infinite tenderness. \"I know how you watch the sunrise from your window. I know you find beauty in small things, hope in impossible dreams. I know you wrote to a stranger with courage that humbles me.\" His thumb traced the curve of her cheek. \"That is enough to build a lifetime upon.\"\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[13.7.cA] (Medium Shot)\n[CHAR_MADAME_CHOU] smiled—the first genuine expression [CHAR_MEI] had seen from her in years. \"Then it is settled. [CHAR_MEI], you are free to choose your own path.\"\n(/scene_frame_chunk_end/)\n\n(/scene_frame_chunk_start/)\n[13.8.cA] (Wide Shot)\nAs [CHAR_MIN_ZHU]'s furious protests faded into the night, [CHAR_MEI] felt chains forged of gold and desperation finally shatter, replaced by something infinitely more precious—the possibility of love freely given and gratefully received.\n(/scene_frame_chunk_end/)\n",
  "total_frames": 61,
  "total_scenes": 13,
  "metadata": {
    "media_type": "standard",
    "visual_style": "live_action",
    "style_notes": ""
  },
  "scenes": [
    {
      "scene_number": 1,
      "frame_count": 3,
      "frames": [
        {
          "frame_id": "1.3.cA",
          "scene_number": 1,
          "frame_number": 3,
          "cameras": [
            "1.3.cA"
          ],
          "camera_notation": "[1.3.cA]",
          "position_notation": "[POS: CHAR_MEI screen left foreground elevated, CHAR_LIN screen right background street level]",
          "lighting_notation": "[LIGHT: Soft morning key from east, filtered through wooden screens, gentle fill on balcony]",
          "prompt": "Medium shot from [LOC_MEI_BEDROOM_PATIO] overlooking [LOC_PRESSED_DIRT_ROAD]. Morning light filters from the east, casting soft shadows through carved wooden screens. [CHAR_MEI] (screen-left foreground, facing right) kneels on silk cushions, her morning robe whispering against the wooden balcony railing, the ornate mother-of-pearl inlay catching the morning light. Below on the street, [CHAR_LIN] (screen-right background, distant) emerges from his corner shop, his figure small but distinct as he arranges wooden buckets with gentle precision. High angle looking down emphasizes the physical and social distance between them. Merchants' carts move along the pressed dirt road, their voices carrying upward. AXIS OF ACTION established between Mei's elevated position and Lin's street-level activities.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_LIN"
            ],
            "locations": [
              "LOC_PRESSED_DIRT_ROAD",
              "LOC_MEI_BEDROOM_PATIO"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "1.5.cA",
          "scene_number": 1,
          "frame_number": 5,
          "cameras": [
            "1.5.cA"
          ],
          "camera_notation": "[1.5.cA]",
          "position_notation": "[POS: CHAR_MEI center foreground, wooden screen pattern background]",
          "lighting_notation": "[LIGHT: Natural key from east window, soft fill through carved patterns, delicate shadow play across face]",
          "prompt": "Extreme close-up of [CHAR_MEI] (screen-left as established) pressed against the carved wooden screen on [LOC_MEI_BEDROOM_PATIO]. Morning light from the east illuminates her face through the intricate carved patterns, creating delicate shadows across her features. Her breathing has quickened, visible in the subtle rise and fall of her silk robe at frame edge. Her fingers grip the screen's wooden framework, knuckles slightly white with tension. Her eyes are fixed downward toward the street below, pupils dilated with anticipation. The mother-of-pearl inlay of the screen blurs softly in the shallow depth of field behind her. Her expression shows a mixture of longing and determination. Soft morning light emphasizes this intimate moment of decision.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_MEI_BEDROOM_PATIO"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "1.6.cA",
          "scene_number": 1,
          "frame_number": 6,
          "cameras": [
            "1.6.cA"
          ],
          "camera_notation": "[1.6.cA]",
          "position_notation": "[POS: CHAR_MEI center foreground, eyes and upper face filling frame]",
          "lighting_notation": "[LIGHT: Soft natural key from east, carved screen creating dappled shadows, gentle fill maintaining detail in shadow areas]",
          "prompt": "Extreme close-up of [CHAR_MEI]'s eyes and upper face. Soft morning light from the east creates a gentle key light across her features. Her dark eyes reflect unwavering resolve, pupils focused with intense clarity. Fine details visible: the slight tremor of her eyelashes, the determined set of her brow, morning light catching moisture gathering at the corners of her eyes - not tears of sadness, but of anticipation. Carved wooden screen pattern casts subtle dappled shadows across her skin. Breathing controlled but intense, nostrils slightly flared. The extreme close-up isolates her from the world, emphasizing this pivotal moment of internal transformation.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [],
            "props": []
          },
          "location_direction": "NORTH"
        }
      ]
    },
    {
      "scene_number": 2,
      "frame_count": 3,
      "frames": [
        {
          "frame_id": "2.2.cA",
          "scene_number": 2,
          "frame_number": 2,
          "cameras": [
            "2.2.cA"
          ],
          "camera_notation": "[2.2.cA]",
          "position_notation": "[POS: CHAR_MADAME_CHOU screen right, seated behind table]",
          "lighting_notation": "[LIGHT: Soft natural key from east window, diffused by morning fog and incense smoke, gentle fill from silk-draped ambient light]",
          "prompt": "Medium shot of [CHAR_MADAME_CHOU] seated behind a low lacquered table in her private receiving chamber within [LOC_LU_XIAN_BROTHEL]. Morning fog diffuses soft eastern light through silk-draped windows, creating a gentle, hazy atmosphere. [CHAR_MADAME_CHOU] (screen-right, facing left) sits with practiced authority, her weathered fingers sorting through multiple scrolls spread across the dark wood surface. She wears traditional robes befitting her station as the brothel's proprietress. Her expression carries decades of experience in delicate negotiations. Incense smoke curls from bronze holders positioned around the chamber, adding to the foggy morning ambiance. Rich silk tapestries line the walls, muffling outside sounds. The key light from the east window illuminates her profile, highlighting the mixture of business acumen and maternal concern in her features as she announces the morning's offers. AXIS OF ACTION established with [CHAR_MADAME_CHOU] on screen-right.",
          "tags": {
            "characters": [
              "CHAR_MADAME_CHOU"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "2.4.cA",
          "scene_number": 2,
          "frame_number": 4,
          "cameras": [
            "2.4.cA"
          ],
          "camera_notation": "[2.4.cA]",
          "position_notation": "[POS: CHAR_MADAME_CHOU screen right center, maintaining established eyeline]",
          "lighting_notation": "[LIGHT: Soft eastern key light through fog, gentle fill from ambient morning glow, atmospheric incense haze]",
          "prompt": "Close-up of [CHAR_MADAME_CHOU] positioned screen-right center. Soft morning light filters through the foggy atmosphere of [LOC_LU_XIAN_BROTHEL], casting gentle shadows across her weathered features. Her expression reveals a complex mixture of maternal affection and business pragmatism. Her eyes soften momentarily, revealing deeper emotional connection beneath her professional exterior. Eastern key light illuminates her face, emphasizing the lines of experience around her eyes. Incense smoke drifts softly in the background, maintaining the intimate, enclosed atmosphere of the private chamber. Her lips curve into an ambiguous expression balancing protective concern with calculating assessment. 85mm lens, eye-level angle, static hold.",
          "tags": {
            "characters": [
              "CHAR_MADAME_CHOU"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "2.6.cA",
          "scene_number": 2,
          "frame_number": 6,
          "cameras": [
            "2.6.cA"
          ],
          "camera_notation": "[2.6.cA]",
          "position_notation": "[POS: CHAR_MEI screen left foreground kneeling, CHAR_MADAME_CHOU screen right background standing]",
          "lighting_notation": "[LIGHT: Soft diffused morning light from east window, atmospheric haze, incense smoke creating depth]",
          "prompt": "Two-shot revealing both characters in the receiving chamber of [LOC_LU_XIAN_BROTHEL]. [CHAR_MEI] (screen-left, facing right) kneels before the low lacquered table in traditional posture, her hands folded in her lap with white knuckles betraying her inner tension. [CHAR_MADAME_CHOU] (screen-right, facing left) maintains her authoritative position behind the scattered scrolls. The morning fog continues to diffuse the eastern light, creating a soft, hazy atmosphere throughout the silk-draped chamber. Incense smoke drifts between them, symbolically representing the tension in their conversation. [CHAR_MEI]'s carefully composed expression contrasts with the rebellion stirring beneath her calm exterior as she quietly questions the arrangement. [CHAR_MADAME_CHOU]'s eyes sharpen in response, her maternal facade giving way to cold business reality. The foggy morning light emphasizes the power dynamic between the two women in this pivotal negotiation scene.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_MADAME_CHOU"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        }
      ]
    },
    {
      "scene_number": 3,
      "frame_count": 7,
      "frames": [
        {
          "frame_id": "3.1.cA",
          "scene_number": 3,
          "frame_number": 1,
          "cameras": [
            "3.1.cA"
          ],
          "camera_notation": "[3.1.cA]",
          "position_notation": "[POS: CHAR_MEI screen left foreground, CHAR_MIN_ZHU screen right background seated]",
          "lighting_notation": "[LIGHT: Soft morning key from east, natural fill, long shadow play across courtyard stones]",
          "prompt": "Wide establishing shot of the main courtyard within [LOC_LU_XIAN_BROTHEL] from the north entrance perspective. Bright soft morning light streams from the east, casting long shadows across polished stone floors. [CHAR_MEI] (screen-left foreground, facing right) glides gracefully across the courtyard space, her silk slippers silent on the stones, completing an elegant dance movement. [CHAR_MIN_ZHU] (screen-right background, facing left) sits cross-legged on [PROP_BAMBOO_MATS] beside the [PROP_MAHOGANY_TABLE], his wealthy merchant's robes rich in texture. The [PROP_WOODEN_GO_BOARD] sits waiting on the low table between their positions. His calculating gaze follows her every movement with merchant-like appraisal. The courtyard's ornate red pillars frame the scene, with carved wooden galleries visible in the background. Paper lanterns hang motionless in the still morning air. Axis of action established between the two characters across the courtyard space.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_MIN_ZHU"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": [
              "PROP_BAMBOO_MATS",
              "PROP_MAHOGANY_TABLE",
              "PROP_WOODEN_GO_BOARD"
            ]
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "3.2.cA",
          "scene_number": 3,
          "frame_number": 2,
          "cameras": [
            "3.2.cA"
          ],
          "camera_notation": "[3.2.cA]",
          "position_notation": "[POS: CHAR_MEI screen left foreground, CHAR_MIN_ZHU screen right background seated]",
          "lighting_notation": "[LIGHT: Soft natural key from east, gentle fill on faces, warm morning atmosphere]",
          "prompt": "Medium two-shot at eye level with 50mm lens, static hold. Bright soft morning light from the east fills the frame. [CHAR_MEI] stands screen-left foreground, facing right, poised after completing her dance with fan snapping closed with practiced precision. [CHAR_MIN_ZHU] sits screen-right background on cushions, facing left, wearing merchant's robes, gesturing toward the [PROP_WOODEN_GO_BOARD] resting on the [PROP_MAHOGANY_TABLE]. His eyes hold appraising intensity as his lips form the word 'Exquisite.' Morning light casts soft shadows across the polished stones of [LOC_LU_XIAN_BROTHEL]. Carved pillars frame the ornate courtyard setting in the background. Camera maintains 180-degree rule, staying on the established axis between characters.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_MIN_ZHU"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": [
              "PROP_WOODEN_GO_BOARD",
              "PROP_MAHOGANY_TABLE"
            ]
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "3.3.cA",
          "scene_number": 3,
          "frame_number": 3,
          "cameras": [
            "3.3.cA"
          ],
          "camera_notation": "[3.3.cA]",
          "position_notation": "[POS: CHAR_MEI screen left facing right]",
          "lighting_notation": "[LIGHT: Soft natural key from east, gentle fill, warm morning atmosphere]",
          "prompt": "Close-up reaction shot of [CHAR_MEI] (screen-left, facing right as established) in the [LOC_LU_XIAN_BROTHEL] courtyard. The same bright soft morning light from the east illuminates her face, casting gentle shadows that accentuate her graceful features. Her head inclines in a respectful bow, maintaining the elegant poise from the previous frame. Despite her outward composure, there's a subtle tension visible in her eyes - her pulse quickening as she processes his words about the Go game. The morning light catches the silk of her garments, unchanged from the previous shots. Her expression shows practiced courtesy masking inner calculation. The polished stone floor remains visible in the lower portion of the frame, maintaining visual continuity with the established courtyard setting.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "3.4.cA",
          "scene_number": 3,
          "frame_number": 4,
          "cameras": [
            "3.4.cA"
          ],
          "camera_notation": "[3.4.cA]",
          "position_notation": "[POS: CHAR_MIN_ZHU screen right facing screen left]",
          "lighting_notation": "[LIGHT: Soft morning key from east, gentle fill, warm golden hour atmosphere]",
          "prompt": "Medium close-up of [CHAR_MIN_ZHU] (screen-right, facing left as established) in the [LOC_LU_XIAN_BROTHEL] courtyard. The bright soft morning light from the east continues to illuminate the scene, casting gentle shadows across his merchant's robes. His laugh reveals no warmth as his fingers drum rhythmically against his knee. His gaze shifts between the empty [PROP_WOODEN_GO_BOARD] and back toward [CHAR_MEI]'s position off-screen. The calculating intensity in his eyes has sharpened, revealing his true nature as someone who lives for high-stakes games. His breathing has shifted subtly, showing excitement when discussing risk and sacrifice. The morning light catches the rich texture of his robes, emphasizing his wealth. The polished stones of the courtyard floor remain visible, maintaining the established setting. His expression reveals a man who finds his truest pleasure in moments when fortune balances precariously, the thrill of the wager more intoxicating than material wealth.",
          "tags": {
            "characters": [
              "CHAR_MIN_ZHU",
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": [
              "PROP_WOODEN_GO_BOARD"
            ]
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "3.5.cA",
          "scene_number": 3,
          "frame_number": 5,
          "cameras": [
            "3.5.cA"
          ],
          "camera_notation": "[3.5.cA]",
          "position_notation": "[POS: CHAR_MEI screen-left facing right, CHAR_MIN_ZHU off-screen right]",
          "lighting_notation": "[LIGHT: Soft morning key from east, gentle fill maintaining established shadows, warm natural atmosphere]",
          "prompt": "Close-up reaction shot of [CHAR_MEI] (screen-left, facing right as established) in the [LOC_LU_XIAN_BROTHEL] courtyard. The same bright soft morning light from the east continues to illuminate her face with gentle, consistent shadows. Her expression shows keen observation as she studies [CHAR_MIN_ZHU] off-screen right, her eyes tracking his movements and mannerisms. There's a subtle shift in her demeanor - not attraction, but the sharp recognition of someone identifying a crucial weakness. Her breathing remains controlled, but her eyes show the calculating mind of a strategist at work. The morning light catches the silk of her unchanged garments, maintaining visual continuity. Her gaze focuses intently on his position off-screen, particularly noting how his breathing shifts when he discusses stakes and risk. A slight narrowing of her eyes suggests she's cataloging his tells, recognizing his addiction to games of chance. The polished stone floor of the courtyard remains visible, preserving the established setting and spatial relationships.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_MIN_ZHU"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "3.6.cA",
          "scene_number": 3,
          "frame_number": 6,
          "cameras": [
            "3.6.cA"
          ],
          "camera_notation": "[3.6.cA]",
          "position_notation": "[POS: CHAR_MEI center frame, eyes and upper face filling frame]",
          "lighting_notation": "[LIGHT: Soft natural key from east, gentle fill light, subtle eye catchlights]",
          "prompt": "Extreme close-up of [CHAR_MEI]'s eyes and upper face in the [LOC_LU_XIAN_BROTHEL] courtyard. The bright soft morning light from the east creates subtle highlights in her eyes, maintaining the established lighting. A spark of realization flickers across her gaze as understanding dawns. Her eyes show the moment of strategic breakthrough - the instant when she recognizes that [CHAR_MIN_ZHU]'s gambling addiction could become her advantage. There's a subtle but unmistakable shift in her expression, from cautious observation to quiet confidence. The morning light catches the delicate features of her face, emphasizing the intelligence behind her eyes. Her breathing remains steady, but there's an almost imperceptible change in the set of her mouth - not quite a smile, but the shadow of one. This intimate framing captures the internal transformation as she shifts from defensive positioning to offensive strategy. The soft focus background maintains the courtyard setting while drawing complete attention to this crucial moment of recognition and tactical planning.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_MIN_ZHU"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "3.7.cA",
          "scene_number": 3,
          "frame_number": 7,
          "cameras": [
            "3.7.cA"
          ],
          "camera_notation": "[3.7.cA]",
          "position_notation": "[POS: CHAR_MEI screen left foreground, CHAR_MIN_ZHU screen right foreground, PROP_WOODEN_GO_BOARD center between characters]",
          "lighting_notation": "[LIGHT: Soft morning key from east, gentle fill maintaining even exposure on both faces, warm golden hour quality]",
          "prompt": "Medium two-shot in the [LOC_LU_XIAN_BROTHEL] courtyard. Soft morning light from the east illuminates both characters with warm golden hour quality. [CHAR_MEI] positioned screen-left foreground, facing right, carries herself with subtle newfound confidence in her posture. [CHAR_MIN_ZHU] positioned screen-right foreground, facing left, leans slightly forward with intrigue. The [PROP_WOODEN_GO_BOARD] sits center frame on the [PROP_MAHOGANY_TABLE] between them, serving as both game surface and metaphorical battlefield. Their eyes meet across the board in mutual assessment. The morning light catches both faces evenly. Polished courtyard stones and ornate pillars frame the composition, maintaining visual continuity with the established spatial relationship.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_MIN_ZHU"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": [
              "PROP_MAHOGANY_TABLE",
              "PROP_WOODEN_GO_BOARD"
            ]
          },
          "location_direction": "NORTH"
        }
      ]
    },
    {
      "scene_number": 4,
      "frame_count": 4,
      "frames": [
        {
          "frame_id": "4.2.cA",
          "scene_number": 4,
          "frame_number": 2,
          "cameras": [
            "4.2.cA"
          ],
          "camera_notation": "[4.2.cA]",
          "position_notation": "[POS: CHAR_MEI center foreground at writing desk, facing screen right toward window]",
          "lighting_notation": "[LIGHT: Natural key from latticed window screen right, harsh overhead fill, high contrast chiaroscuro with geometric shadow patterns]",
          "prompt": "Close-up of [CHAR_MEI] positioned at her writing desk in [LOC_LU_XIAN_BROTHEL], facing the latticed window (screen-right). Afternoon light streams harshly through the geometric patterns, casting sharp shadows across her face. Rain creates wet reflections on the window surface. Her brush hovers over rice paper, but her attention is drawn outside. The harsh overhead lighting creates high contrast on her features, emphasizing the longing in her expression as she watches something beyond the frame. Her silk robes catch the filtered light, creating a play of light and shadow. The rain atmosphere adds a melancholic quality to the scene, with water droplets visible on the window glass distorting the view outside.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "EAST"
        },
        {
          "frame_id": "4.4.cA",
          "scene_number": 4,
          "frame_number": 4,
          "cameras": [
            "4.4.cA"
          ],
          "camera_notation": "[4.4.cA]",
          "position_notation": "[POS: CHAR_LIN center frame ground level, CHAR_MEI implied camera position elevated]",
          "lighting_notation": "[LIGHT: Harsh overhead sunlight, minimal fill, rain creating wet reflections and light scatter]",
          "prompt": "Medium shot from [CHAR_MEI]'s window perspective in [LOC_LU_XIAN_BROTHEL], high angle looking down at [CHAR_LIN] (center frame) in his flower garden below. The harsh afternoon lighting creates minimal shadows directly beneath him as he rises from tending to flowers, brushing soil from his knees. Rain continues to fall, creating wet reflections on the ground and plant leaves. [CHAR_LIN] moves with deliberate care among the flower beds, his movements choreographed by compassion. The overhead sun position creates stark lighting conditions, emphasizing the contrast between his gentle actions and the harsh environment. Rain droplets catch the light as they fall around him.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_LIN"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "EAST"
        },
        {
          "frame_id": "4.5.cA",
          "scene_number": 4,
          "frame_number": 5,
          "cameras": [
            "4.5.cA"
          ],
          "camera_notation": "[4.5.cA]",
          "position_notation": "[POS: CHAR_MEI center foreground at writing desk]",
          "lighting_notation": "[LIGHT: Harsh natural key from screen-right window, dramatic chiaroscuro with strong shadows, atmospheric rain reflections]",
          "prompt": "Close-up of [CHAR_MEI] at her writing desk in [LOC_LU_XIAN_BROTHEL], her trembling brush now touching the rice paper. The harsh afternoon light from the window (screen-right) illuminates her profile, creating strong contrast between light and shadow. Rain continues to streak down the latticed window behind her, the wet reflections adding atmosphere to the scene. Her expression shows deep emotion as Chinese characters flow across the paper like tears. The overhead lighting creates dramatic shadows under her features, emphasizing the gravity of her decision. Her silk robes remain consistent with the previous frames, catching the filtered light. The writing implements and paper are clearly visible, showing her moment of decisive action.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "EAST"
        },
        {
          "frame_id": "4.6.cA",
          "scene_number": 4,
          "frame_number": 6,
          "cameras": [
            "4.6.cA"
          ],
          "camera_notation": "[4.6.cA]",
          "position_notation": "[POS: CHAR_MEI center frame filling entire composition]",
          "lighting_notation": "[LIGHT: Harsh natural key from overhead sun through latticed window, minimal fill, rain reflections for atmospheric depth]",
          "prompt": "Extreme close-up of [CHAR_MEI]'s face in [LOC_LU_XIAN_BROTHEL], the harsh afternoon light creating dramatic contrast across her features. Rain continues outside, visible as soft blur in the background through the latticed window. The overhead sun position creates minimal shadows, but the intensity of light emphasizes every emotion crossing her face. Her eyes reflect both determination and vulnerability as she contemplates her desperate gamble. The wet reflections from the rain add a layer of atmospheric depth, while the harsh light quality makes this moment feel pivotal and raw. Her expression captures the weight of choosing to risk everything not just for freedom, but for the chance to be cherished without price.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "EAST"
        }
      ]
    },
    {
      "scene_number": 5,
      "frame_count": 3,
      "frames": [
        {
          "frame_id": "5.1.cA",
          "scene_number": 5,
          "frame_number": 1,
          "cameras": [
            "5.1.cA"
          ],
          "camera_notation": "[5.1.cA]",
          "position_notation": "[POS: CHAR_MEI screen center foreground]",
          "lighting_notation": "[LIGHT: Hard natural key from latticed windows, high contrast shadows, minimal fill]",
          "prompt": "Medium shot of [CHAR_MEI] seated at a low wooden writing desk in her private chambers within [LOC_LU_XIAN_BROTHEL]. Late afternoon light streams harshly through latticed windows, creating high contrast shadows across the intimate space. [CHAR_MEI] wears elegant silk robes, her posture formal yet tense as she sits screen-center, oriented slightly left. Before her on the dark wooden desk lies pristine [PROP_RICE_PAPER], its white surface gleaming luminously under the harsh key light. Her delicate hand hovers over the [PROP_INKSTONE], holding a [PROP_BRUSH] that trembles slightly. Minimal shadows fall directly beneath objects. The carved wooden details of her writing alcove catch the severe afternoon light. The window behind her reveals the intimate yet exposed nature of her position.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": [
              "PROP_RICE_PAPER",
              "PROP_INKSTONE",
              "PROP_BRUSH"
            ]
          },
          "location_direction": "EAST"
        },
        {
          "frame_id": "5.2.cA",
          "scene_number": 5,
          "frame_number": 2,
          "cameras": [
            "5.2.cA"
          ],
          "camera_notation": "[5.2.cA]",
          "position_notation": "[POS: CHAR_MEI screen center, PROP_BRUSH foreground right, PROP_RICE_PAPER foreground center]",
          "lighting_notation": "[LIGHT: Harsh overhead key light, minimal fill creating high contrast, dramatic shadows emphasizing facial tension]",
          "prompt": "Close-up of [CHAR_MEI] positioned screen-center. Harsh late afternoon overhead lighting creates high contrast on her face as she pauses in her writing. Her [PROP_BRUSH] hovers frozen in foreground right above the [PROP_RICE_PAPER] in foreground center, elegant characters visible flowing across its surface. Her eyes dart toward the door of her chamber within [LOC_LU_XIAN_BROTHEL] as footsteps echo from the corridor beyond (off-screen). Fear flickers across her features - the familiar rhythm of Madame Chou's evening rounds. The severe overhead lighting emphasizes the tension in her jaw and the slight tremor in her hand. Her breathing becomes shallow, visible in the rise and fall of her [PROP_SILK_ROBES]. The footsteps continue past without stopping (off-screen). Relief washes over her face as her hand steadies, resolve crystallizing in her expression. The same harsh light that revealed her fear now illuminates her determination.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": [
              "PROP_BRUSH",
              "PROP_RICE_PAPER",
              "PROP_SILK_ROBES"
            ]
          },
          "location_direction": "EAST"
        },
        {
          "frame_id": "5.3.cA",
          "scene_number": 5,
          "frame_number": 3,
          "cameras": [
            "5.3.cA"
          ],
          "camera_notation": "[5.3.cA]",
          "position_notation": "[POS: CHAR_MEI hands center frame, PROP_LETTER cradled in palms]",
          "lighting_notation": "[LIGHT: Harsh overhead key light, minimal fill, severe directional shadows beneath hands]",
          "prompt": "Extreme close-up of [CHAR_MEI]'s hands as they hold the completed [PROP_LETTER]. The harsh late afternoon lighting creates dramatic shadows beneath her delicate fingers. The [PROP_LETTER] appears fragile and precious in her grasp, the rice paper almost translucent under the severe overhead light. Her hands cradle it with the tenderness one might hold a butterfly - delicate, beautiful, and capable of flight. The elegant calligraphy is visible through the thin paper, each character precise yet carrying emotional weight. [CHAR_MEI]'s fingertips show slight tremors from the magnitude of what she has written. The harsh lighting emphasizes the texture of the paper and the careful way she protects this vessel of her hopes and desperation. Minimal shadows fall directly beneath her hands, maintaining the scene's established lighting consistency. The letter represents everything - her gamble, her freedom, her future.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [],
            "props": [
              "PROP_LETTER"
            ]
          },
          "location_direction": "EAST"
        }
      ]
    },
    {
      "scene_number": 6,
      "frame_count": 3,
      "frames": [
        {
          "frame_id": "6.4.cA",
          "scene_number": 6,
          "frame_number": 4,
          "cameras": [
            "6.4.cA"
          ],
          "camera_notation": "[6.4.cA]",
          "position_notation": "[POS: CHAR_MEI screen left foreground on stairs, Ping screen right background at table]",
          "lighting_notation": "[LIGHT: Warm practical key from hanging lanterns, cool blue fill from windows, intimate chiaroscuro]",
          "prompt": "Medium shot establishing the servants' quarters within [LOC_LU_XIAN_BROTHEL] from the north perspective. Evening lighting with dim, warm practical light from hanging lanterns creates intimate shadows on rough-hewn walls. [CHAR_MEI] (screen-left, facing right) descends narrow wooden stairs in elegant robes, her figure contrasting against the utilitarian space. [CHAR_PING], a young servant girl (screen-right, facing left), looks up from chopping vegetables at a worn wooden table, her knife paused mid-stroke. The honest smell of cooking rice and steamed vegetables fills the air. Cool blue evening light filters through small windows, mixing with warm amber lantern glow. AXIS OF ACTION established between [CHAR_MEI] and [CHAR_PING] across the working kitchen space.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_PING"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "6.7.cA",
          "scene_number": 6,
          "frame_number": 7,
          "cameras": [
            "6.7.cA"
          ],
          "camera_notation": "[6.7.cA]",
          "position_notation": "[POS: CHAR_MEI screen left center foreground]",
          "lighting_notation": "[LIGHT: Warm amber key from lanterns camera right, soft fill from ambient evening light, cool blue rim light from exterior]",
          "prompt": "Close-up of [CHAR_MEI] (screen-left as established) in [LOC_LU_XIAN_BROTHEL], maintaining the dim evening lighting from the previous frame. Her elegant fingers tremble slightly as she watches [CHAR_PING] tuck the letter into her sleeve and hurry toward the back entrance. Warm lantern light illuminates [CHAR_MEI]'s face, revealing a mixture of hope and trepidation. The first tremor of irrevocable change crosses her features as shadows dance across her porcelain skin. Same cool blue evening ambiance with amber practical lighting creates emotional depth.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_PING"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "SOUTH"
        },
        {
          "frame_id": "6.8.cA",
          "scene_number": 6,
          "frame_number": 8,
          "cameras": [
            "6.8.cA"
          ],
          "camera_notation": "[6.8.cA]",
          "position_notation": "[POS: CHAR_MEI screen left center, angled toward background stairs]",
          "lighting_notation": "[LIGHT: Warm practical lantern key from above, cool ambient fill from right, soft rim light on silhouette]",
          "prompt": "Medium close-up of [CHAR_MEI] (screen-left, maintaining spatial relationship) in [LOC_LU_XIAN_BROTHEL]. Evening lighting continues with same dim, warm lantern glow and cool blue ambient light. [CHAR_MEI] turns slightly toward the stairs leading back to the upper chambers, her expression shifting from vulnerable hope to steeled determination. The weight of what comes next—facing her patron across a Go board—settles across her features. Rough servant quarter walls frame her delicate silhouette, emphasizing the contrast between her refined beauty and the honest working space around her.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "SOUTH"
        }
      ]
    },
    {
      "scene_number": 7,
      "frame_count": 6,
      "frames": [
        {
          "frame_id": "7.1.cA",
          "scene_number": 7,
          "frame_number": 1,
          "cameras": [
            "7.1.cA"
          ],
          "camera_notation": "[7.1.cA]",
          "position_notation": "[POS: CHAR_MEI screen left foreground, CHAR_MIN_ZHU screen right foreground, PROP_WOODEN_GO_BOARD center between characters]",
          "lighting_notation": "[LIGHT: Warm lamplight key from above, soft fill from silk screens, intimate golden atmosphere with layered shadows]",
          "prompt": "Wide establishing shot of [CHAR_MEI]'s private chambers from the north entrance. Soft, warm lamplight creates intimate shadows throughout the room. The [PROP_MAHOGANY_TABLE] gleams in the center, positioned diagonally to camera. [CHAR_MEI] (screen-left, facing right) kneels gracefully on [PROP_BAMBOO_MATS] beside the table, her silk robes pooling elegantly around her. [CHAR_MIN_ZHU] (screen-right, facing left) settles his considerable bulk onto cushions opposite her, his merchant's robes rustling. The [PROP_WOODEN_GO_BOARD] sits precisely between them like a battlefield, black and white stones arranged at the ready. Silk screens positioned strategically in the background create layered shadows. [PROP_TEA_CUP] and ceremonial tea service arranged with precision nearby. The atmosphere is serene yet charged with tension. AXIS OF ACTION established between the two players across the Go board.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_MIN_ZHU"
            ],
            "locations": [],
            "props": [
              "PROP_BAMBOO_MATS",
              "PROP_MAHOGANY_TABLE",
              "PROP_TEA_CUP",
              "PROP_WOODEN_GO_BOARD"
            ]
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "7.2.cA",
          "scene_number": 7,
          "frame_number": 2,
          "cameras": [
            "7.2.cA"
          ],
          "camera_notation": "[7.2.cA]",
          "position_notation": "[POS: CHAR_MIN_ZHU screen right, PROP_MAHOGANY_TABLE center foreground, PROP_WOODEN_GO_BOARD center]",
          "lighting_notation": "[LIGHT: Warm practical lamplight key from screen left, soft fill from silk screens, atmospheric shadows in background]",
          "prompt": "Medium shot maintaining the warm lamplight established in the previous frame. [CHAR_MIN_ZHU] (screen-right, facing left as established) surveys the prepared space with obvious pleasure, his eyes moving appreciatively around the room. His merchant's robes catch the soft light as he shifts position on his cushions. The [PROP_MAHOGANY_TABLE] and [PROP_WOODEN_GO_BOARD] remain prominently in frame between him and the camera. His expression shows satisfaction and anticipation. The 180-degree rule maintained - camera stays on same side of the Go board axis. Shadows from silk screens create depth in the background. His considerable bulk dominates the frame, emphasizing his physical presence and power in this negotiation.",
          "tags": {
            "characters": [
              "CHAR_MIN_ZHU"
            ],
            "locations": [],
            "props": [
              "PROP_MAHOGANY_TABLE",
              "PROP_WOODEN_GO_BOARD"
            ]
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "7.3.cA",
          "scene_number": 7,
          "frame_number": 3,
          "cameras": [
            "7.3.cA"
          ],
          "camera_notation": "[7.3.cA]",
          "position_notation": "[POS: CHAR_MEI screen left facing right]",
          "lighting_notation": "[LIGHT: Warm key light from lamplight, soft fill maintaining gentle shadows on facial features]",
          "prompt": "Close-up of [CHAR_MEI] positioned screen-left, facing right. Reaction shot capturing her practiced composure under warm lamplight. Her silk robes catch the soft illumination, their texture visible in the gentle light. Her expression carries honeyed modulation - the mask of years spent pleasing difficult men. Beneath the surface serenity, steel glints in her eyes; a subtle tension tightens her jaw, a slight narrowing around her eyes betrays the gravity of this moment. The warm key light from the lamp casts gentle shadows across her delicate features, with soft fill maintaining dimension while emphasizing both her beauty and the underlying strength beneath her courtesan's mask.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "7.4.cA",
          "scene_number": 7,
          "frame_number": 4,
          "cameras": [
            "7.4.cA"
          ],
          "camera_notation": "[7.4.cA]",
          "position_notation": "[POS: CHAR_MIN_ZHU screen right foreground, PROP_WOODEN_GO_BOARD center between character and camera]",
          "lighting_notation": "[LIGHT: Warm lamplight key from screen left, soft fill maintaining chiaroscuro mood, golden practical lighting]",
          "prompt": "Medium shot, slight low angle of [CHAR_MIN_ZHU] positioned screen-right, facing left as his laughter rumbles through the chamber. Warm lamplight from screen left illuminates his satisfied expression as he leans forward slightly toward the [PROP_WOODEN_GO_BOARD]. His fingers caress the white stones with proprietary satisfaction, the gesture both sensual and threatening. His merchant's robes shift as he moves, his considerable bulk seeming to expand with confidence and anticipated victory. The Go board remains between him and camera, emphasizing the battlefield nature of their negotiation. His expression shows cruel pleasure, eyes glinting with malicious satisfaction in the soft golden light. Chiaroscuro mood with soft fill lighting.",
          "tags": {
            "characters": [
              "CHAR_MIN_ZHU"
            ],
            "locations": [],
            "props": [
              "PROP_WOODEN_GO_BOARD"
            ]
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "7.5.cA",
          "scene_number": 7,
          "frame_number": 5,
          "cameras": [
            "7.5.cA"
          ],
          "camera_notation": "[7.5.cA]",
          "position_notation": "[POS: CHAR_MEI screen left facing right, isolated in frame]",
          "lighting_notation": "[LIGHT: Warm key from overhead lamp, soft fill from screen right, gentle rim lighting on hair]",
          "prompt": "Extreme close-up reaction shot of [CHAR_MEI], positioned screen-left and facing right. Her expression remains serene as mountain lakes under warm overhead lamplight, though the slightest flicker in her eyes betrays the impact of cruel words just spoken. Her face maintains perfect composure - the mask of a courtesan trained to endure any humiliation with grace. A quiet desperation mixed with hope glimmers in her gaze as she thinks of her letter to [CHAR_LIN]. Soft fill light from screen right and gentle rim lighting on her hair emphasize both her vulnerability and incredible strength. Her lips remain curved in a practiced smile even as her eyes reveal the steel beneath her silk exterior.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_LIN"
            ],
            "locations": [],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "7.6.cA",
          "scene_number": 7,
          "frame_number": 6,
          "cameras": [
            "7.6.cA"
          ],
          "camera_notation": "[7.6.cA]",
          "position_notation": "[POS: CHAR_MEI fingers center foreground, PROP_WOODEN_GO_BOARD fills frame background]",
          "lighting_notation": "[LIGHT: Warm key light from above left, soft fill to eliminate harsh shadows, intimate lamplight glow]",
          "prompt": "Extreme close-up of [CHAR_MEI]'s steady fingers as they place the first black stone on the [PROP_WOODEN_GO_BOARD]. Warm lamplight catches the smooth surface of the stone and illuminates her delicate hand. Her fingers show no tremor despite the gravity of the moment - years of training in perfect control evident in every movement. The wood grain of the [PROP_WOODEN_GO_BOARD] is visible in sharp detail, emphasizing the precision and ritual of the game's beginning. This intimate macro shot captures the pivotal action where words end and the true battle begins. Soft warm lighting creates intensity and focus on this moment that will determine her fate.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [],
            "props": [
              "PROP_WOODEN_GO_BOARD"
            ]
          },
          "location_direction": "NORTH"
        }
      ]
    },
    {
      "scene_number": 8,
      "frame_count": 2,
      "frames": [
        {
          "frame_id": "8.1.cA",
          "scene_number": 8,
          "frame_number": 1,
          "cameras": [
            "8.1.cA"
          ],
          "camera_notation": "[8.1.cA]",
          "position_notation": "[POS: CHAR_MEI screen left foreground, CHAR_MIN_ZHU screen right foreground]",
          "lighting_notation": "[LIGHT: Warm lantern key light from above, soft fill from window reflections, atmospheric rain shadows]",
          "prompt": "Medium shot of [LOC_LU_XIAN_BROTHEL] private chamber interior from the north entrance. Rain patters against wooden shutters, creating wet reflections on the polished [PROP_MAHOGANY_TABLE]. Warm lantern light flickers across the scene, casting dancing shadows on carved wooden walls. [CHAR_MEI] (screen-left, facing right) kneels on [PROP_BAMBOO_MATS] in her elegant blue silk robes, studying the [PROP_WOODEN_GO_BOARD] with growing concern. [CHAR_MIN_ZHU] (screen-right, facing left) sits opposite her, his white stones dominating the center of the board while her black stones cluster desperately at the edges. The constellation of fallen stones tells a story of strategic defeat. Raindrops streak down window panes, adding atmosphere to the tense moment. AXIS OF ACTION established between the two players across the game board.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_MIN_ZHU"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": [
              "PROP_BAMBOO_MATS",
              "PROP_MAHOGANY_TABLE",
              "PROP_WOODEN_GO_BOARD"
            ]
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "8.2.cA",
          "scene_number": 8,
          "frame_number": 2,
          "cameras": [
            "8.2.cA"
          ],
          "camera_notation": "[8.2.cA]",
          "position_notation": "[POS: CHAR_MEI center foreground, leaning forward toward camera]",
          "lighting_notation": "[LIGHT: Warm lantern key light from above left, soft fill from rain reflections, intimate golden atmosphere with wet surface highlights]",
          "prompt": "Close-up of [CHAR_MEI] in warm lantern light with rain atmosphere. She leans forward gracefully toward camera, her [PROP_HAIR_RIBBON] slipping free with practiced accident. Dark hair cascades over her shoulder as she pours tea into the [PROP_TEA_CUP]. Her silk-clad form moves with calculated sensuality within [LOC_LU_XIAN_BROTHEL]'s intimate chamber. Wet reflections shimmer on surfaces around her. The frame captures her desperate elegance employing the oldest tricks of the pleasure quarter, trembling fingers betraying inner turmoil despite outward composure. Warm golden key light from above left, soft fill from rain reflections on wet surfaces.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": [
              "PROP_HAIR_RIBBON",
              "PROP_TEA_CUP"
            ]
          },
          "location_direction": "NORTH"
        }
      ]
    },
    {
      "scene_number": 9,
      "frame_count": 4,
      "frames": [
        {
          "frame_id": "9.2.cA",
          "scene_number": 9,
          "frame_number": 2,
          "cameras": [
            "9.2.cA"
          ],
          "camera_notation": "[9.2.cA]",
          "position_notation": "[POS: CHAR_LIN center in doorway, servant girl screen left foreground, LOC_LU_XIAN_BROTHEL_DIR_W screen right background]",
          "lighting_notation": "[LIGHT: Chiaroscuro, warm key from PROP_LANTERN inside shop, cool moonlight fill, red lantern practicals in background]",
          "prompt": "Medium shot of [CHAR_LIN] standing in his flower shop doorway, viewed from the north. Evening lighting with cool blue ambient tones. The [PROP_LANTERN] in his shop casts warm golden light on his weathered face as he faces screen-right toward his door. A nervous servant girl (screen-left) approaches from the shadows, her eyes darting toward the glowing windows of [LOC_LU_XIAN_BROTHEL] visible in the background to the west. She extends a folded letter toward [CHAR_LIN] with trembling hands. The contrast between the warm lamplight and cool moonlight creates dramatic chiaroscuro. Soil still clings to [CHAR_LIN]'s fingernails from his day's work. The brothel's red lanterns create distant warm spots of light against the predominantly cool evening palette.",
          "tags": {
            "characters": [
              "CHAR_LIN"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": [
              "PROP_LANTERN"
            ]
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "9.4.cA",
          "scene_number": 9,
          "frame_number": 4,
          "cameras": [
            "9.4.cA"
          ],
          "camera_notation": "[9.4.cA]",
          "position_notation": "[POS: CHAR_LIN hands center foreground, PROP_LANTERN screen left background]",
          "lighting_notation": "[LIGHT: Warm key from lantern screen left, soft fill on paper, golden rim light on fingertips]",
          "prompt": "Extreme close-up of [CHAR_LIN]'s weathered hands unfolding rice paper with reverent care. The [PROP_LANTERN]'s warm golden glow from screen left illuminates the elegant brushwork on the letter, each character seeming to shimmer in the flickering light. He holds the delicate paper like he would handle fragile seedlings. The warm lamplight creates golden rim highlights on his fingertips while cool blue ambient evening light provides contrast. Soil beneath his fingernails emphasizes his humble station against the letter's obvious refinement. The paper trembles slightly in his gentle grasp, the refined calligraphy visible on the illuminated surface.",
          "tags": {
            "characters": [
              "CHAR_LIN"
            ],
            "locations": [],
            "props": [
              "PROP_LANTERN"
            ]
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "9.7.cA",
          "scene_number": 9,
          "frame_number": 7,
          "cameras": [
            "9.7.cA"
          ],
          "camera_notation": "[9.7.cA]",
          "position_notation": "[POS: CHAR_LIN screen right foreground in shop window, LOC_LU_XIAN_BROTHEL screen left dominating frame]",
          "lighting_notation": "[LIGHT: Practical lighting from lanterns, warm golden spill from brothel windows, cool blue moonlight on road, chiaroscuro contrast between intimate shop glow and grand brothel illumination]",
          "prompt": "Wide establishing shot maintaining evening lighting from north perspective. [CHAR_LIN] (screen-right) stands silhouetted in his modest shop window, the [PROP_LANTERN] creating a warm pool of light around him. The magnificent [LOC_LU_XIAN_BROTHEL] dominates the left side of frame, blazing with countless red paper lanterns and warm golden light spilling from multiple windows across its three-story structure. The contrast is stark - his simple flower shop versus the opulent pleasure house. Cool blue moonlight bathes the pressed dirt road between them. The brothel's curved rooflines and ornate pillars are dramatically lit against the night sky. [CHAR_LIN] appears small and humble against the brothel's imposing grandeur, the juxtaposition of scales emphasizing the divide between their worlds.",
          "tags": {
            "characters": [
              "CHAR_LIN"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": [
              "PROP_LANTERN"
            ]
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "9.8.cA",
          "scene_number": 9,
          "frame_number": 8,
          "cameras": [
            "9.8.cA"
          ],
          "camera_notation": "[9.8.cA]",
          "position_notation": "[POS: CHAR_LIN center screen-right]",
          "lighting_notation": "[LIGHT: Key from screen left lantern, warm golden fill on face, cool blue ambient background]",
          "prompt": "Medium close-up of [CHAR_LIN] (screen-right as established) pressing the letter against his chest with both hands, his heart visibly pounding beneath his simple work clothes. The [PROP_LANTERN]'s warm golden light illuminates his face from the left, showing wonder and unfamiliar urgency in his expression. Evening lighting remains consistent with cool blue ambient tones. His weathered features are softened by the lamplight, revealing vulnerability beneath his humble exterior. The letter crinkles slightly against his chest as his breathing quickens. Soil-stained fingertips contrast with the delicate rice paper. His eyes reflect the flickering flame, showing a man transformed by unexpected hope and connection to someone beyond his simple world.",
          "tags": {
            "characters": [
              "CHAR_LIN"
            ],
            "locations": [],
            "props": [
              "PROP_LANTERN"
            ]
          },
          "location_direction": "NORTH"
        }
      ]
    },
    {
      "scene_number": 10,
      "frame_count": 6,
      "frames": [
        {
          "frame_id": "10.1.cA",
          "scene_number": 10,
          "frame_number": 1,
          "cameras": [
            "10.1.cA"
          ],
          "camera_notation": "[10.1.cA]",
          "position_notation": "[POS: CHAR_MEI fingers screen left edge foreground, PROP_WOODEN_GO_BOARD center, PROP_SILK_POUCH screen right]",
          "lighting_notation": "[LIGHT: Soft ambient from rain-diffused windows, key light reflecting off polished wood surface, humid atmospheric haze]",
          "prompt": "Extreme close-up of the [PROP_WOODEN_GO_BOARD] on the [PROP_MAHOGANY_TABLE], shot from directly overhead with macro lens. Rain-wet atmosphere creates a humid, oppressive mood with soft reflective lighting on the polished wood surface. The final white Go stone clicks into place with finality. [CHAR_MEI]'s delicate fingers visible at screen-left edge of frame, releasing the black stone she just played. The board shows a constellation of defeat - white stones systematically strangling scattered black territories. A [PROP_SILK_POUCH] containing her life savings sits beside the board at screen-right, suddenly worthless. Rain patters against windows off-screen, creating wet reflective ambiance throughout the chamber.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [],
            "props": [
              "PROP_MAHOGANY_TABLE",
              "PROP_WOODEN_GO_BOARD",
              "PROP_SILK_POUCH"
            ]
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "10.2.cA",
          "scene_number": 10,
          "frame_number": 2,
          "cameras": [
            "10.2.cA"
          ],
          "camera_notation": "[10.2.cA]",
          "position_notation": "[POS: CHAR_MEI screen left foreground, CHAR_MIN_ZHU screen right background against cushions]",
          "lighting_notation": "[LIGHT: Rain-diffused natural light, key from window, wet reflective highlights on mahogany table surface]",
          "prompt": "Medium shot maintaining the rain-wet atmospheric lighting from the previous frame. [CHAR_MIN_ZHU] (screen-right background, facing left) leans back against [PROP_SILK_CUSHIONS] on [PROP_BAMBOO_MATS], his expression thick with satisfaction. [CHAR_MEI] (screen-left foreground, facing right) sits composed across the [PROP_MAHOGANY_TABLE], her training holding her posture intact despite inner devastation. His fingers drum against the polished mahogany surface with predatory deliberation. Rain-diffused natural light from the window creates wet reflective highlights that gleam off the table's surface. Camera maintains position on north side of their axis of action, preserving the established 180-degree rule.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_MIN_ZHU"
            ],
            "locations": [],
            "props": [
              "PROP_BAMBOO_MATS",
              "PROP_MAHOGANY_TABLE",
              "PROP_SILK_CUSHIONS"
            ]
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "10.3.cA",
          "scene_number": 10,
          "frame_number": 3,
          "cameras": [
            "10.3.cA"
          ],
          "camera_notation": "[10.3.cA]",
          "position_notation": "[POS: CHAR_MEI center frame]",
          "lighting_notation": "[LIGHT: Rain-wet reflective lighting, key from west window, melancholy atmosphere with surface reflections]",
          "prompt": "Wide shot of [CHAR_MEI] in her private chambers within [LOC_LU_XIAN_BROTHEL], camera facing west toward the window. Rain-wet reflective lighting with key light from the west window creates a melancholy atmosphere with surface reflections throughout. [CHAR_MEI] positioned center frame, maintaining her folded hands and composed posture despite her crumbling world. Through the rain-streaked chamber window, glimpses of darkened buildings across the street are visible in the wet night. The opulent chamber surrounds her with rich fabrics and carved wooden details, rain creating melancholy reflections on every polished surface. Her silk robes remain unchanged from previous frames, maintaining visual continuity. Eye level, static camera, 35mm lens.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "WEST"
        },
        {
          "frame_id": "10.4.cA",
          "scene_number": 10,
          "frame_number": 4,
          "cameras": [
            "10.4.cA"
          ],
          "camera_notation": "[10.4.cA]",
          "position_notation": "[POS: CHAR_MEI screen left facing right, PROP_MAHOGANY_TABLE center]",
          "lighting_notation": "[LIGHT: Soft natural key from north windows, wet reflective highlights on table surface, atmospheric rain diffusion]",
          "prompt": "Medium shot, eye level, static, 50mm lens. [CHAR_MEI] positioned screen-left facing right, speaking with quiet dignity, her voice steady despite internal devastation. Silk robes and composed posture maintained. The [PROP_MAHOGANY_TABLE] gleams with wet reflective highlights at center frame between characters. Soft natural key light from north windows creates atmospheric rain diffusion throughout. Rain patters against windows, creating oppressive humid atmosphere in the chamber. Camera maintains 180-degree rule, staying on established side of character axis.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [],
            "props": [
              "PROP_MAHOGANY_TABLE"
            ]
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "10.5.cA",
          "scene_number": 10,
          "frame_number": 5,
          "cameras": [
            "10.5.cA"
          ],
          "camera_notation": "[10.5.cA]",
          "position_notation": "[POS: CHAR_MIN_ZHU screen right facing left]",
          "lighting_notation": "[LIGHT: Rain-wet reflective key lighting, atmospheric fill from humid chamber, predatory eye gleam highlights]",
          "prompt": "Close-up reaction shot of [CHAR_MIN_ZHU] positioned screen-right, facing left. His cruel laugh rumbles visibly in his expression. Rain-wet reflective lighting gleams across his features, catching predatory glitter in his eyes that shine with malicious amusement. The humid, oppressive atmosphere creates soft wet reflections on his skin. His expression reveals calculating appraisal - the look of a merchant evaluating exquisite property to be owned. Slight low angle emphasizes his threatening presence. 85mm lens compression isolates his menacing features against the rain-soaked chamber atmosphere.",
          "tags": {
            "characters": [
              "CHAR_MIN_ZHU"
            ],
            "locations": [],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "10.6.cA",
          "scene_number": 10,
          "frame_number": 6,
          "cameras": [
            "10.6.cA"
          ],
          "camera_notation": "[10.6.cA]",
          "position_notation": "[POS: CHAR_MEI screen left facing right, isolated in frame]",
          "lighting_notation": "[LIGHT: Soft atmospheric key from above, rain-diffused fill, wet surface reflections as practicals]",
          "prompt": "Extreme close-up of [CHAR_MEI], positioned screen-left and facing right, her face isolated in intimate telephoto framing. Soft atmospheric lighting from above creates gentle highlights on her rain-dampened skin, the humid atmosphere visible in the wet reflections gleaming across her features. Her expression captures the precise moment of quiet devastation - the subtle shift from composed dignity as her last hope extinguishes. The 135mm compression flattens the background into soft abstraction, focusing all attention on this moment of internal collapse. The oppressive, perfumed atmosphere reaches its emotional climax in her eyes.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [],
            "props": []
          },
          "location_direction": "NORTH"
        }
      ]
    },
    {
      "scene_number": 11,
      "frame_count": 4,
      "frames": [
        {
          "frame_id": "11.2.cA",
          "scene_number": 11,
          "frame_number": 2,
          "cameras": [
            "11.2.cA"
          ],
          "camera_notation": "[11.2.cA]",
          "position_notation": "[POS: CHAR_LIN center foreground]",
          "lighting_notation": "[LIGHT: Moody evening mix, cool moonlight key from above, warm amber fill from brothel windows, wet surface reflections]",
          "prompt": "Medium shot of [CHAR_LIN] standing on the rain-slicked [LOC_PRESSED_DIRT_ROAD], viewed from the north. Evening lighting creates dim, moody atmosphere with wet reflections gleaming on the packed earth surface. Rain continues to fall, creating a misty haze in the cool air. [CHAR_LIN] (center frame) clutches a crumpled letter in his calloused hands, his simple work clothes darkened by moisture. Behind him, his modest flower shop sits in shadow. Across the narrow street, warm golden light spills from the ornate windows of the towering [LOC_LU_XIAN_BROTHEL], its three-story structure looming with carved wooden galleries and red pillars barely visible through the rain. The contrast between the humble flower shop and opulent brothel establishes the gulf between their worlds. Moon's pale light filters through rain clouds, mixing cool blue tones with warm amber glow from the brothel windows. [CHAR_LIN]'s face shows nervous anticipation as he stares up at the pleasure house, his breath visible in the cool night air.",
          "tags": {
            "characters": [
              "CHAR_LIN"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL",
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "11.3.cA",
          "scene_number": 11,
          "frame_number": 3,
          "cameras": [
            "11.3.cA"
          ],
          "camera_notation": "[11.3.cA]",
          "position_notation": "[POS: CHAR_LIN screen left foreground near flower shop, CHAR_MEI screen right mid-ground descending brothel stairs]",
          "lighting_notation": "[LIGHT: Cool blue moonlight key from above, warm amber fill from brothel windows, atmospheric rain haze diffusion]",
          "prompt": "Wide establishing shot of the narrow [LOC_PRESSED_DIRT_ROAD] from the north perspective, maintaining the evening rain atmosphere and dim lighting established previously. The wet dirt road gleams with reflections from the [LOC_LU_XIAN_BROTHEL]'s warm window light. [CHAR_MEI] emerges from a discrete side entrance of the brothel (screen-right), her silk robes flowing like liquid shadow as she descends wooden stairs. Her elegant movement contrasts with the rough environment. [CHAR_LIN] (screen-left) remains positioned near his flower shop, still clutching the letter, now turning his attention toward the approaching figure. The spatial relationship establishes the axis of action between them across the narrow street. Rain continues to create atmospheric haze, with cool blue moonlight mixing with warm amber brothel lighting. [CHAR_MEI]'s porcelain-pale face is barely visible in the dim light, but her graceful descent down the stairs shows the trained precision of her movements. The towering brothel structure frames the right side with its ornate architecture and glowing windows.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_LIN"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL",
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "11.4.cA",
          "scene_number": 11,
          "frame_number": 4,
          "cameras": [
            "11.4.cA"
          ],
          "camera_notation": "[11.4.cA]",
          "position_notation": "[POS: CHAR_MEI screen right foreground, CHAR_LIN screen left background]",
          "lighting_notation": "[LIGHT: Cool blue moonlight key from above, warm amber rim light from brothel windows behind, atmospheric rain diffusion]",
          "prompt": "Medium two-shot maintaining the evening rain atmosphere and dim lighting continuity. [CHAR_MEI] (screen-right) has reached the bottom of the stairs, pausing on the wet [LOC_PRESSED_DIRT_ROAD]. Her silk robes cling slightly from the moisture, and her breath creates visible vapor in the cool night air. [CHAR_LIN] (screen-left) stands across the narrow distance, the crumpled letter still in his hands. Both characters face each other, maintaining the established spatial relationship and axis of action. The rain creates a misty curtain between them, with cool blue moonlight illuminating [CHAR_MEI]'s porcelain-pale face while warm amber light from the brothel windows behind her creates a subtle rim light on her silhouette. [CHAR_LIN]'s weathered features show protective instinct as he observes her vulnerability beneath her trained composure. The wet dirt road reflects the mixed lighting, creating an intimate pocket of space despite the gulf between their social worlds. Both characters' expressions convey the wonder and uncertainty of this clandestine meeting.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_LIN"
            ],
            "locations": [
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "WEST"
        },
        {
          "frame_id": "11.7.cA",
          "scene_number": 11,
          "frame_number": 7,
          "cameras": [
            "11.7.cA"
          ],
          "camera_notation": "[11.7.cA]",
          "position_notation": "[POS: CHAR_LIN's hands screen left, CHAR_MEI's hands screen right center, intertwined in foreground]",
          "lighting_notation": "[LIGHT: Mixed practical lighting, cool blue moonlight key from above, warm amber fill from brothel windows, rim lighting on skin texture]",
          "prompt": "Extreme close-up of intertwined hands on the rain-dampened [LOC_PRESSED_DIRT_ROAD], shot from slightly above with a macro lens. [CHAR_LIN]'s dirt-stained, calloused fingers gently hold [CHAR_MEI]'s silk-soft palms, creating a powerful visual contrast between their worlds. The texture difference between his honest working hands and her pampered skin is clearly visible. Cool blue moonlight from above mixes with warm amber glow from nearby brothel windows, creating subtle rim lighting on their joined hands. Rain droplets glisten on their skin as [CHAR_LIN]'s thumbs trace gentle circles across her knuckles in a gesture of comfort. The wet dirt surface of the road fills the soft-focus background, maintaining attention on this intimate connection. The lighting emphasizes the vulnerability and trust in this moment - two people from vastly different social stations finding common ground through simple human touch.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_LIN"
            ],
            "locations": [
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "WEST"
        }
      ]
    },
    {
      "scene_number": 12,
      "frame_count": 8,
      "frames": [
        {
          "frame_id": "12.1.cA",
          "scene_number": 12,
          "frame_number": 1,
          "cameras": [
            "12.1.cA"
          ],
          "camera_notation": "[12.1.cA]",
          "position_notation": "[POS: CHAR_MEI screen left facing right, CHAR_LIN screen right facing left, joined hands center frame]",
          "lighting_notation": "[LIGHT: Soft overcast key from above, eastern rim light through clouds, wet ground reflections as fill]",
          "prompt": "Medium shot establishing the narrow [LOC_PRESSED_DIRT_ROAD] between buildings in morning rain. Soft eastern light filters through overcast sky, creating gentle wet reflections on the packed earth. [CHAR_MEI] (screen-left, facing right) stands close to [CHAR_LIN] (screen-right, facing left), their hands intertwined between them. Rain dampens her silk robes and his simple merchant clothes. The axis of action runs between their joined hands at center frame. Morning mist rises from the wet ground as [CHAR_LIN]'s calloused fingers trace her delicate wrists with tender reverence. The warm light catches droplets on their skin, creating an intimate atmosphere despite the dreary weather. Both characters lean slightly toward each other, suggesting fragile hope and connection in the quiet morning moment.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_LIN"
            ],
            "locations": [
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "12.2.cA",
          "scene_number": 12,
          "frame_number": 2,
          "cameras": [
            "12.2.cA"
          ],
          "camera_notation": "[12.2.cA]",
          "position_notation": "[POS: CHAR_MEI screen left foreground]",
          "lighting_notation": "[LIGHT: Soft natural key from east, diffused by overcast, rain creates subtle rim lighting on face]",
          "prompt": "Close-up of [CHAR_MEI] positioned screen-left in continuing morning rain on [LOC_PRESSED_DIRT_ROAD]. Soft eastern light illuminates her face, now etched with vulnerability and desperation. Her voice breaks as she speaks of being sold and bound by contracts. Raindrops cling to her eyelashes and trace down her cheeks, mingling with unshed tears. Wet reflections on the road surface maintain the melancholic atmosphere. Her expression shows practiced composure cracking to reveal the frightened woman beneath - the weight of her circumstances visible in every feature. 85mm lens creates intimate compression, static frame holding on her emotional revelation.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "12.3.cA",
          "scene_number": 12,
          "frame_number": 3,
          "cameras": [
            "12.3.cA"
          ],
          "camera_notation": "[12.3.cA]",
          "position_notation": "[POS: CHAR_LIN screen right facing left, CHAR_MEI screen left, joined hands center frame]",
          "lighting_notation": "[LIGHT: Soft eastern morning light, diffused by rain clouds, wet reflections on packed earth]",
          "prompt": "Medium shot on [LOC_PRESSED_DIRT_ROAD]. [CHAR_LIN] positioned screen-right, facing left, speaks with quiet determination, hands trembling slightly. Simple but clean merchant clothes. [CHAR_MEI] screen-left, listening with desperate hope, wearing elegant silk robes. Their joined hands visible at center frame. Soft eastern morning light diffused by rain clouds, wet reflections on packed earth. Light rain continues falling. Both characters close together, the fragile connection between them palpable as he offers an impossible dream of freedom.",
          "tags": {
            "characters": [
              "CHAR_LIN",
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "12.4.cA",
          "scene_number": 12,
          "frame_number": 4,
          "cameras": [
            "12.4.cA"
          ],
          "camera_notation": "[12.4.cA]",
          "position_notation": "[POS: CHAR_MEI foreground screen left, CHAR_LIN foreground screen right, CHAR_MIN_ZHU background center emerging from doorway]",
          "lighting_notation": "[LIGHT: Soft morning eastern light, wet stone reflections as fill, overcast diffusion creating vulnerable atmosphere]",
          "prompt": "Wide establishing shot of [LOC_LU_XIAN_BROTHEL] looming behind the narrow [LOC_PRESSED_DIRT_ROAD]. [CHAR_MIN_ZHU] emerges from the servants' entrance in background center, his imposing bulk filling the doorway. [CHAR_MEI] positioned foreground screen-left and [CHAR_LIN] foreground screen-right appear small and vulnerable against the brothel's ornate three-story architecture with its carved galleries and red pillars. Morning rain continues falling, soft eastern light creating wet reflections on stone walls and packed earth. Min Zhu's merchant robes rustle as he advances, morning light catching the cruel satisfaction in his eyes as he surveys his 'property' with predatory focus. Heavy footsteps echo against wet stone. Slight low angle emphasizes the brothel's imposing scale and the power dynamic between the looming establishment and the two small figures.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_LIN",
              "CHAR_MIN_ZHU"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL",
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "12.5.cA",
          "scene_number": 12,
          "frame_number": 5,
          "cameras": [
            "12.5.cA"
          ],
          "camera_notation": "[12.5.cA]",
          "position_notation": "[POS: CHAR_LIN screen right foreground, CHAR_MEI screen left mid-ground, CHAR_MIN_ZHU center background]",
          "lighting_notation": "[LIGHT: Soft overcast morning light, eastern key light diffused by rain clouds, wet surfaces creating subtle reflections]",
          "prompt": "Medium shot on [LOC_PRESSED_DIRT_ROAD] as tension escalates in the continuing morning rain. [CHAR_LIN] (screen-right foreground) steps protectively forward, placing his body between [CHAR_MEI] (screen-left mid-ground) and the approaching [CHAR_MIN_ZHU] (center background). The florist's gentle nature contrasts with unexpected steel as he defends her, though fear trembles through his frame. [CHAR_MEI] tries to pull free but [CHAR_LIN]'s fingers tighten protectively around hers. Soft overcast morning light from the east diffuses through rain clouds, wet surfaces creating subtle reflections. [CHAR_MIN_ZHU]'s bulk advances closer, his merchant robes dark against the morning mist. [CHAR_LIN]'s quiet courage shows in his posture despite being no match for the wealthy merchant's power and influence.",
          "tags": {
            "characters": [
              "CHAR_LIN",
              "CHAR_MEI",
              "CHAR_MIN_ZHU"
            ],
            "locations": [
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "12.6.cA",
          "scene_number": 12,
          "frame_number": 6,
          "cameras": [
            "12.6.cA"
          ],
          "camera_notation": "[12.6.cA]",
          "position_notation": "[POS: CHAR_MEI screen left foreground]",
          "lighting_notation": "[LIGHT: Soft eastern morning light, natural fill from overcast sky, atmospheric rain reflections]",
          "prompt": "Close-up of [CHAR_MEI] positioned screen-left on rain-wet [LOC_PRESSED_DIRT_ROAD]. Soft eastern morning light catches the terrible realization in her eyes as she understands the danger she has brought to [CHAR_LIN]. Her expression shows the weight of dragging this gentle soul into her ruin. Rain continues to dampen her silk robes while atmospheric wet reflections play across the scene. Her face reveals internal conflict - the trained courtesan's composure warring with genuine fear for [CHAR_LIN]'s safety. The subtle shift in her features suggests she feels his grip falter slightly behind her.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_LIN"
            ],
            "locations": [
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "12.7.cA",
          "scene_number": 12,
          "frame_number": 7,
          "cameras": [
            "12.7.cA"
          ],
          "camera_notation": "[12.7.cA]",
          "position_notation": "[POS: CHAR_MEI screen left, CHAR_LIN screen right]",
          "lighting_notation": "[LIGHT: Soft natural key from east, diffused by overcast sky, wet ground reflections as fill]",
          "prompt": "Medium shot on [LOC_PRESSED_DIRT_ROAD] with [CHAR_MEI] positioned screen-left and [CHAR_LIN] screen-right. [CHAR_MEI] straightens into the practiced grace instilled by [CHAR_MADAME_CHOU]'s training, her posture shifting from vulnerable woman to resigned courtesan. Morning rain continues falling as soft eastern light diffuses through overcast sky, creating wet reflections on the packed earth. Her dampened silk robes flow with renewed elegance as she adopts a posture of submission, whispering urgently to [CHAR_LIN]. Her expression conveys desperate urgency mixed with sacrifice, the transformation visible in her bearing as she prepares to send him away to protect his safety.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_LIN",
              "CHAR_MADAME_CHOU"
            ],
            "locations": [
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "12.8.cA",
          "scene_number": 12,
          "frame_number": 8,
          "cameras": [
            "12.8.cA"
          ],
          "camera_notation": "[12.8.cA]",
          "position_notation": "[POS: CHAR_LIN center foreground, CHAR_MEI implied screen right via hands, CHAR_MIN_ZHU off-camera]",
          "lighting_notation": "[LIGHT: Soft eastern morning key light, atmospheric rain diffusion, wet surface reflections as fill]",
          "prompt": "Close-up of [CHAR_LIN] on the rain-soaked [LOC_PRESSED_DIRT_ROAD]. His calloused hands remain steady, clasping [CHAR_MEI]'s hands at the edge of frame right. Soft eastern morning light illuminates the quiet determination in his weathered face, rain beads catching the glow on his simple merchant clothes. Wet atmospheric reflections diffuse the light across the scene. His expression shows no retreat—gentle nature transformed into unexpected steel as he faces off-camera toward the unseen threat. The florist who battles aphids and drought has found resolve within himself, his hands that nurture fragile seedlings now protecting something infinitely more precious with the same tender reverence.",
          "tags": {
            "characters": [
              "CHAR_LIN",
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        }
      ]
    },
    {
      "scene_number": 13,
      "frame_count": 8,
      "frames": [
        {
          "frame_id": "13.1.cA",
          "scene_number": 13,
          "frame_number": 1,
          "cameras": [
            "13.1.cA"
          ],
          "camera_notation": "[13.1.cA]",
          "position_notation": "[POS: CHAR_MEI screen left foreground, CHAR_LIN center-left, CHAR_MIN_ZHU center-right, CHAR_MADAME_CHOU screen right background at brothel entrance]",
          "lighting_notation": "[LIGHT: Golden hour chiaroscuro, key light from eastern sunrise breaking through storm clouds, dramatic westward shadows across dirt road, paper lanterns providing warm fill]",
          "prompt": "Wide establishing shot of [LOC_PRESSED_DIRT_ROAD] between [LOC_LU_XIAN_BROTHEL] and Lin's flower shop. Storm clouds overhead with sunrise lighting breaking through from the east, casting long golden shadows westward across the dirt road. [CHAR_MADAME_CHOU] emerges from the ornate entrance of [LOC_LU_XIAN_BROTHEL] (screen-right background), her silk robes catching the hazy morning light. [CHAR_MEI] (screen-left foreground) stands with [CHAR_LIN] (center-left), while [CHAR_MIN_ZHU] (center-right) faces them in confrontation. The merchant's bulk dominates the middle ground. Tense standoff atmosphere with golden sunrise light filtering through storm clouds, creating dramatic chiaroscuro lighting across the narrow street. Paper lanterns from the brothel sway in the storm wind. AXIS OF ACTION established between the confronting parties across the width of the road.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_LIN",
              "CHAR_MIN_ZHU",
              "CHAR_MADAME_CHOU"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL",
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "13.2.cA",
          "scene_number": 13,
          "frame_number": 2,
          "cameras": [
            "13.2.cA"
          ],
          "camera_notation": "[13.2.cA]",
          "position_notation": "[POS: CHAR_MADAME_CHOU screen right foreground, CHAR_MIN_ZHU screen left background]",
          "lighting_notation": "[LIGHT: Golden hour key from east, soft fill, warm highlights on silk and carved details]",
          "prompt": "Medium shot maintaining the golden sunrise lighting from the east. [CHAR_MADAME_CHOU] (screen-right foreground) steps forward from [LOC_LU_XIAN_BROTHEL]'s entrance, her weathered face impassive yet commanding in the soft morning light. [CHAR_MIN_ZHU] (screen-left background, facing right) shifts his considerable bulk with obvious irritation, his merchant robes rustling. The storm continues overhead but sunrise light creates warm highlights on both characters. Madame Chou's silk robes catch the golden light as she surveys the scene with decades of authority. The ornate red pillars and carved wooden galleries of the brothel frame the background. 180-degree rule maintained - camera stays on established side of the confrontation axis. Hazy morning atmosphere softens the tension while emphasizing the power dynamic between the small but authoritative Madame and the hulking merchant.",
          "tags": {
            "characters": [
              "CHAR_MADAME_CHOU",
              "CHAR_MIN_ZHU"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "13.3.cA",
          "scene_number": 13,
          "frame_number": 3,
          "cameras": [
            "13.3.cA"
          ],
          "camera_notation": "[13.3.cA]",
          "position_notation": "[POS: CHAR_MADAME_CHOU screen right facing left, LOC_LU_XIAN_BROTHEL galleries background soft focus]",
          "lighting_notation": "[LIGHT: Golden sunrise key from east, soft fill on weathered features, warm ethereal rim light contrasting stormy atmosphere]",
          "prompt": "Close-up of [CHAR_MADAME_CHOU] positioned screen-right, facing left. Golden sunrise lighting from the east creates soft shadows on her weathered features. Her small frame radiates quiet authority, eyes holding decades of wisdom mixed with unexpected weariness. Warm morning light highlights maternal concern breaking through her composed business mask. Behind her in soft focus, the ornate carved wooden galleries of [LOC_LU_XIAN_BROTHEL] with their intricate details. Her silk robes catch the golden light, fabric shifting subtly as she steps forward. The warm, almost ethereal sunrise lighting contrasts with the hazy stormy atmosphere visible above, casting her in a luminous glow. Slow push-in captures the weight of her pivotal decision, building emotional intensity as determination settles across her weathered face.",
          "tags": {
            "characters": [
              "CHAR_MADAME_CHOU"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "13.4.cA",
          "scene_number": 13,
          "frame_number": 4,
          "cameras": [
            "13.4.cA"
          ],
          "camera_notation": "[13.4.cA]",
          "position_notation": "[POS: CHAR_LIN center-left foreground, CHAR_MEI screen left foreground, merchant screen right background soft focus]",
          "lighting_notation": "[LIGHT: Golden hour key from east, warm fill on faces, dramatic contrast with storm clouds above]",
          "prompt": "Medium shot of [CHAR_LIN] (center-left, facing right) and [CHAR_MEI] (screen-left, facing right) on [LOC_PRESSED_DIRT_ROAD]. Golden sunrise lighting from the east casts long shadows westward across the packed dirt surface. Lin's grip tightens on Mei's hands as understanding dawns - his calloused fingers intertwined with hers. Storm clouds above create dramatic contrast with the warm morning light illuminating their faces. Lin's simple clothing and honest demeanor visible, with the merchant's bulk in soft focus background screen-right. Narrow street between buildings frames the intimate moment. Hazy morning atmosphere softens the scene. Their body language conveys the magnitude of his offer - every saved coin from his flower shop, his life's work offered for love. 50mm lens, eye level, static frame.",
          "tags": {
            "characters": [
              "CHAR_LIN",
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "13.5.cA",
          "scene_number": 13,
          "frame_number": 5,
          "cameras": [
            "13.5.cA"
          ],
          "camera_notation": "[13.5.cA]",
          "position_notation": "[POS: CHAR_MEI screen-left facing right, foreground dominant]",
          "lighting_notation": "[LIGHT: Golden hour key from east, soft fill from hazy atmosphere, rim lighting creating halo effect]",
          "prompt": "Close-up of [CHAR_MEI] (screen-left, facing right) on [LOC_PRESSED_DIRT_ROAD]. Golden sunrise lighting from the east illuminates her face with soft, warm highlights, creating a halo effect through the hazy morning atmosphere. Her expression shows wonder and terror breaking across her delicate features - eyes wide with disbelief, tears beginning to form and catch the golden light. The packed dirt road visible in soft focus below, worn by countless feet. Stormy sky diffused in the background while intimate portrait lighting emphasizes her emotional transformation. The golden light creates an almost ethereal glow around her face, highlighting this pivotal moment of realization.",
          "tags": {
            "characters": [
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "13.6.cA",
          "scene_number": 13,
          "frame_number": 6,
          "cameras": [
            "13.6.cA"
          ],
          "camera_notation": "[13.6.cA]",
          "position_notation": "[POS: CHAR_LIN center-right foreground, CHAR_MEI center-left foreground]",
          "lighting_notation": "[LIGHT: Golden hour key from east, soft fill bounce, atmospheric haze diffusion]",
          "prompt": "Extreme close-up of [CHAR_LIN] and [CHAR_MEI] on [LOC_PRESSED_DIRT_ROAD]. Golden sunrise lighting from the east creates warm, soft illumination on both faces. Lin's calloused, weathered hands frame Mei's delicate porcelain features with infinite tenderness. Hazy morning atmosphere from the storm creates an ethereal quality around them. Lin (center-right, facing left) gazes into Mei's eyes (center-left, facing right) with profound love and certainty. His thumb traces her cheek as sunrise light catches the moisture of her tears. The narrow street setting fades into soft bokeh, isolating this moment of pure connection. Storm clouds overhead contrast with the warm golden light illuminating their faces. The lighting emphasizes the sincerity of his declaration - the contrast of his honest labor-worn hands against her refined features speaks to the bridge between their worlds.",
          "tags": {
            "characters": [
              "CHAR_LIN",
              "CHAR_MEI"
            ],
            "locations": [
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "13.7.cA",
          "scene_number": 13,
          "frame_number": 7,
          "cameras": [
            "13.7.cA"
          ],
          "camera_notation": "[13.7.cA]",
          "position_notation": "[POS: CHAR_MADAME_CHOU screen right center, facing screen left]",
          "lighting_notation": "[LIGHT: Golden hour key from east, warm highlights on face, soft fill from overcast sky, benedictory rim lighting]",
          "prompt": "Medium shot of [CHAR_MADAME_CHOU] (screen-right, facing left) at [LOC_LU_XIAN_BROTHEL]'s ornate entrance. Golden sunrise lighting from the east casts warm highlights across her weathered features as she smiles - the first genuine expression in years. Her silk robes catch the morning light against the backdrop of carved wooden galleries and red pillars. The storm persists overhead but hazy atmosphere softens around her maternal expression. Twenty years of watching Mei grow culminate in this moment of liberation. The brothel's opulent architecture frames her decision - paper lanterns swaying in storm wind, upturned eaves silhouetted against stormy sky. Her small frame radiates authority and unexpected tenderness as she declares Mei's freedom. Sunrise light creates an almost benedictory glow around her figure, emphasizing the profound gift she's giving. Long shadows stretch westward across the scene, marking this dawn as a new beginning.",
          "tags": {
            "characters": [
              "CHAR_MADAME_CHOU"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        },
        {
          "frame_id": "13.8.cA",
          "scene_number": 13,
          "frame_number": 8,
          "cameras": [
            "13.8.cA"
          ],
          "camera_notation": "[13.8.cA]",
          "position_notation": "[POS: CHAR_MEI screen left foreground, CHAR_LIN center-left foreground, CHAR_MIN_ZHU screen right background retreating]",
          "lighting_notation": "[LIGHT: Golden hour key from east, long shadows stretching west, storm clouds breaking to allow filtered sunrise through hazy atmosphere]",
          "prompt": "Wide shot of [LOC_PRESSED_DIRT_ROAD] between [LOC_LU_XIAN_BROTHEL] and the flower shop. Golden sunrise lighting from the east casts long shadows stretching westward across the packed dirt. [CHAR_MIN_ZHU] retreats in the background screen-right, his bulk diminishing as he moves away down the street. [CHAR_MEI] stands screen-left foreground and [CHAR_LIN] center-left foreground, positioned together as freed companions. The brothel's ornate architecture with carved galleries and red pillars frames screen-right. Storm clouds overhead begin breaking apart, allowing filtered sunrise light through the hazy morning atmosphere. Paper lanterns sway in the wind. The narrow street opens toward freedom with golden light illuminating the path forward.",
          "tags": {
            "characters": [
              "CHAR_MEI",
              "CHAR_LIN",
              "CHAR_MIN_ZHU"
            ],
            "locations": [
              "LOC_LU_XIAN_BROTHEL",
              "LOC_PRESSED_DIRT_ROAD"
            ],
            "props": []
          },
          "location_direction": "NORTH"
        }
      ]
    }
  ]
}