{
  "title": "Tester",
  "genre": "Drama",
  "visual_style": "live_action",
  "style_notes": "",
  "logline": "A prized courtesan on the eve of being sold to the highest bidder risks everything on a game of Go to win her freedom and pursue the humble florist she has silently loved from afar.",
  "synopsis": "In the renowned pleasure house Lu Xian, Mei has been raised as the establishment's most precious jewel—trained in intellect, seduction, and the arts of pleasure. Now of age, she faces the inevitable auction of her body and future to wealthy suitors. Two powerful men remain in contention: General Zhoa, a high-ranking military commander, and Min Zhu, a gambling-obsessed grand merchant. Yet Mei's heart belongs to neither. From her terrace, she has spent countless hours watching Lin, the gentle florist across the street, tend to his flowers with such devotion and care that she has fallen deeply in love with a man who has never once seen her face.\n\nDesperate to escape her gilded cage, Mei approaches the merchant Min Zhu with a dangerous wager: if she defeats him at Go, he must match her life savings and purchase her freedom. If she loses, she becomes his at a discount. The merchant, amused by her audacity, accepts. During their fateful game, Mei realizes she is outmatched and deploys the only weapons she has been taught—her beauty and allure. With a calculated gesture of loosened hair and whispered proximity, she clouds his judgment long enough to secure victory. As the merchant pays for her freedom, Mei sends a heartfelt letter to Lin confessing her secret devotion. She runs barefoot through the night to his shop, where he sits reading her words by lantern light, and when he opens the door to find her standing there—wild-haired, breathless, and free—a new life begins.",
  "themes": "Freedom versus ownership, the courage to pursue authentic love, using one's constraints as tools for liberation, the poetry of silent devotion",
  "world_rules": "This story exists within Imperial China's rigid social hierarchy, where courtesans occupy a complex position—educated and refined yet ultimately property to be bought and sold. The pleasure house Lu Xian operates under strict codes: Madame Chou controls all transactions, and courtesans cannot leave without being purchased. Wealth determines access, and suitors must negotiate through formal channels. The game of Go serves as both intellectual pursuit and metaphor for strategic maneuvering in a society where women must use indirect means to achieve agency. Honor and agreements are binding—once a wager is made, it must be honored regardless of outcome. Class boundaries are rigid but not impermeable; freedom, once purchased, is absolute.",
  "lighting": "Golden hour warmth contrasted with intimate candlelit interiors; soft lantern glow casting amber shadows; diffused daylight filtering through silk screens and wooden lattice",
  "vibe": "Intimate, poetic, yearning, quietly triumphant, sensual",
  "characters": [
    {
      "tag": "CHAR_MEI",
      "name": "Mei",
      "role": "protagonist",
      "description": "Mei possesses an ethereal, willowy beauty standing at modest height with a graceful, elongated neck that draws the eye upward. Her hair is lustrous black silk that falls past her waist when unbound, typically arranged in elaborate styles adorned with jade pins. Her eyes are dark pools of liquid amber, almond-shaped with a slight upward tilt, framed by delicate brows she has learned to arch expressively. Her skin is pale as moonlight on snow, meticulously maintained with rice powder and pearl cream. Her lips are naturally full, often tinted with subtle rouge. She moves with practiced elegance, each gesture a poem, yet there's an underlying stillness about her—a quality of watching, waiting, yearning. Her hands are small and impossibly soft, trained for the qin and calligraphy."
    },
    {
      "tag": "CHAR_LIN",
      "name": "Lin",
      "role": "love_interest",
      "description": "Lin possesses an unassuming handsomeness that reveals itself slowly, like a flower opening at dawn. He stands at average height with a lean, wiry build developed through daily labor—carrying water, turning soil, climbing to prune high branches. His hair is black but sun-lightened to deep brown at the ends, typically pulled back in a simple topknot that often loosens throughout the day, sending strands across his forehead. His eyes are warm brown, the color of rich earth, with gentle crow's feet beginning at the corners from squinting in sunlight. His face is kind rather than striking, with a strong jaw softened by full lips that curve easily into unconscious smiles when he works. His hands are his most notable feature—strong and calloused yet capable of impossible delicacy, with soil perpetually embedded beneath his short nails. His skin is tan from outdoor work, with a scattering of small scars on his forearms from thorns."
    },
    {
      "tag": "CHAR_MIN_ZHU",
      "name": "Min Zhu",
      "role": "antagonist",
      "description": "Min Zhu cuts an imposing figure of cultivated prosperity. He is tall and broad-shouldered, carrying extra weight that speaks of abundant feasts rather than indolence—the belly of a man who can afford excess. His face is round and shrewd, with small, calculating eyes that miss nothing, set beneath heavy brows that rise skeptically at poor offers. His hair is silver-streaked black, worn in an elaborate topknot secured with a gold pin. He maintains a thin, carefully groomed mustache and small pointed beard in the style of successful merchants. His hands are soft—he hasn't done physical labor in decades—adorned with multiple rings of jade and gold. His skin is pale and well-maintained, showing the benefits of wealth. His smile is practiced and rarely reaches his eyes, a merchant's smile that promises everything and guarantees nothing."
    },
    {
      "tag": "CHAR_GENERAL_ZHOA",
      "name": "General Zhoa",
      "role": "antagonist",
      "description": "General Zhoa is a commanding physical presence, standing tall with the rigid posture of military discipline permanently etched into his spine. His build is powerful and lean, muscles maintained through daily training despite his rank allowing him to delegate combat. His face is weathered and hard, with deep lines carved by sun, wind, and the weight of command. A prominent scar runs from his left temple to his jaw—a sword cut he wears with pride. His eyes are black and penetrating, the eyes of a man accustomed to reading battlefields and judging men's worth in seconds. His hair is iron-grey, worn in a severe topknot appropriate to his station. His jaw is square and often clenched, his lips thin and rarely smiling. His hands are calloused from sword and reins, his knuckles scarred from combat. He moves with controlled power, every gesture economical and purposeful."
    },
    {
      "tag": "CHAR_MADAME_CHOU",
      "name": "Madame Chou",
      "role": "mentor",
      "description": "Madame Chou carries herself with the dignified grace of faded grandeur. She was clearly beautiful once—the bones of that beauty remain in her high cheekbones and elegant bone structure—but time has softened and lined her face. She is of medium height, her figure still shapely though fuller than in youth, carried with impeccable posture. Her hair is silver-white, always elaborately styled and pinned with valuable ornaments that advertise her success. Her eyes are dark and shrewd, with the knowing look of someone who has seen everything and been surprised by nothing. Fine lines web her face, particularly around her eyes and mouth—evidence of both smiles and sorrows. Her hands are elegant, adorned with rings, though age spots mark them. She moves slowly now, deliberately, each gesture conserving energy while projecting authority."
    },
    {
      "tag": "CHAR_SERVANT_GIRL_01",
      "name": "Servant Girl 01",
      "role": "supporting",
      "description": "Appearance to be defined based on story context"
    }
  ],
  "locations": [
    {
      "tag": "LOC_MEI_BEDROOM_PATIO",
      "name": "Mei's Private Chamber Terrace",
      "description": "An intimate wooden terrace extending from a second-story bedroom in the prestigious Lu Xian brothel. The patio features intricately carved rosewood railings with peony motifs, weathered to a warm honey patina. Delicate silk lanterns hang from curved eaves, their tassels swaying gently. A small cushioned bench sits against the wall, worn from years of Mei's secret vigils. Potted orchids and trailing jasmine vines frame the railing, partially concealing the observer from the street below. The floorboards are smooth from countless barefoot steps."
    },
    {
      "tag": "LOC_PRESSED_DIRT_ROAD",
      "name": "The Corner Road at Lu Xian",
      "description": "A well-traveled dirt road packed firm by generations of foot traffic, rickshaw wheels, and merchant carts. The earth is a warm ochre color, smooth and swept clean by diligent shopkeepers each morning. Wooden drainage channels run along the edges. The road curves gently at the corner where the florist shop sits, creating a small widened area where vendors occasionally gather. Stone stepping blocks are placed at intervals for crossing during rain. Paper lanterns on bamboo poles line the street, and hand-painted wooden signs hang from shop fronts."
    },
    {
      "tag": "LOC_LU_XIAN_BROTHEL",
      "name": "The Lu Xian Pleasure House",
      "description": "A legendary three-story pleasure house renowned throughout the province for its refined courtesans. The building is constructed of dark aged timber and white-washed plaster, with upturned eaves decorated with carved dragons and phoenixes. The interior where Mei awaits the merchant features her private receiving room—an intimate space with fine bamboo mats covering the floor, a low mahogany table holding the wooden go board with its grid of black lines and bowls of black and white stones. Red silk bedding is visible through a beaded curtain partition. Calligraphy scrolls adorn the walls, and bronze incense burners release thin streams of fragrant smoke. Lacquered cabinets hold tea services and musical instruments."
    },
    {
      "tag": "LOC_FLORIST_SHOP",
      "name": "Lin's Corner Flower Shop",
      "description": "A humble but lovingly maintained wooden shopfront occupying a prime corner location beneath the Lu Xian brothel's terrace. The shop features sliding wooden screens that open completely during business hours, revealing an interior crowded with ceramic pots, wooden buckets, and bamboo containers overflowing with flowers—peonies, chrysanthemums, lotus, plum blossoms, and orchids depending on season. Gardening tools hang from hooks on the walls, and a worn wooden counter displays small arrangements. The back room where Lin reads the note is simple—a low table, a sleeping mat rolled in the corner, shelves of seeds and dried flowers, and a single oil lantern that creates a warm golden glow. The wooden floor is stained with soil and water marks from years of devoted work."
    }
  ],
  "props": [
    {
      "tag": "PROP_LANTERN",
      "name": "Lin's Evening Lantern",
      "description": "A traditional Chinese paper lantern used for reading and illumination in the florist shop"
    },
    {
      "tag": "PROP_NOTE",
      "name": "Mei's Love Letter",
      "description": "A handwritten confession letter delivered by a servant girl to the florist Lin"
    },
    {
      "tag": "PROP_BLUE_KIMONO",
      "name": "Mei's Blue Silk Kimono",
      "description": "An exquisite courtesan's formal kimono worn by Mei during the pivotal Go game"
    },
    {
      "tag": "PROP_RED_SILKEN_BEDDING",
      "name": "Courtesan's Red Silk Bedding",
      "description": "Luxurious bedding in Mei's private chamber, featured in the merchant's fantasy"
    },
    {
      "tag": "PROP_BAMBOO_MATS",
      "name": "Fine Bamboo Floor Mats",
      "description": "Traditional woven bamboo tatami-style mats covering the floor of Mei's private room"
    },
    {
      "tag": "PROP_MAHOGANY_TABLE",
      "name": "Mahogany Go Table",
      "description": "A low traditional table used for the decisive Go game between Mei and the Grand Merchant"
    },
    {
      "tag": "PROP_WOODEN_GO_BOARD",
      "name": "Traditional Wooden Go Board",
      "description": "A classic Go game board prepared for the fateful match between Mei and Min Zhu"
    },
    {
      "tag": "PROP_HAIR_RIBBON",
      "name": "Mei's Silk Hair Ribbon",
      "description": "A delicate ribbon used to tie Mei's hair, which she strategically unties during the Go game"
    },
    {
      "tag": "PROP_TEA_CUP",
      "name": "Porcelain Tea Cup",
      "description": "A fine ceramic cup used by Mei to serve tea during the strategic moment in the Go game"
    }
  ],
  "all_tags": [
    "CHAR_GENERAL_ZHOA",
    "PROP_LANTERN",
    "PROP_NOTE",
    "CHAR_LIN",
    "PROP_BLUE_KIMONO",
    "CONCEPT_FREEDOM",
    "EVENT_GO_GAME_WAGER",
    "CHAR_MADAME_CHOU",
    "PROP_RED_SILKEN_BEDDING",
    "CONCEPT_CARE_AND_DEVOTION",
    "LOC_MEI_BEDROOM_PATIO",
    "CHAR_MIN_ZHU",
    "CHAR_MEI",
    "LOC_PRESSED_DIRT_ROAD",
    "PROP_BAMBOO_MATS",
    "LOC_LU_XIAN_BROTHEL",
    "CONCEPT_SEDUCTION",
    "CONCEPT_FORBIDDEN_LOVE",
    "PROP_MAHOGANY_TABLE",
    "EVENT_MEI_COMING_OF_AGE",
    "PROP_WOODEN_GO_BOARD",
    "LOC_FLORIST_SHOP",
    "PROP_HAIR_RIBBON",
    "CHAR_SERVANT_GIRL_01",
    "CONCEPT_TRUE_LOVE",
    "PROP_TEA_CUP"
  ]
}