{
  "title": "Untitled",
  "genre": "Drama",
  "visual_style": "live_action",
  "style_notes": "",
  "logline": "A virtuous courtesan in feudal China stakes her freedom on a strategic game of Go against a military general, using wit and allure to escape her gilded cage and find true love with a humble florist.",
  "synopsis": "In the bustling merchant district outside the imperial palace of feudal China, the renowned Lixuan Brothel houses the most coveted courtesans in the city. Among them is Mei, a young woman of exceptional beauty and virtue who yearns for genuine love beyond the transactional relationships that define her existence. From her ornate balcony room, she watches Lin, a dedicated florist across the street, tend to his orchids with the kind of devotion she craves for herself.\n\nDesperate to escape her circumstances, Mei devises a daring gamble with General Zhoa: if he wins at Go, he can marry her at a reduced price, but if she wins, he must purchase her freedom. During their fateful match, Mei employs subtle seduction to distract the general—serving tea with intimate proximity, allowing her presence to cloud his strategic thinking. As Zhoa becomes lost in fantasies of possessing her, Mei secures her victory on the board.\n\nWith her freedom won, Mei crosses the street to Lin's flower shop, where the florist recognizes her as the woman who has watched his orchids with such longing. As he welcomes her inside, Mei finally steps into a world where she might be cherished for who she truly is, not merely for her beauty or entertainment value.",
  "themes": "Freedom vs. captivity, authentic love vs. transactional relationships, agency and self-determination",
  "world_rules": "- Set in feudal China's imperial era with rigid social hierarchies and gender roles\n- Courtesans operate within a regulated system where they can be purchased for marriage or service\n- The merchant district serves as a bridge between the imperial palace and common society\n- Games of strategy like Go carry significant cultural weight and can be used for formal agreements\n- Women's agency is severely limited, requiring creative solutions to achieve independence\n- Social mobility is rare and must be carefully negotiated within existing power structures",
  "lighting": "Chiaroscuro with dramatic shadows, low-key lighting creating intimate contrasts between the warm golden interior of the brothel and the cool natural light of the flower shop, volumetric lighting streaming through latticed windows",
  "vibe": "Cinematic, moody, intimate, sensual",
  "characters": [
    {
      "tag": "CHAR_MEI",
      "name": "Mei",
      "role": "protagonist",
      "description": "Mei stands at average height with a willowy, elegant frame that moves with practiced grace. Her long, lustrous black hair cascades like silk, often adorned with delicate ornaments that catch the light. Her almond-shaped eyes are deep brown, expressive and intelligent, framed by naturally arched brows. Her porcelain skin is flawless, with naturally rosy lips that rarely need enhancement. She possesses an ethereal quality that makes her appear almost untouchable, yet her expressions reveal a yearning vulnerability that draws people to her."
    },
    {
      "tag": "CHAR_LIN",
      "name": "Lin",
      "role": "love_interest",
      "description": "Lin has a medium build with strong, careful hands marked by honest work, standing with the quiet confidence of a craftsman. His dark hair is kept neat but practical, often with a slight wave from humidity in the greenhouse. His warm brown eyes are observant and kind, with laugh lines suggesting a gentle humor. His skin has a healthy tone from working in natural light, and he carries himself with unpretentious dignity. There's something inherently trustworthy about his presence, a steadiness that speaks of reliability and genuine care."
    },
    {
      "tag": "CHAR_GENERAL_ZHOA",
      "name": "General Zhoa",
      "role": "antagonist",
      "description": "General Zhoa is tall and powerfully built, with the straight-backed posture of military discipline and broad shoulders that speak of physical training. His black hair is kept in a traditional topknot with military precision, and his dark eyes are sharp and calculating, accustomed to assessing threats and opportunities. His strong jawline and angular features give him an imposing presence, while his hands show both the calluses of sword work and the softness of privilege. He carries himself with the unconscious authority of someone used to being obeyed."
    }
  ],
  "locations": [
    {
      "tag": "LOC_MAIN_PALACE",
      "name": "Imperial Palace Complex",
      "description": "A magnificent fortress of power rising above the merchant district, its vermillion walls and golden-tiled roofs catching the light like jewels. Towering pagoda spires pierce the sky while ornate gates with carved dragon motifs guard the entrances. Stone lions flank the main thoroughfare leading to the palace steps, their fierce expressions weathered by centuries of wind and rain."
    },
    {
      "tag": "LOC_LIXUAN_BROTHEL",
      "name": "Lixuan Courtesan House",
      "description": "An elegant two-story establishment with traditional Chinese architecture, featuring carved wooden balconies and silk banners fluttering in the breeze. The building's facade is adorned with intricate lattice work and red lanterns that glow warmly at dusk. Mei's private chamber occupies the prominent corner room with sweeping views of the street below."
    },
    {
      "tag": "LOC_FLOWER_SHOP",
      "name": "Lin's Orchid Emporium",
      "description": "A modest single-story shop with large windows displaying carefully arranged orchids in ceramic pots. The interior features bamboo shelving systems and natural wood fixtures that complement the delicate flowers. Sunlight streams through the windows, creating perfect growing conditions and dramatic lighting for the blooms."
    },
    {
      "tag": "LOC_MERCHANT_DISTRICT",
      "name": "Golden Phoenix Market Quarter",
      "description": "A vibrant maze of narrow cobblestone streets lined with shops, stalls, and tea houses. Colorful silk banners and paper lanterns stretch between buildings, creating a canopy of commerce above the bustling crowds. The architecture blends residential and commercial spaces with overhanging second stories and carved wooden details."
    }
  ],
  "props": [
    {
      "tag": "PROP_BAMBOO_MATS",
      "name": "Traditional Bamboo Floor Mats",
      "description": "Hand-woven bamboo floor mats that serve as elegant flooring in Mei's luxurious room at the Lixuan Brothel"
    },
    {
      "tag": "PROP_ORCHIDS",
      "name": "Lin's Prized Orchid Collection",
      "description": "An exquisite collection of various orchid species carefully cultivated and displayed in Lin's flower shop across from the brothel"
    },
    {
      "tag": "PROP_RED_SILK_BEDDING",
      "name": "Luxurious Red Silk Bed Drapery",
      "description": "Elaborate silk bedding and drapery that adorns Mei's opulent sleeping area in rich crimson tones"
    }
  ],
  "all_tags": [
    "LOC_MAIN_PALACE",
    "LOC_LIXUAN_BROTHEL",
    "LOC_FLOWER_SHOP",
    "PROP_BAMBOO_MATS",
    "PROP_ORCHIDS",
    "PROP_RED_SILK_BEDDING",
    "CHAR_MEI",
    "CHAR_LIN",
    "CHAR_GENERAL_ZHOA",
    "LOC_MERCHANT_DISTRICT"
  ]
}