{
  "global": {
    "title": "The Orchid's Gambit",
    "logline": "A prized courtesan risks everything on a game of Go to buy her freedom and find true love with the humble florist she has watched from afar.",
    "themes": [
      "forbidden love",
      "freedom versus captivity",
      "the courage to choose one's fate",
      "true love versus transaction"
    ],
    "visual_style": "live_action",
    "lighting": "Warm amber oil lantern glow for interiors, soft natural daylight filtering through rice paper screens, moonlight for night scenes. High contrast between the opulent golden warmth of the brothel and the humble natural light of the flower shop.",
    "color_palette": "Deep crimson reds (#8B0000) and gold (#FFD700) for the brothel, cerulean blue (#1E90FF) for Mei's signature garments, soft greens (#228B22) and earth tones (#8B4513) for the flower shop, warm amber (#FFBF00) for lantern light",
    "vibe": "Melancholic longing transforming into desperate hope, intimate and emotionally charged, the tension between gilded cage beauty and simple authentic love",
    "era": "Imperial China - Song Dynasty (960-1279 CE)"
  },
  "characters": [
    {
      "tag": "CHAR_MEI",
      "name": "Mei",
      "role": "protagonist",
      "age": "19",
      "ethnicity": "Han Chinese",
      "description": "The most valued jewel of the legendary brothel Lu Xian, groomed in intellect, seduction and pleasure, who falls in love with a florist she watches from her terrace.",
      "visual_appearance": "A breathtakingly beautiful young woman with a delicate oval face and flawless porcelain skin with a subtle warm undertone. Her eyes are large and almond-shaped, deep brown almost black, framed by naturally thick dark lashes and elegantly arched brows that taper to fine points. High cheekbones create gentle shadows beneath. Her nose is small and refined with a softly rounded tip. Full lips naturally tinted rose-pink, the upper lip forming a perfect cupid's bow. Her hair is lustrous black silk reaching past her waist when unbound, thick and straight with a healthy gleam. Slender build with graceful long neck, narrow shoulders, and elegant hands with tapered fingers kept immaculately smooth. Her movements carry the trained fluidity of a dancer. A small beauty mark sits just below her left eye. Her youth shows in the smoothness of her skin and brightness of her gaze, though her eyes hold depths of hidden longing.",
      "costume": "Primary hanfu in cerulean blue (#1E90FF) silk with subtle embroidered orchid patterns in silver thread. The ruqun style features a high-waisted flowing skirt and cross-collared upper garment with wide sleeves. A pale ivory silk inner robe visible at the neckline. Wide sash of deep blue silk cinches at the high waist. Hair elaborately styled with jade hairpins and silver ornaments, with a significant crimson silk ribbon (#DC143C) binding a section. Embroidered silk slippers in matching blue. Minimal jewelry - small jade earrings and a thin silver bracelet. The fabrics are luxurious but not gaudy, marking her as the establishment's finest.",
      "physicality": {
        "baseline_posture": "Gracefully upright with chin slightly elevated, shoulders back in trained courtesan elegance",
        "gait": "Gliding steps that seem to float, each movement deliberate and flowing like water",
        "nervous_tells": [
          "fingers touching the ribbon in her hair",
          "slight pressing of lips together",
          "quick downward glances"
        ],
        "confident_tells": [
          "sustained eye contact with slight smile",
          "deliberate slowing of movements",
          "subtle tilt of head exposing neck"
        ]
      }
    },
    {
      "tag": "CHAR_LIN",
      "name": "Lin",
      "role": "love interest",
      "age": "24",
      "ethnicity": "Han Chinese",
      "description": "The humble florist who owns the shop on the corner, tending to his flowers with gentle care, unknowingly watched and loved by Mei from her terrace.",
      "visual_appearance": "A handsome young man with an honest, open face and warm features. His face is oval-shaped with a strong but not harsh jawline. Kind eyes that are dark brown and slightly downturned, giving him a gentle, approachable expression. Straight black eyebrows frame his gaze. His nose is straight and well-proportioned. Lips of medium fullness often curved in a slight smile of concentration. Skin is warmly tanned from outdoor work with a healthy glow, a few faint freckles across his cheeks from sun exposure. His black hair is thick and slightly unruly, pulled back in a simple topknot with loose strands falling around his temples. Medium build with lean but strong arms developed from physical labor. His hands are notably expressive - strong with long fingers, calloused palms, and soil permanently embedded around the fingernails despite washing. Moves with unhurried patience.",
      "costume": "Simple working-class hanfu of practical design. Cross-collared changshan in undyed natural hemp fabric (#C4B7A6), loose and comfortable for physical work, sleeves often rolled up past the forearms. A brown cotton sash (#5D4037) ties at the waist. Simple cotton trousers in faded indigo beneath. Cloth shoes with rope soles, worn but well-maintained. Often wears a rough canvas apron stained with soil and plant residue when working. No jewelry or ornamentation. Clothes are clean and mended, indicating humble means but self-respect.",
      "physicality": {
        "baseline_posture": "Relaxed and natural, slight forward lean when engaged with plants or tasks",
        "gait": "Steady unhurried steps, moves with the patience of someone who nurtures growing things",
        "nervous_tells": [
          "rubbing hands together",
          "touching back of neck",
          "swallowing visibly"
        ],
        "confident_tells": [
          "hands moving expressively",
          "steady unwavering eye contact",
          "small nods of certainty"
        ]
      }
    },
    {
      "tag": "CHAR_MIN_ZHU",
      "name": "Min Zhu",
      "role": "antagonist",
      "age": "52",
      "ethnicity": "Han Chinese",
      "description": "A grand merchant and betting man, one of the two final suitors competing to purchase Mei.",
      "visual_appearance": "A corpulent man with a round, fleshy face showing the prosperity of successful commerce. Small calculating eyes nearly lost in pouched lids, dark and sharp with mercantile cunning. Thin eyebrows above. A broad nose with flared nostrils. Full lips naturally curved into a self-satisfied smirk, often stained from wine. His skin is pale and soft from a life lived indoors, with a slightly oily sheen. Thinning black hair oiled and pulled into a neat topknot secured with a jade pin. Multiple chins flow into a thick neck. Heavy-set body with a pronounced belly. Thick fingers adorned with jade and gold rings, soft and uncallused with long manicured nails. Age shows in deep creases around his eyes, loosening jowls, and liver spots on the backs of his hands.",
      "costume": "Extravagantly wealthy attire. Heavy silk outer robe in rich burgundy (#722F37) with elaborate gold-thread embroidery depicting coins and auspicious symbols. Inner robe of fine cream silk visible at collar. Wide gold brocade sash (#D4AF37) straining around his considerable middle with a carved jade pendant. Black silk merchant's cap with jade ornament indicating rank. Soft leather boots of finest quality. Multiple rings on his fingers - jade, gold, and carved agate. Everything designed to display vast wealth and status.",
      "physicality": {
        "baseline_posture": "Expansive, takes up space, belly thrust forward with self-importance",
        "gait": "Rolling labored walk of a heavy man, deliberate pace that expects others to wait",
        "nervous_tells": [
          "tugging at collar",
          "rapid blinking",
          "moistening lips repeatedly"
        ],
        "confident_tells": [
          "steepling fingers over belly",
          "slow knowing smile",
          "leisurely examination of surroundings"
        ]
      }
    },
    {
      "tag": "CHAR_MADAME_CHOU",
      "name": "Madame Chou",
      "role": "supporting",
      "age": "55",
      "ethnicity": "Han Chinese",
      "description": "The shrewd Madame of the legendary brothel Lu Xian who groomed Mei.",
      "visual_appearance": "An elegant older woman retaining echoes of former beauty in her bone structure. Oval face with prominent cheekbones and strong jawline, skin pale and powdered showing fine lines like crackled porcelain. Sharp black eyes heavy-lidded and knowing, outlined with kohl. Thin arched brows maintained with precision. Straight nose with refined nostrils. Thin lips often pressed together in calculation, painted deep red. Hair still mostly black with distinguished silver streaks, elaborately styled with multiple loops, pins, and ornaments. Slender and rigidly upright refusing to stoop with age. Elegant hands with long fingernails painted red.",
      "costume": "Formal attire befitting an establishment's madam. Heavy embroidered outer robe in deep plum purple (#4A0D67) with gold phoenixes and peonies. Wide sleeves lined with crimson that flash when moving. Inner robe of black silk. Broad gold and red brocade sash. Elaborate headdress with gold pins, jade ornaments, and silk flowers. Multiple jade bracelets stacked on wrists. Embroidered silk slippers. More ornamentation than anyone - each piece representing the establishment's success.",
      "physicality": {
        "baseline_posture": "Rigidly upright, chin high, shoulders squared - absolute authority",
        "gait": "Measured deliberate steps commanding attention, never hurried",
        "nervous_tells": [
          "single fingernail tapping when truly agitated"
        ],
        "confident_tells": [
          "slow sweeping evaluating gaze",
          "slight smile not reaching eyes"
        ]
      }
    },
    {
      "tag": "CHAR_SERVANT",
      "name": "Servant Girl",
      "role": "supporting",
      "age": "15",
      "ethnicity": "Han Chinese",
      "description": "Mei's servant girl who delivers the crucial note to Lin.",
      "visual_appearance": "A young girl with round soft face still holding childhood fullness. Fair skin with healthy pink flush. Large innocent light brown eyes, bright and alert. Small upturned nose. Small rosebud lips often pressed together in concentration. Plain black hair simply styled in a low bun appropriate for a servant. Small and slight of build, quick and light-footed. Small capable hands often clutched together nervously.",
      "costume": "Simple servant attire. Plain cotton hanfu in muted grey-blue (#6B7B8C), clean but obviously cheaper fabric. Simple white inner collar. Faded indigo cloth sash. Hair held with simple wooden pins. Cloth slippers. Everything clean and neat but marking her lower station.",
      "physicality": {
        "baseline_posture": "Slightly hunched, trying to appear small and unobtrusive",
        "gait": "Quick quiet steps, trained to move without being noticed",
        "nervous_tells": [
          "tugging at sleeves",
          "biting lower lip"
        ],
        "confident_tells": [
          "straightens slightly when completing tasks"
        ]
      }
    }
  ],
  "locations": [
    {
      "tag": "LOC_BROTHEL",
      "name": "Lu Xian Brothel - Main Hall",
      "description": "The legendary brothel's central entertaining hall, a masterwork of Song Dynasty interior design. High ceilings supported by lacquered red wooden columns with gold-leaf carved dragons. Dark wood paneled walls inset with silk screens painted with mountains and orchids. Polished dark wood floors covered with fine woven mats and silk cushions in reds and golds arranged around low lacquered tables. Carved wooden lattice screens creating semi-private alcoves. Bronze incense burners trailing fragrant smoke. A raised platform serves as performance stage. Silk banners hang from ceiling beams. Porcelain vases hold fresh flowers. Every surface speaks of luxury and refinement.",
      "atmosphere": "Opulent seduction and refined decadence, a gilded cage of beauty",
      "lighting": "Dozens of silk-shaded oil lanterns hanging from ceiling beams cast warm amber pools. Candlesticks on tables add intimate glow. Strategically placed to flatter faces while leaving alcoves in suggestive shadow.",
      "sensory": {
        "visual": "Dominant reds and golds, gleaming lacquered surfaces, silk catching light, incense smoke curling",
        "weather": "Interior, protected from elements",
        "time_of_day": "Primarily evening scenes"
      }
    },
    {
      "tag": "LOC_MEI_CHAMBER",
      "name": "Mei's Private Chamber",
      "description": "The private quarters of Lu Xian's most prized courtesan. Spacious chamber with dark wood ceiling beams and pale silk walls painted with delicate orchid motifs. Fine bamboo mats of exceptional quality covering the floor. Large sleeping platform against one wall covered with red silk bedding and embroidered coverlets. Mahogany dressing table holding bronze mirrors and jade combs. Low mahogany table at the room's center, perfect for tea or games. Wooden lattice window screens filtering light. Doorway leads to exterior terrace. Silk scroll paintings on walls. A Go board in wooden case near the table. Porcelain tea service on carved wooden tray.",
      "atmosphere": "Intimate luxury with undertone of gilded imprisonment",
      "lighting": "Daytime: soft diffused light through rice paper screens. Evening: clusters of candles on bronze stands, single oil lantern by bed creating intimate pools against shadow.",
      "sensory": {
        "visual": "Pale walls with delicate paintings, red silk bedding as anchor, dark wood furniture",
        "weather": "Breezes drift from terrace carrying flower scents",
        "time_of_day": "Both day and evening scenes"
      }
    },
    {
      "tag": "LOC_TERRACE",
      "name": "Mei's Private Terrace",
      "description": "A small exterior terrace extending from Mei's chamber, her window to the world beyond. Weathered cedar plank flooring extending from doorway, bordered by elegantly carved wooden railing with lattice work. Just wide enough for one or two people. Clay pots with trailing vines and small flowers line the edges. A single wooden stool. The terrace overlooks the corner where the flower shop sits below. Wooden eaves provide shelter from rain. The height allows clear sight lines to street and shop while maintaining privacy.",
      "atmosphere": "Longing and secret observation, connection to outside world",
      "lighting": "Full natural daylight when sun is up, moonlight and distant lantern glow at night. No artificial lighting on terrace - she watches from shadow.",
      "sensory": {
        "visual": "View of street below, flower shop, Lin's displays",
        "weather": "Exposed to elements - morning mist, afternoon sun, evening breeze",
        "time_of_day": "Day and night observations"
      }
    },
    {
      "tag": "LOC_FLOWER_SHOP",
      "name": "Lin's Flower Shop",
      "description": "A humble corner shop overflowing with cultivated beauty. Modest wooden structure with open front panels that fold back during business. Wooden tables and tiered shelves holding potted flowers - orchids in ceramic pots, chrysanthemums in bamboo containers, flowering branches in tall vases. Wooden buckets hold cut flowers. Small cramped interior with work table scattered with pruning instruments - shears, thin knives, watering vessels, soft cloths. Bundles of dried flowers hang from ceiling beams. Pressed earth floor, clean-swept. Doorway at back leads to small living space.",
      "atmosphere": "Humble nurturing life, gentle growth, stark contrast to brothel opulence",
      "lighting": "Daytime: generous natural light flooding open front. Evening: single oil lantern on work table casting warm gold, shop front closed with wooden panels.",
      "sensory": {
        "visual": "Explosion of flower colors against humble wood and earth tones, green foliage everywhere",
        "weather": "Open to elements when shop is open",
        "time_of_day": "Day and night work scenes"
      }
    },
    {
      "tag": "LOC_STREET",
      "name": "Street Between Brothel and Shop",
      "description": "The pressed dirt road running past both Lu Xian brothel and Lin's flower shop on the corner. Compacted earth surface grooved with cart tracks. The imposing facade of Lu Xian rises on one side with elaborate entrance and lanterns. Lin's humble flower shop occupies the corner opposite. Other wooden-fronted shops line the street. Occasional trees planted along road. Wide enough for two carts to pass. At night, lanterns from establishments create pools of light along darkened road.",
      "atmosphere": "The boundary between worlds, where imprisonment meets freedom",
      "lighting": "Daytime: full natural light. Night: darkness broken by lantern spill from establishments, moonlight on open road, deep shadows between light pools.",
      "sensory": {
        "visual": "Contrast between ornate brothel and humble shops, pressed dirt road",
        "weather": "Exposed - dust when dry, wind sweeping between buildings",
        "time_of_day": "Final scene at night"
      }
    }
  ],
  "props": [
    {
      "tag": "PROP_GO_BOARD",
      "name": "Wooden Go Board",
      "appearance": "Traditional Go board carved from aged mahogany (#420D09) with rich visible grain. Approximately 45cm square with 19x19 grid lines precisely carved and inlaid with darker wood. Board sits on four carved feet. Accompanying turned wooden bowls hold polished black slate stones and white shell stones. Surface shows patina of age and quality use.",
      "era_notes": "Go (Weiqi) was extremely popular in Song Dynasty China, considered one of the four scholarly arts."
    },
    {
      "tag": "PROP_NOTE",
      "name": "Mei's Letter to Lin",
      "appearance": "Single sheet of fine rice paper approximately 25cm by 35cm, slightly textured cream color (#FFFEF2) with visible fibers. Elegant black ink calligraphy - refined and practiced characters with slight variations suggesting emotional urgency. Paper carefully folded into thirds and sealed with small red wax dot. Black characters contrast against pale paper.",
      "era_notes": "Paper and brush calligraphy were standard in Song Dynasty China."
    },
    {
      "tag": "PROP_RIBBON",
      "name": "Mei's Hair Ribbon",
      "appearance": "Long strip of fine silk approximately 80cm length and 3cm wide, dyed deep crimson red (#DC143C) that catches light. Luminous sheen with neatly hemmed edges. One end slightly worn from tying. Cascades with liquid quality when released.",
      "era_notes": "Silk ribbons were common hair accessories in Song Dynasty, colors carrying symbolic meaning."
    },
    {
      "tag": "PROP_TEA_SET",
      "name": "Celadon Tea Service",
      "appearance": "Elegant Song Dynasty celadon set - spouted teapot and matching cups in pale jade-green (#88B378) with subtle crackled glaze. Rounded teapot approximately 15cm tall with curved spout, loop handle, fitted lid with lotus-shaped knob. Small handleless cup bowls approximately 6cm diameter. Set rests on carved wooden tray. Steam rises catching light.",
      "era_notes": "Celadon ware reached peak refinement during Song Dynasty."
    },
    {
      "tag": "PROP_MONEY_BAG",
      "name": "Mei's Savings Pouch",
      "appearance": "Small drawstring pouch approximately 12cm by 10cm, heavy silk brocade in deep blue (#1A237E) with subtle woven pattern. Braided drawstring of gold and blue threads. Full and heavy, bulging with contents - bronze coins with square center holes strung on cords, plus small silver ingots. Fabric shows wear at corners from handling.",
      "era_notes": "Song Dynasty currency was bronze coins with square holes, strung in quantities, plus silver ingots."
    },
    {
      "tag": "PROP_LANTERN",
      "name": "Oil Lantern",
      "appearance": "Simple oil lantern standing approximately 30cm tall. Dark bronze frame with carrying handle. Oil reservoir at base filled with vegetable oil. Cotton wick extends from metal holder. Thin translucent horn panels diffuse light into warm amber glow (#FFBF00). Flame flickers gently with air movement.",
      "era_notes": "Oil lanterns with horn panels common in Song Dynasty China."
    }
  ]
}