{
  "title": "mimi",
  "genre": "Drama",
  "visual_style": "live_action",
  "style_notes": "",
  "logline": "A young courtesan risks everything in a high-stakes game of Go to win her freedom and pursue true love with a humble florist who tends his flowers with the same gentle care she longs to receive.",
  "synopsis": "Set in what appears to be imperial China, Mei is the prized courtesan of the legendary brothel Lu Xian, groomed by Madame Chou in the arts of intellect, seduction, and pleasure. As she comes of age, two wealthy suitors—General Zhao and merchant Min Zhu—compete for her purchase. However, Mei has secretly fallen in love with Lin, a florist whose shop sits below her window, watching him tend his flowers with devoted care each day and night.\n\nDesperate to escape her fate and pursue true love, Mei approaches the gambling merchant Min Zhu with a bold proposition: she will wager her own savings against a discounted price for herself in a game of Go. If she wins, he must match her payment, allowing her to buy her own freedom. During the crucial match, Mei uses her training in seduction to distract the merchant at a pivotal moment, securing her victory through cunning rather than skill. Newly freed, she rushes to Lin's flower shop, where he has just finished reading her heartfelt letter confessing her love and desire to be cherished like his beloved flowers.",
  "themes": "Freedom vs. bondage, authentic love vs. transactional relationships, agency and self-determination",
  "world_rules": "Set in imperial China's pleasure quarter system where courtesans are valuable commodities trained in refined arts; social hierarchy strictly divides classes with military generals and wealthy merchants at the top; the game of Go serves as both entertainment and serious business negotiation; courtesans can theoretically purchase their own freedom but rarely have the means; the world operates on honor-bound agreements and verbal contracts that must be kept.",
  "lighting": "Warm, golden hour cinematography with soft lantern light for intimate interior scenes, contrasting harsh daylight in the brothel with gentle, dappled sunlight in the flower shop",
  "vibe": "Romantic, contemplative, bittersweet, hopeful",
  "characters": [
    {
      "tag": "CHAR_MEI",
      "name": "Mei",
      "role": "protagonist",
      "description": "Mei possesses an ethereal beauty standing at average height with a willowy, graceful build that moves with practiced elegance. Her long, silky black hair cascades to her waist, often adorned with jade pins and silk ribbons that catch the light. Her almond-shaped dark eyes are expressive and intelligent, framed by naturally arched brows, while her porcelain complexion appears flawless yet hints at the weight of her confined life. Her delicate features include high cheekbones and naturally rose-tinted lips, creating an overall impression of refined beauty tinged with melancholy and hidden strength."
    },
    {
      "tag": "CHAR_LIN",
      "name": "Lin",
      "role": "love_interest",
      "description": "Lin has a lean, medium build shaped by physical labor, with naturally broad shoulders and strong, gentle hands marked by soil and plant stains. His thick black hair is often tousled from outdoor work, kept at shoulder length and sometimes tied back with simple cord. His warm brown eyes are kind and observant, set in an honest face with strong cheekbones and a naturally serious expression that transforms completely when he smiles. His skin has a healthy, sun-touched glow from working outdoors, and he carries himself with quiet confidence and natural grace."
    },
    {
      "tag": "CHAR_MADAME_CHOU",
      "name": "Madame Chou",
      "role": "mentor/antagonist",
      "description": "Madame Chou maintains an imposing presence despite her average height, with a sturdy build that suggests both comfort and authority. Her graying black hair is always perfectly arranged in elaborate traditional styles adorned with expensive ornaments that display her wealth and status. Her sharp, calculating dark eyes miss nothing, set in a face that shows traces of former beauty now hardened by years of difficult decisions. Her complexion is well-maintained but bears the subtle lines of constant vigilance and stress, while her overall demeanor projects controlled power and sophisticated threat."
    }
  ],
  "locations": [
    {
      "tag": "LOC_LU_XIAN_BROTHEL",
      "name": "Lu Xian Brothel - Main Hall and Courtyards",
      "description": "An opulent three-story traditional Chinese pleasure house built around interconnected courtyards, featuring carved wooden galleries, ornate red pillars, and sweeping curved rooflines with upturned eaves. The structure combines multiple pavilions connected by covered walkways, with the main reception hall at the center. Rich fabrics drape from windows, and paper lanterns hang at varying heights throughout the complex."
    },
    {
      "tag": "LOC_PRESSED_DIRT_ROAD",
      "name": "Village Market Street",
      "description": "A narrow thoroughfare of hard-packed earth worn smooth by countless feet, carts, and horses. The road runs between two-story buildings with overhanging upper floors that nearly touch across the street. Wooden storefronts line both sides, with fabric awnings and hanging signs swaying in the breeze. Deep wheel ruts mark the center where merchant carts pass daily."
    },
    {
      "tag": "LOC_MEI_BEDROOM_PATIO",
      "name": "Mei's Private Terrace",
      "description": "A small wooden balcony extending from a second-floor bedroom, enclosed by an intricately carved wooden railing with geometric patterns. The terrace is just large enough for a single person to stand comfortably, with potted plants and a small silk cushion for sitting. Bamboo screens provide partial privacy while allowing views of the street below."
    }
  ],
  "props": [
    {
      "tag": "PROP_RED_SILKEN_BEDDING",
      "name": "Red Silk Bedding",
      "description": "Luxurious bedding used in the courtesan's private chambers"
    },
    {
      "tag": "PROP_BAMBOO_MATS",
      "name": "Fine Bamboo Floor Mats",
      "description": "Traditional woven floor mats used for seating during the Go game"
    },
    {
      "tag": "PROP_BLUE_KIMONO",
      "name": "Blue Silk Kimono",
      "description": "Mei's elegant outer garment worn during the Go game"
    },
    {
      "tag": "PROP_MAHOGANY_TABLE",
      "name": "Mahogany Gaming Table",
      "description": "Low, formal table used for the Go game"
    },
    {
      "tag": "PROP_HAIR_RIBBON",
      "name": "Silk Hair Ribbon",
      "description": "Delicate ribbon used to bind Mei's hair"
    },
    {
      "tag": "PROP_LANTERN",
      "name": "Paper Lantern",
      "description": "Traditional hanging lantern providing warm light in Lin's shop"
    },
    {
      "tag": "PROP_TEA_CUP",
      "name": "Porcelain Tea Cup",
      "description": "Delicate cup used to serve tea during the Go game"
    },
    {
      "tag": "PROP_WOODEN_GO_BOARD",
      "name": "Traditional Go Board",
      "description": "Classic game board for the ancient strategy game"
    }
  ],
  "all_tags": [
    "PROP_RED_SILKEN_BEDDING",
    "PROP_BAMBOO_MATS",
    "PROP_BLUE_KIMONO",
    "CONCEPT_TRUE_LOVE",
    "PROP_MAHOGANY_TABLE",
    "PROP_HAIR_RIBBON",
    "CHAR_MEI",
    "CHAR_LIN",
    "PROP_LANTERN",
    "CHAR_MADAME_CHOU",
    "LOC_LU_XIAN_BROTHEL",
    "CONCEPT_FREEDOM",
    "LOC_PRESSED_DIRT_ROAD",
    "PROP_TEA_CUP",
    "LOC_MEI_BEDROOM_PATIO",
    "PROP_WOODEN_GO_BOARD"
  ]
}